{"138": "𝗥𝗲𝗱𝘂𝗰𝗶𝗿, 𝗥𝗲𝘂𝘁𝗶𝗹𝗶𝘇𝗮𝗿, 𝗥𝗲𝗰𝗶𝗰𝗹𝗮𝗿. The true circular city is based on the 3 Rs. But what do we mean when we talk about a circular city? 🌆\n\nWhat better than on #WorldRecyclingDay to tell you about it ♻️ https://t.co/yakMT0SLEp", "139": "RT @ACCIONACareers: It is never too late to continue training. With the new development and continuous training methods, you can retrain yourself…", "140": "RT @ACCIONA_CL: The main challenge when it comes to achieving more efficient recycling is to collect clothing items 👕 and separate them according to…", "141": "RT @ACCIONAEnergia: We enter Thailand with five 436MW wind projects that we will develop together with our subsidiary The Blue Cir…", "142": "RT @ELICO97417164: Vote for the candidacy presented by @ACCIONA for the @acex_asociacion 2023 Awards! https://t.co/RW7GEjDYLq #ACCIONAte…", "143": "RT @Amanda_SandN: What is the most sustainable and cheapest energy? The one that is not used and saved! https://t.co/KLLZaZQ2Cl #ACCIONAteam", "144": "RT @Renata_RAlves: An innovative device to measure air quality will allow pollution to be monitored in homes and outdoors for…", "145": "RT @EventosUE: 📆@MARCA and @Acciona celebrate the event 'New urban vehicles, new way of driving' on May 2⃣4⃣\n\n👉Do you…", "146": "Bees are VITAL for the planet 🐝 🌍#WorldBeeDay\n\n👇This is what would happen if they disappeared 👇 https://t.co/GveaouVvlv", "147": "RT @jlblasco: Vote for the candidacy presented by @ACCIONA for the @acex_asociacion 2023 Awards! https://t.co/GS4H1vG1JG #ACCIONAteam", "148": "RT @JLBuenoMendez: ACCIONA will build the Riquelme-Torrepacheco section of the Murcia-Cartagena AVE https://t.co/XDPOCOya9s via @ACCIONA", "149": "RT @YIRAJS: New metamaterial: a tactile concrete will generate energy @ACCIONA #Imnovation https://t.co/jrkmgJGG0c", "150": "RT @Amanda_SandN: .@ACCIONA crowns the dam of the Carén reservoir expansion project, in Chile https://t.co/OKdmsqg9lC #ACCIONAteam", "151": "RT @EduardoSanjurjo: The San Juan de Marcona wind turbines are already in Peru | @ACCIONAEnergia https://t.co/JH4QeF0TmV #ACCIONAteam", "152": "RT @simaexpo: 📝 Real estate of the future. Short and medium term perspectives\n\n🗓️ Wednesday 24 May\n🕝 11:30-12:15\n📍SIMAPRO1\n\n@ACCIONA, @AX…", "153": "The conservation of the puma in Chile 🇨🇱 and the regeneration of the ecosystem: a success story that @tv_Amaro tells you on #WorldBiodiversityDay 🐈🌎\n\nDon't miss the full story here 📺➡️https://t.co/hm036mdrg1 https://t.co/9Gxp4MgLX5", "154": "RT @ALEJAND78010925: Vote for the candidacy presented by @ACCIONA for the @acex_asociacion 2023 Awards! https://t.co/RtVZph5YEM #ACCIONA…", "155": "RT @Enerclub: #EnergyNotebooks\nIn \"Mallorca, the first green hydrogen ecosystem on a European island\" @belenlinaresc Dtra. Innovation and…", "156": "RT @EventosUE: 2⃣4⃣ hours for the event 'New urban vehicles, new way of driving' celebrated by @MARCA and @Acciona\n\n👉Last pla…", "157": "RT @voz_populi: Don't miss today, starting at 11 am our #DigitalMeeting with Miguel Ángel Rodríguez (@ACCIONA), expert in #Intel…", "158": "RT @scout31v: The future 👇😍", "159": "RT @mariovicente_: When you start digging... incredible things happen 🤯 @ACCIONA finds medieval remains during the rehabilitation of the…", "160": "RT @DiegoramiroPini: When you start digging... incredible things happen 🤯 @ACCIONA finds medieval remains during the rehabilitation of…", "161": "RT @ACCIONACareers: 🙋 40 participants\n💥 An innovative and interactive experience\n💫 A digital environment\n\nIn this new edition, we get involved…", "162": "RT @EventosUE: ⚔️‘New urban vehicles, new way of driving’ #NewUrbanosMARCAVehicles #DescarbonizePlanet\n\n🗣️Pepe Martí (@a…", "163": "RT @Espanha_Brasil: 🏆 @ACCIONA receives an award for its risk prevention policy: it receives the Recognition of Merit in Business Management…", "164": "RT @ACCIONACareers: Do you want to be part of the @ACCIONA Academy Program in Spain? \n\nGet ready to have your first contact with the world…", "165": "RT @campillo_elvira: Impressive 😲", "166": "RT @ACCIONAEnergia: 👏ACCIONAPLUG, has recently joined @H2Europe \nIt is essential to participate in these organizations to identify…", "167": "RT @asun_padros: Do you want to be part of the Academy Program of \n@ACCIONA? 🇪🇸 Get ready to have your first contact with the professional world of…", "168": "RT @Renata_RAlves: A study that will help you understand the employment implications of the specialized or generalist professional when staying…", "169": "RT @Imnovation: We develop new corrosion protection strategies and analyze temperature patterns in industrial boilers…", "170": "RT @Maria83831676: Initiative to promote honey production around the Sishen photovoltaic plant https://t.co/Aoa5g1TP8s vi…", "171": "RT @Imnovation: This impressive photovoltaic plant is installed in the Atacama Desert, Chile 🇨🇱, and represents a logistical 𝗴𝗿𝗮𝗻 𝗿𝗲𝘁𝗼…", "172": "RT @simaexpo: 🗨️ \"At the level of market demand, there is a difference between the institutional and final client. The final client may have more or…", "173": "RT @javiercerrudo: In this new edition of the Academy Program in Spain, we are more involved than ever with #youngtalent, bringing the…", "174": "RT @Imnovation: Converting waste into a resource is one of the pillars of the circular economy 👉 a young researcher from @NUSingapore has...", "175": "RT @Renata_RAlves: \"NIPARMOX® is an efficient technology in line with the sustainability of @ACCIONA's operations\" https://t.co/2OpAuklk…", "176": "RT @javiercerrudo: A study that will help you understand the employment implications of the specialized or generalist professional when staying...", "177": "RT @ACCIONA_CL: According to the UN, human activity has altered three quarters of the terrestrial environment 🌎 and around 66% of the marine environment...", "178": "Good news from Canada! 🇨🇦 We celebrate with @GhellaSpa the second stop of the Phyllis tunnel boring machine at the future Broadway-City Hall station (@broadwaysubway_) \n\nhttps://t.co/jfLHob8vds", "179": "RT @ACCIONACareers: Haven't you signed up yet? After the success of previous editions, the new edition of the #AcademyACCION Program arrives…", "180": "RT @Imnovation: FISSAC facilitates the exchange of information by involving interested agents at all levels of the value chain…", "181": "RT @NavarraCapital: 👥 ASSEMBLY 🗣 José Manuel Entrecanales, @ACCIONA: “The #FamilyBusiness is especially well equipped to lead…", "182": "RT @AlanHenriquez: When you start digging... incredible things happen 🤯 @ACCIONA finds medieval remains during the rehabilitation of the…", "183": "Our latest news and most impressive projects, in the May #newsletter🗓️ Don't miss anything 📷 ⤵\nhttps://t.co/4IUHYwoWH9 https://t.co/ynSFTaMoqg", "184": "RT @DiegoramiroPini: .@ACCIONA and its partner celebrate the arrival of one of the tunnel boring machines at the second Broadway Metro station (Canada…", "185": "RT @misslop1: ACCIONA Energía partners with the shopping center manager; Urbil (Usurbil, Guipúzcoa), Berceo (Logroño), Alcora Plaza…", "186": "RT @misslop1: ACCIONA Energía and The Blue Circle enter Thailand with five wind projects https://t.co/AeIHESPzwf via @ACCIONA", "187": "RT @ACCIONACareers: 📢 The #AcademyACCIONA Program in Spain is here 💡 2 weeks of intensive training that will prepare you for the world…", "188": "RT @ACCIONAEnergia: Today at 12 noon we will hold our General Shareholders' Meeting. You can follow it live on social networks and with the…", "189": "RT @Amanda_SandN: For 30 years we have been looking for pioneering solutions in desalination, purification, purification and reuse of water 💧 maxi…", "190": "RT @EduardoSanjurjo: Do ​​you want to be part of the Academy Program of \n@ACCIONA? 🇪🇸 Get ready to have your first contact with the professional world...", "191": "For each obstacle, 𝗻\n\n🌉🌉🌉\n\nDiscover the new generation of BRIDGES that contributes to promoting our #ACCIONAteam 😍", "192": "RT @MilcosasAmano: I just freaked out with this news 😯\nNew metamaterial: a tactile concrete will generate energy @ACCIONA #Imnovation https://…", "193": "Discover all the news that our company has experienced during the month of May 2023 👀 | #ACCIONAin1min", "194": "@animemultipost Objective achieved 😎", "195": "RT @sarrateishon: A solar desalination plant based on banana skins @ACCIONA #Imnovation https://t.co/LoGx8Px4uJ", "196": "RT @ifm_community: Javier Cerrudo, Technical Area &amp; Innovation Manager at @ACCIONA, joined us at the Madrid Summit to talk to us about…", "197": "@Sara03_21 We're glad you think that way, really 😎", "198": "RT @mariovicente_: Discover all the news that our company has experienced during the month of May 2023 👀 | #ACCIONAen1min https://t.c…", "199": "5 reasons why we should take care of the oceans 🌊\n\n#WorldOceansDay\nhttps://t.co/Vur4ATwVpq", "200": "RT @photoespana: #PHE Opening 'Edward Burtynsky: African Studies' We are waiting for you today at 7pm at @centrocentro\n\nIn #AfricanStudies the…", "201": "📆 Next Tuesday, June 13, we will be at the XIII International Congress @AEDyR_es under the theme “Looking to the future” 💧\n\nEduard will participate in the presentation 'Hades: a Tool for Comprehensive Predictive Control in WWTPs through Digital Twins' 📢 Sign up ⤵", "202": "That same day, at 4:15 p.m., we will also have the presence of Mar Micó Reche, Head of the Purification and Resources Area, at the XIII International Congress @AEDyR_es 💦\n\nDon't miss it 👉 https://t.co/s2B38aJuUy https://t.co/SWzO3vMEXE", "203": "📆June 13\n📍 XIII International Congress @AEDyR_es \n\nWe will also have the participation of Paula Perez, Water Digital Transformation Manager, speaking about digitalization in the field of the circular economy: the @ACCIONA model 💧\n\n👉 https://t.co/Gx5xJjqlaL https://t.co/20alvItSP5", "204": "Protecting the oceans means protecting humanity\n\n🌊🌊🌊 \n\nDon't miss this story 200 meters deep with the most famous oceanographer on the planet, @SylviaEarle, on #WorldOceansDay https://t.co/r1yI4NQjn4", "206": "RT @oarcinie: Augmented reality will allow you to see through walls @ACCIONA #Imnovation https://t.co/i1S68Uyu5U", "207": "RT @centrocentro: New exhibition in #CentroCentro!\n \n📷 This afternoon the exhibition \"African Studies\" opens, presenting the work of…", "208": "RT @r_ventosa: Video with the current status of construction of the Pattullo Bridge over the Fraser River, in Vancouver (Canada). This future attracts…", "209": "A week to celebrate! 🥳We received three awards in #PremiosCaminosMadrid from @caminosmadrid, for “Research and innovation”, “Best exterior career 2022” and “Contributions in new areas of road engineering”. We are very happy 😎💪\n\nhttps://t.co/aumd6gNzjU", "210": "Inaugurated the exhibition \"African Studies\" by Edward Burtynsky with @photoespana 📷\n\nThe artist's excellent work shows the vulnerability of the African population to the impact of industrial activity, in contrast to the magnificence of the virgin landscape 🖼 #PHE23 https://t.co/0oCyZDhvhc", "211": "RT @ACCIONACareers: The second edition of the #AcademyACCIONA program starts in Peru 🇵🇪\n\nA development program that focuses on young talent…", "212": "How to lift a wind blade 105 meters without a heavy crane? 👀 The answer 👇 https://t.co/nZDXOkVBfu", "213": "Did you know that @acciona_org has already achieved a positive impact on 4 continents? Supported by a local team and #ACCIONAteam volunteers, it brings clean water and energy to remote communities ☀️🚾\n\nIf there is a job that we are proud of, it is this ⤵️ https://t.co/NlwRCdWrsP https://t.co/gkKZzrj72d", "214": "RT @ACCIONACareers: When we face a tedious or complicated task at work, we can follow 2 paths: frustration or…", "215": "RT @jlblasco: Interested in #renewableenergy and #sustainableinfrastructure? 🤔\n\nThe #AcademyACCIONA Program is your opportunity. Sign up…", "216": "RT @ACCIONAEnergia: 📢 We acquired @Solideo_Energia, in joint-venture with @ACCIONA, to enhance the self-consumption and generation business…", "217": "RT @J_J_Malfeito: Eduard Muñoz Craviotto, from our water innovation team at @ACCIONA, presents the project “Hades: a tool…", "218": "RT @Renata_RAlves: 📢 Elena is Digital Business Development &amp; Smart Society Manager at @ACCIONA. Engineer, innovator and mother, she is driving…", "219": "📅 June 15\n📍 Malaga (@Fycma)\n\nDon't miss our Manager Responsible for Purchasing Processes and Systems, Aitor González, at the ''CPO Summit'' of the @DES_show 📣\n\nMore information and registration here 👇", "220": "RT @EduardoSanjurjo: Interested in #renewableenergy and #sustainableinfrastructure? 🤔\n\nThe #AcademyACCIONA Program is your opportunity. Ap…", "221": "RT @Silviajfra: 📢 Elena is Digital Business Development &amp; Smart Society Manager at @ACCIONA. Engineer, innovator and mother, she is promoting…", "222": "RT @Renata_RAlves: .@ACCIONA receives the Top3 award from Construmat for the Corrochip project https://t.co/VLwuzFxdJS #ACCIONAteam", "223": "RT @ACCIONAEnergia: Our President José Manuel Entrecanales and our partners @enagas, had the opportunity yesterday to present the project…", "224": "RT @Amanda_SandN: A study proves that employee motivation and satisfaction increase when affirmative leadership is practiced…", "225": "RT @simaexpo: ✨ What does SIMA mean to you? \n\n👤 Asís Colomina, Director of Real Estate Promotion at @ACCIONA in Spain, gives us this answer…", "226": "RT @Amanda_SandN: Great news! @ACCIONA has been awarded a section of the Bilbao metro, thus promoting sustainable mobility in the city…", "227": "RT @Silviajfra: Great news! @ACCIONA is awarded a section of the Bilbao metro, thus promoting sustainable mobility in the city…", "228": "Mattias Ekström (@mattiasekstroem), the perfect partner for @accionasainz. He knows the impressions of him as a team driver, the inspiration in @CSainz_oficial and the rapport with @LaiaSanz_\n\n💪🚗 #DrivenByNature https://t.co/0XvWs73jxM", "229": "RT @BKOceanGrove: A bamboo and biodegradable plastic tower that collects water from dew @ACCIONA #Imnovation https://t.co/d5AaRHXowd", "230": "RT @ACCIONACareers: Is it possible to defend work ethics? 🤝 Today we talk about individual responsibility for immorality,…", "231": "RT @DiegoramiroPini: A study proves that employee motivation and satisfaction increase when affirmative leadership is practiced…", "232": "This is the story of a plant that fed the dinosaurs 🌿🦕 Also, that of one of the largest wind farms in the southern hemisphere 🌬️🌏\n\nBut, above all, it is a story of contribution to environmental research 👇\nhttps://t.co/kiMj9KWlfI", "233": "RT @DiegoramiroPini: Fostering a work environment based on respect, integrity and responsibility contributes to the well-being of…", "234": "RT @Amanda_SandN: “@ACCIONA is the most complete provider of sustainable infrastructure solutions in the world” #ACCIONAJGA23 https://t.c…", "236": "RT @ACCIONACareers: Good lighting in your home can make a difference 📷 \n\nOn #SunDay ☀ we give you this and other keys…", "237": "We are recognized for our project “Digitization of Health and Safety management in projects through a Data Analysis Center (Smart Center) and we are very happy to share it 👷‍♀️👷 Congratulations, #ACCIONAteam! https://t.co/uyZ4dOdOar", "238": "A virtual art project promoted by @MIT combines drones and 3D imaging to be able to visit the architectural jewels of Afghanistan without leaving home 🏰 https://t.co/aRfqnsP2o6", "239": "RT @fbzeni: Floating photovoltaics are a clean energy with additional advantages, as proven by the Sierra Brava plant. ht…", "240": "RT @ACCIONAEnergia: From wind farms and solar plants to smart and sustainable solutions. The work of the women of our country is…", "241": "RT @ACCIONACareers: On International Women's Day in Engineering, we reflect on the present and, above all, the future of…", "242": "Good news! 👏\n\nWe have been awarded in the 2023 Construction, Public Works and Mining Power Awards, for our project “Sagrera Central High Speed ​​Station (Barcelona)” 🏆 https://t.co/NO3128SBTW", "243": "RT @DiegoramiroPini: .@ACCIONA, recognized for the inclusion, commitment to the sustainability of various socially responsible organizations…", "244": "RT @ACCIONACareers: Internet addiction experienced a peak in 2020 📲\n\nReversing digital addiction in the midst of the rise of teleworking seems...", "245": "RT @ACCIONAEnergia: We expand our collaboration with @amazon\n\n192 additional MW with which we will help them meet their power goal…", "246": "@raulitolindo It's in Castilla y León, Spain :)", "247": "RT @EduardoSanjurjo: “@ACCIONA is the most complete provider of sustainable infrastructure solutions in the world” #ACCIONAJGA23 https://…", "248": "RT @ELICO97417164: .@ACCIONA expands its collaboration with Amazon for clean energy and digital transformation https://t.co/Ygvx902Q3F #ACCION…", "249": "RT @agalavillares: “@ACCIONA is the most complete provider of sustainable infrastructure solutions in the world” #ACCIONAJGA23 https://t.…", "250": "RT @DiegoramiroPini: ➡ Deep knowledge of ACCIONA's businesses\n➡ Intensive training in soft skills\n➡ Networking\n➡Business case…", "251": "RT @agalavillares: Do you want to live the #AcademyACCIONA experience? 👀 \n\nA program that promotes young talent, adapting to your needs...", "252": "RT @awscloud_es: 💡 @ACCIONA and Amazon have announced the extension of their energy purchase and sale agreements. These will help Amazon fulfill…", "253": "RT @javiercerrudo: Do ​​you want to live the #AcademyACCIONA experience? 👀 \n\nA program that promotes young talent, adapting to your needs...", "254": "Floating photovoltaics is a clean energy with additional advantages 😎 As proof, not a button, but directly a real PV plant: the Sierra Brava plant, in Spain ☀️💦 https://t.co/L2zAbBa7iV", "257": "Countdown 🏎️🙌 https://t.co/PHCfWLq234", "258": "RT @javiercerrudo: .@ACCIONA expands its collaboration with Amazon for clean energy and digital transformation https://t.co/9PLYaH3UL2", "260": "@FranOrcajo Thank you very much 🙏👏", "261": "▶ Discover all the news that our company has experienced during the month of June 2023 👀 | #ACCIONAen1min https://t.co/V04isKSHZn", "266": "⏰ In just 20 minutes voting opens in GridPlay to support the @AccionaSainz drivers in tomorrow's race ⚡🏁\n\nVote here to help our great team! 💪🏎💨 #DrivenByNature #IslandXPrix @LaiaSanz_ @mattiasekstroem @ExtremeELive \n\n👉 https://t.co/XeCbOwkcki", "268": "RT @AccionaSainz: Help us choose starting position in the final!\nVOTE FOR LAIA: https://t.co/R3kH1vg4ey\nVOTE FOR MATTIAS: https://t.co/cEL…", "275": "Good news! We invest in Machine Learning and partner with @saalgGeomech to predict the real behavior of the terrain during the execution of tunnel construction projects 🚇✅\n\nGet the details 👇 @Imnovation", "276": "Last Friday we celebrated the end of the II edition of the Global Executive Program (iGEP), in collaboration with @goheadspring ✅\n\nOur managers actively participated in the program, in line with @ACCIONA's commitment to people 👏 #PeopleACCIONA #ACCIONAteam https://t.co/nRJ6P4H3xd", "277": "RT @ACCIONA_BR: Discover Elena Navarro's story! 🧑💡  \n\nDigital business development and smart society manager at @ACCI…", "278": "RT @Espana_Peru: @ACCIONA social development initiatives in Peru:\n\n👉Participation in Volunteer Day teaching children about #…", "279": "We developed a ten-year plan to protect biodiversity and drive progress on Rodrigues Island, an autonomous island of Mauritius 🏝✅\n\nKnow the details 👇", "280": "Good news! 📢 We renewed the operation and maintenance contract of the sanitation system of the municipality of Amorebieta-Etxano (Bizkaia), which we have been managing in various stages since 2007 ✅👇", "282": "RT @ACCIONA_CL: Workers from @ACCIONA's Embalse Carén project supported with a donation of caps for the “J… campaign.”", "283": "RT @mariovicente_: Good news! We carried out our third #water treatment plant in the Philippines ''East Bay 2'', and its subsequent operation…", "284": "RT @Renata_RAlves: ACCIONA, internationally awarded for the promotion and innovative management of occupational health and safety https://t.co/…", "285": "RT @ACCIONA_CL: Let's talk about inclusion 👇\n\nA prototype of wearable technology will make it possible to operate wheelchairs and electronic devices…", "286": "🐝🤯 Termite mound structures provide the key to building 3D printed biomimetic buildings, with passive ventilation and carbon neutral. Discover the process here 👇\nhttps://t.co/ptKZGp152W", "287": "RT @elibanos: #avant-garde architecture, excellence in execution, #regeneration, solutions that improved and still improve the lives of…", "288": "RT @agalavillares: Good news! We have completed our third #water treatment plant in the Philippines, ''East Bay 2'', and its subsequent operation…", "289": "RT @accionacultura: 📢 \nCome to the Royal Palace on July 26 and 27 to attend our latest multimedia show with a theme of the 2019…", "290": "How does the weather station of a photovoltaic plant work? ☀️ Trinidad Fonseca, O&amp;M technician at @ACCIONAEnergia in Chile tells you 🇨🇱\n\nThank you very much, Trinidad! #ClimateGramers https://t.co/kB0eDeFoul", "291": "It looks like a museum 🖼️ A century after its construction, the Seira Hydroelectric Power Plant continues to produce clean energy ⚡️, while the beauty of its architecture and machinery are a true joy for the senses. Don't miss the gallery and video 😍", "292": "RT @ACCIONACareers: Innovation, differentiation and value creation are key challenges for companies 💡🎖 Find out how to foster the gener…", "293": "RT @ACCIONAEnergia: How does the #weather station of a #photovoltaic plant work? Find out from Trinidad Fonseca, a techni…", "294": "RT @ACCIONA_CL: 436 @ACCIONA workers in #Peru were trained on the importance of compliance processes, to…", "295": "RT @mariovicente_: The @ACCIONA Compliance team carried out a round of training in Peru on the importance of compliance processes…", "296": "RT @Amanda_SandN: DEIB policies are initiatives with the objectives of creating and maintaining a work environment free of discrimination and harassment…", "297": "RT @Amanda_SandN: This is how impressive the transportation of the blades that will make up the #San Juan de Marcona #WindFarm, in Peru is. Did I know…", "298": "RT @javiercerrudo: The EU tasks ACCIONA with a decarbonization plan for remote islands 🏝✅ https://t.co/sHUZHUHs0j", "299": "RT @mariovicente_: .@ACCIONA and @ACCIONAEnergia add local impact to their new Green Financing framework. #ACCIONAteam https://t.co/ySk9a…", "300": "RT @EduardoSanjurjo: 📢 In just a few days the @ACCIONA Academy Program begins in Mexico 🇲🇽\n\nImmerse yourself in the company's business, with…", "301": "RT @eiriartem: @ACCIONA will carry out works to prevent forest fires in Castilla y León https://t.co/H7aHatAhkf", "303": "RT @PatrimNacional: @sanchezcastejon @AnadelaCuevaF @CasaReal @ACCIONA @accionacultura \"An unmatched milestone in the history of @PatrimNacion…", "304": "RT @GetsemaniQu: A cactus teaches how to produce green hydrogen @ACCIONA #Imnovation https://t.co/yA5Hzu4CEr", "305": "RT @EduardoSanjurjo: .@ACCIONA launches the “#Decarbonization of Suppliers” program to accompany #SMEs that are part of our cad…", "306": "RT @cr_alvarez: .@ACCIONA, selected to build and operate the bridge over the Calcasieu River in Louisiana (USA). #ACCIONAteam https://t…", "307": "RT @DiegoramiroPini: .@ACCIONAEnergia builds a new 280MW project in Canada #ACCIONAteam https://t.co/LOYvz8lXar", "308": "RT @DiegoramiroPini: Breaking news! 🙌 ACCIONA carries out several pilot projects based on the use of #hydrogen with the aim of…", "309": "#ACCIONA1S23 | We achieved a net profit of 467 million euros (+132.5%) during the first half of 2023 📈\n\nSome key facts in this thread [🧵] https://t.co/74PcEVc8Ok", "310": "#ACCIONA1S23 | Investment of 2,200 million euros (+80.7%): distributed, fundamentally, between @ACCIONAEnergia (€1,544 million), Nordex (€302 million) and Real Estate (€136 million)\nhttps://t.co/74PcEVc8Ok", "311": "RT @AlanHenriquez: Lessons in sustainable regeneration: The generous and intelligent life of plants https://t.co/zB2wt43tfa", "312": "A bank of shapes almost unattainable for traditional techniques created for the Puerta Barqueta real estate development in Seville confirms the potential of architectural 3D #printing 🧱🤖 \n\nDiscover how we have given life to this hybrid between furniture and sculpture ⤵️", "314": "RT @DoloresPoliz: The warming of the Arctic could encourage meteorological phenomena such as torrential rains and heat waves in the areas…", "315": "RT @GerardF03277799: This robot plants trees to reforest the Amazon @ACCIONA #Imnovation https://t.co/7uZGBKULtG", "316": "RT @javiercerrudo: DEIB policies are initiatives with the objectives of creating and maintaining a work environment free of discrimination and harassment…", "317": "RT @Amanda_SandN: Electric mobility gains momentum: is it time to switch to an electric car? https://t.co/4W72gGKaXT", "318": "It's not a celebration, it's an alert 😩 This year, August 2 is #EarthOvercapacityDay 2023 🌏, the date that marks that humanity has consumed all the resources that the planet is capable of generating in a year https: //t.co/xHwzazhjT1", "319": "@BastidaBroker Philippines :)", "320": "RT @Daniell_acostaa: Alarming! ⚠️ For 2023 today is #OvercapacityDay 🌎 which means that humanity has consumed the…", "321": "RT @AlanHenriquez: .@ACCIONA and @ACCIONAEnergia add local impact to their new Green Financing framework. #ACCIONAteam https://t.co/6kmOO…", "322": "RT @javiercerrudo: .@ACCIONA wins €467 million, accelerates in infrastructure and consolidates Nordex. #ACCIONA1S23 #ACCIONAteam https://t.co/4Cv…", "323": "RT @Amanda_SandN: .@ACCIONA and @ACCIONAEnergia add local impact to their new Green Financing framework. #ACCIONAteam https://t.co/BHJO7K…", "324": "RT @magailusionista: This robot plants trees to reforest the Amazon @ACCIONA #Imnovation https://t.co/pUzkFWbYhV", "325": "RT @EduardoSanjurjo: The latest news and most impressive projects from @ACCIONA, in the July #newsletter🗓️ Don't miss anything 📷 #ACCI…", "326": "How to recycle wind blades for solar plants? ☀️ https://t.co/7aVsVf5Usc", "327": "Always @rickyrubio9. We say it and we will not get tired of saying it: you are a great example and a mirror in which to look at yourself ❤️", "328": "RT @JoAguilarMedina: On the dream city of @CarlosLanga: \"The obligation of an urbanite is to leave the following generations something better…", "329": "RT @ACCIONA_CL: The Green Hydrogen Bahía Quintero (HVBQ) project, which @ACCIONAEnergia promotes together with Enagás and GNL Quintero, was awarded…", "330": "RT @Amanda_SandN: .@ACCIONA supports the construction of the communal premises of the Oasis human settlement, with which it is linked within the framework of…", "331": "RT @mariovicente_: Seville plans to install refrigerated and solar-powered bus shelters in 2024 as one of the solutions…", "332": "RT @Renata_RAlves: Good news for the @acciona_org foundation! It has just announced its first water project in Chile. Know the details…", "333": "RT @Amanda_SandN: Good news for the @acciona_org foundation! It has just announced its first water project in Chile. Learn the details…", "334": "RT @mariovicente_: .@ACCIONA is awarded the Majors Road Interchange project in Adelaide (Australia) #ACCIONAteam https://t.co/WVGY50XDi6", "335": "RT @ACCIONA_CL: The practices and knowledge of indigenous peoples who live in harmony with the natural environment 🍁 can teach us a lot…", "336": "RT @ACCIONACareers: ✅ If you have finished or are finishing your Bachelor's or Master's studies, this interests you ➡ Very soon the…", "337": "RT @ACCIONAEnergia: Concentration, precision and teamwork. This is how we built a photovoltaic plant 🌞⤵ https://t.co/3VnngpFSnS", "338": "RT @DiegoramiroPini: ✅ If you have finished or are finishing your Bachelor's or Master's studies, this interests you ➡ Very soon the…", "339": "RT @DiegoramiroPini: The Ara Tūhono - Pūhoi to Warkworth highway opened in New Zealand. Congratulations #ACCIONAteam! https://t.co/y9F…", "340": "RT @AlanHenriquez: The Ara Tūhono - Pūhoi to Warkworth highway opens in New Zealand. Congratulations \n\n#ACCIONAteam! https://t.co/HHr…", "341": "RT @Amanda_SandN: The Ara Tūhono - Pūhoi to Warkworth highway opens in New Zealand. Congratulations #ACCIONAteam! https://t.co/cPVLml…", "342": "RT @javiercerrudo: .@ACCIONA uses renewable biofuel in heavy machinery within the Fargo-Moorhead project. #ACCIONAteam https://…", "343": "RT @Renata_RAlves: .@ACCIONA is awarded the Majors Road Interchange project in Adelaide (Australia) #ACCIONAteam https://t.co/0CmN8gnL5n", "344": "The frequency and intensity of atmospheric rivers increases 🌧️ And with them, the risk of heavy rains and flooding. Chile 🇨🇱 has already experienced it in its streets. Discover this phenomenon ⤵️ https://t.co/0hs5PgOk8P", "345": "RT @javiercerrudo: The frequency and intensity of atmospheric rivers increases. And with them, the risk of heavy rains and flooding…", "346": "RT @Amanda_SandN: Renewable hybridization: when the wind and the sun shake hands https://t.co/8go8LzaZ3Z", "347": "RT @ELICO97417164: .@ACCIONA, selected to build and operate the bridge over the Calcasieu River in Louisiana (USA). #ACCIONAteam https:…", "348": "30 years ago, @ACCIONAEnergia launched the first commercial wind farms in Spain 🇪🇸\n\nDiscover the evolution of wind turbines to convert wind power into a key energy for the energy transition ⤵️ https://t.co/YWcNZtfwZe", "349": "RT @javiercerrudo: It is one of the news of the summer for @ACCIONAEnergia. Build a new 280MW project in Canada #ACCIONAteam http…", "350": "RT @mariovicente_: Renewable hybridization: when the wind and the sun shake hands https://t.co/rFFLgkUxsB", "351": "RT @vientosdefuturo: Forest fires in Spain are aggravated by the effects of #climatechange🔥. The production of #wind…", "352": "RT @javiercerrudo: Holistic vision of employee well-being #PeopleACCIONA https://t.co/ojlGtkQ9wY", "353": "RT @Renata_RAlves: Trees don't lie: the current period is the warmest in 1,200 years https://t.co/2UCJJXuKj2", "354": "RT @EduardoSanjurjo: New record of solar generation in Spain https://t.co/4QN0d6kzsM", "355": "RT @cr_alvarez: Renewable hybridization: when the wind and the sun shake hands https://t.co/Zyr2nMgH9N", "356": "RT @javiercerrudo: Renewable hybridization: when the wind and the sun join hands https://t.co/0Q2f5aAbFI", "357": "RT @DiegoramiroPini: .@ACCIONA trained 25 school promoters for gender equality in Pachacútec, #Peru\nThe group of students attended…", "358": "Water reuse is essential to fight drought 🏜️, promote a circular economy ♻️ and protect local ecosystems 🤲 \n\nThis is how the #ACCIONAteam investigates reuse solutions ⤵️", "359": "RT @Silviajfra: Chemical recycling: breaking down plastics to reuse them sustainably https://t.co/7VkOYqADxU", "360": "RT @EduardoSanjurjo: It is one of the news of the summer for @ACCIONAEnergia. Build a new 280MW project in Canada #ACCIONAteam ht…", "361": "Our robot dog #Spot already has a home 🐶🏠 \n\nAnd we have built it with 3D concrete printing 🦾 https://t.co/0S5AldwEI8", "362": "This is one of the stories we like to share with you the most. This is how this #salmon elevator 🐟 contributes to reestablishing its historic round trip between the Nansa River (Spain) and the sea 🌅 https://t.co/AzOoP7E8z2", "363": "RT @illatwit: Beautiful architecture! Beautiful engineering!", "364": "RT @ELICO97417164: .@ACCIONA concludes the second version of its Academy Program in Peru.\nA tour of the Pachacútec WWTP was the activity…", "365": "RT @cr_alvarez: .@ACCIONA trained 25 school promoters for gender equality in Pachacútec, #Peru\nThe group of students attended…", "366": "RT @Renata_RAlves: Sustainability and Business presented by @ACCIONA:\n\"Chile requires a strategic digital transformation plan to advance…", "367": "RT @EduardoSanjurjo: .@ACCIONA promotes sport to promote physical health in #Peru\nMore than 200 workers participate…", "368": "RT @Renata_RAlves: .@ACCIONA on @DFinanciero: Green hydrogen industry will require approximately 740 thousand new workers by 2050.\n\nCarolina…", "369": "Chemical recycling opens a way for the sustainable and circular manufacturing of plastics, reducing the environmental impact of this material ♻️\n\nThis is how it works ⤵️ https://t.co/InzkycjDbB", "370": "Energy is present in everything around us and biomass is the best example of this 🗺️ This is how this type of renewable energy works 🌿⚡️ https://t.co/31LSBXhsbt", "371": "RT @Amanda_SandN: .@ACCIONA concludes the second version of its Academy Program in Peru.\nA tour of the Pachacútec WWTP was the activity…", "372": "Our foundation @ACCIONA_ORG brings clean, socially and economically sustainable electricity to the most remote populations of the Peruvian Amazon ⚡️🇵🇪\n\nDiscover the journey of light in this report from Peru 👇 https://t.co/Afjcl9hOgA", "373": "RT @Imnovation: Wind farms and photovoltaic plants in the same space to optimize the use of the electrical grid, reduce the environmental footprint…", "374": "RT @ACCIONA_CL: Have you considered all the advantages of volunteering? 🤔\n\nBefore using the excuse of lack of time ⌚, wait a minute…", "375": "RT @azul_raquel72: Sewing and decarbonizing: they convert CO2 into textile fibers @ACCIONA #Imnovation https://t.co/63RiT5zzBa", "376": "The #ACCIONAteam of Real Estate contributes to transforming cities into spaces of well-being to live in 🏠🏞️ And it makes it possible by paving the way towards zero-emission buildings 🏙️0⃣ Learn how 👇", "377": "RT @ACCIONA_CL: Finding solutions to face the climate emergency that affects the planet 🌎 is everyone's task.\n\nFrom @ACCIONA…", "378": "𝗥𝗲𝘂𝗿𝗯𝗮𝗻𝗶𝘇𝗮𝗰𝗶𝗼́𝗻 🏙️🌳 What is it?\n\nFrom the concrete jungle to sustainable urbanization, cities adapt to the climate crisis before and after suffering its consequences ♨️ https://t.co/5t7PNBmfwj", "379": "RT @DiegoramiroPini: This is how a biomass plant works #ACCIONAteam https://t.co/8YxPnsLYhF", "380": "RT @ACCIONACareers: The history of the relationship between work and family has left us with a double work profile:", "381": "RT @ACCIONAEnergia: A green hydrogen valley on a Caribbean island ♻? We will make it possible through a new agreement with the entities and…", "382": "RT @ACCIONACareers: We talk about the 𝐯𝐞𝐧𝐭𝐚𝐣𝐚𝐬 𝐃𝐄𝐈𝐁 and how promoting #diversity, equity, #inclusion and belonging in the company can…", "383": "We optimize the operating conditions of our #desalination plants, reducing energy and reagent consumption and maximizing #waterperformance, relying on technologies based on big data, machine learning and advanced sensorization ♻🚰\n\nClick here to learn more ⤵", "384": "How is the construction of the largest wind farm in the southern hemisphere progressing? 🇦🇺🌬️\n\nThe latest info + images here ⤵️ [English 🗣️] https://t.co/TOaL7gu8Xh", "385": "Union make force. Diversity, too. This applies to life and, of course, also to engineering 🏗️\n\nWhy composite materials are (already) a very present future in construction ⤵️\nhttps://t.co/PxzUMLUvUA", "386": "RT @jlblasco: .@ACCIONA on @DFinanciero: Urgency in the reuse of treated water.\nWaldo López, Business Development Manager of #Agua de…", "387": "RT @BerthaN63490842: Excelente", "388": "RT @Renata_RAlves: .@ACCIONA in @DFinanciero: Urgency in the reuse of treated water.\nWaldo López, Business Development Manager of #Ag…", "389": "There is good news and then there is this: we completed the construction of the body of the Site C hydroelectric dam, the largest in Canada at 60 meters high and more than a kilometer in length 🇨🇦\n\nhttps://t.co/Ae8ntInv8q", "390": "RT @StartupOle: Roundtable 'Disruptive Corporations'. Moderated by Alberto Sanz (ICEX-Invest in Spain). Óscar Cantalejo (@iberdrol…", "391": "RT @DiegoramiroPini: A great milestone for @ACCIONA! The company completes, together with its partners, the construction of the body of the hydroelectric dam…", "392": "@raulitolindo @ENRnews Here you have it :) https://t.co/TgOEt47FYk", "393": "RT @SWaterSummit: 🥉 @ACCIONA is Bronze Sponsor of #SSWS2023.\n\n✅ A leading company with the capacity to design, build and operate water treatment plants…", "394": "RT @ACCIONA_CL: 🎙️ #MicroPodcast: More than 500 women work on the construction of the new São Paulo metro line, which @ACCIONA is building…", "395": "RT @jlblasco: @ACCIONA on @latercera: With the support of @ACCIONA_ORG Putaendo adapts to the water crisis.\n\n\"This project offers a great…", "396": "RT @ACCIONACareers: “When I arrived at the job I was the only woman among 179 men”\n\n👩‍🔬 Rosa is a biologist by training and, at the same time, a great…", "397": "RT @AlanHenriquez: @ACCIONA on @latercera: With the support of @ACCIONA_ORG Putaendo adapts to the water crisis.\n\n\"This project offers a…", "398": "RT @ACCIONACareers: 70% of global companies say they have a strategy to manage #diversity among their employees. But not…", "399": "RT @ACCIONA_CL: 🚗 A race for the planet! 🌎 On September 16 and 17, the 4th leg of the @ExtremeELive begins. The goal of Extreme…", "400": "RT @ACCIONA_CL: Cities are growing 🌇, and with them their contribution to climate change and the consequences they suffer from it increase…", "402": "RT @EduardoSanjurjo: Solar and wind energy take the lead over fossil fuels in the EU https://t.co/TLtVTGi1Fk", "403": "RT @ACCIONA_MX: As part of our commitment to sustainability, our #ACCIONAteam in Mexico has joined members of the community…", "404": "Thanks to biological batteries, parks and garden areas will generate their own lighting and power IoT devices 🏞️⛲️ \n\nFind out how here ⤵️ https://t.co/cgBQBhFMgW", "405": "@ForrestRoche @CATencabronao What beautiful photos :) Of course the coexistence between wind farms and ecosystems is harmonious - otherwise they would not be sustainable - and part of our work is to continue demonstrating and ensuring it. Thanks for sharing these photographs.", "407": "We fly over the Extremadura I-II-III #photovoltaic plant, in Spain 😍❤️⚡ https://t.co/W4N3OkK2I8", "408": "A dream Saturday keeps our @AccionaSainz team in the lead. We will arrive at the last test of @ExtremeELive, in Chile, with everything to decide. Congratulations @LaiaSanz_, @mattiasekstroem, @CSainz_oficial! 👏👏👏 #DrivenByNature https://t.co/775scFXfoE", "409": "RT @JennyJennygar70: Excellent and Beneficial for the environment", "410": "RT @ACCIONA_CL: Can you imagine what a photovoltaic plant looks like from the air? ☀\n\nIf you still can't imagine it or want to delight in incredible...", "411": "RT @PabloArostegui: Excellent!!! Promote technological change", "412": "RT @ACCIONA_MX: 🌊🌞 Read the innovation of a solar desalination plant that is inspired by nature and the use of organic waste. More info: htt…", "413": "European Mobility Week 2023 encourages us to make more efficient use of means of transport. These are the latest transportation innovations that help us achieve it 🔋⚡️\n\n#MobilityWeek #SEM2023\n\nhttps://t.co/YuHC94GvzW", "414": "RT @EduardoSanjurjo: Photovoltaic irrigation: the new alliance of the countryside with the sun #ACCIONAteam https://t.co/h5AwHbrNX8", "415": "RT @EduardoSanjurjo: Do ​​you want to know the Extremadura I-II-III photovoltaic plant in a different way? Fly over the installation with a…", "416": "Good news! We received the “25 Innovators in Construction Awards”, which recognizes us as one of the most innovative companies in the construction sector in Canada 🇨🇦🏗️🚇\n\nhttps://t.co/qGHlkqdjpH", "417": "RT @MkdirectoEvents: Today you cannot understand culture if it is not through the prism of sustainability ♻️❤️ \n\n@ACCIONA @accionacultura", "418": "RT @ELICO97417164: .@ACCIONA joins the #ForwardFaster2023 initiative, to accelerate the achievement of the #SDGs. The company has purchased…", "419": "RT @elmundoes: There are times when conserving is more than protecting. In the case of buildings, it is giving value, it is respecting our past…", "420": "In the heart of the Colombian mountains 🌄🇨🇴 A water treatment plant that supplies clean water powered only by the energy of the sun 🚰🌞 And a remote town, Seyamake, which can now consume properly treated water and thus preserve its ways of life\n\nDiscover the story here 👀", "421": "RT @ACCIONACareers: “I will never be a senior, there are always more things to learn than to teach” 📢 Elena is Digital Business Development &amp; Smart…", "422": "RT @DiegoramiroPini: .@ACCIONA, recognized as one of the 25 most innovative construction companies in Canada #ACCIONAteam https://t.co…", "424": "RT @Fund_Laboral: @ACCIONA @ferrovial_es Last block of speakers🗨️, listening to testimonies from professionals💼 in the sector.🏗️\n\n🗣️ Ana Onrubi…", "425": "RT @expansioncom: There are times when conservation is more than protection. In the case of buildings, it is about giving value, respecting our heritage…", "426": "RT @Silviajfra: European Mobility Week 2023: moving the world efficiently. #MobilityWeek #SEM2023 https://t.co/1KVzXLeXNh", "427": "RT @ConPassivHaus: Sixth round table of #Edifica23: “Energy-Next Generation: Next Generation Funds, an opportunity for construction…", "428": "RT @ACCIONA_MX: ♻️ Redefining sustainability: explore how chemical recycling 🧪 drives a greener, cleaner future. Join the rev…", "429": "RT @santi_gom: No matter how much it is repeated, it will never be enough. We fall short in the fight against climate change and the countdown if...", "430": "RT @ACCIONACareers: #work as a means to survive, as opposed to the concept of vocation and work as a whole 👀 Which one do you…", "431": "RT @javiercerrudo: .@ACCIONA, recognized as one of the 25 most innovative construction companies in Canada #ACCIONAteam https://t.co/h…", "432": "@Theragnar88 @javiercerrudo Thank you very much for your interest! :) Do not hesitate to consult available vacancies on our website https://t.co/QjivCQcTrV and upload your CV to https://t.co/XphYVak4WQ where you can also set up an alert to receive the offers that best fit your needs. preferences.", "433": "RT @Invertia: #EventoOnlineEE | Follow live the meeting organized by EL ESPAÑOL and Invertia together with @ACCIONA \"EL GOLF. Sport and Social…", "434": "RT @javiercerrudo: .@ACCIONA joins the #ForwardFaster2023 initiative, to accelerate the achievement of the #SDGs. The company has purchased…", "435": "Why think about the Roman Empire if we can think about... 🌉🛣️\n\noh wait! https://t.co/N1NXSn1FT5", "436": "For every obstacle, engineering has a solution \n\nBridges join shores, stimulate opportunities and bring lives closer together. Discover some of our most outstanding projects in bridges and viaducts 👀🌉", "437": "RT @DirigentesDg: 📌 B Lab Spain (@BCorpSpain) and ACCIONA (@ACCIONA) present the second edition of the “Measure what Matters” program to accommodate…", "438": "RT @Renata_RAlves: .@ACCIONA joins the #ForwardFaster2023 initiative, to accelerate the achievement of the #SDGs. The company has purchased…", "439": "Happy to receive the “Award of Excellence”, from the Concrete Institute of Australia, for the #RookwoodWeir project 🇦🇺 An important state recognition that values ​​the design of the dam and the use of concrete for its construction https://t .co/OQKp6VAeq1", "440": "RT @ACCIONA_CL: Even the Pachacútec WWTP Wastewater Treatment Plant, which @ACCIONA is currently building in #Peru, reached…", "441": "RT @ACCIONACareers: A new proposal on employee #wellbeing considers that the dimensions of health should be related…", "442": "We're partnering with @RMIT to drive innovation and develop skills for a sustainable future 👏👏👏\n\nOur President and CEO, José Manuel Entrecanales, and RMIT Vice-Chancellor and President, Alec Cameron, signed a memorandum of understanding for the collaboration https://t.co/DTTliY7CaQ", "443": "RT @IngIndURJC: Now it is the turn of colleagues from @ACCIONA and our director of the UNEFE of the (urjc) who present the efi project to us…", "444": "RT @Amanda_SandN: Drinking water for the Wiwa community in Colombia #ACCIONAteam https://t.co/GiOWORQLAj", "445": "RT @javiercerrudo: The sea as a source of drinking and sustainable water for the islands #ACCIONAteam https://t.co/fMeNYXq7ij", "446": "RT @mariovicente_: Marine islands and archipelagos are surrounded by water that, paradoxically, they cannot use.\n@ACCIONA provides…", "447": "RT @DiegoramiroPini: The sea as a source of drinking and sustainable water for the islands #ACCIONAteam https://t.co/a0CIHU7kkj", "448": "RT @AlanHenriquez: 🥇Gold medal! @SPGlobal awards @ACCIONAEnergia the highest score of the entire Ibex 35 in the ESG Ranking of \n@elEcono…", "449": "Autonomous underwater vehicles will also take advantage of solar energy ☀️ and here we tell you how 👇 https://t.co/aMetn1ibYI", "450": "RT @Silviajfra: The ozone layer recovers: 4 decades to close the hole completely https://t.co/cUz4jTVFGk", "451": "RT @cr_alvarez: @ACCIONA volunteers in Mexico carry out the release of 100 turtles in the sea of ​​Acapulco #ACCIONAteam https://t.…", "452": "This is the journey of one of our #tunnel boring machines from the port of Santander, in Spain, to Poland 🧳 An imposing and challenging logistical exercise that we successfully overcame 💪 \n\nCongratulations to the #ACCIONAteam who made it possible! https://t.co/qU088j9B5J", "453": "RT @accionaopen: Who will be its new owner in 2023? 😏 \n\n#AccionaOpen https://t.co/shqUvSkvIJ", "454": "RT @ter4bithi4: We present to you the 7 Spanish #STEMM who join the expedition promoted by the patron\n@FabianDattner @HomewardBound…", "455": "What are regenerative infrastructures? Find out more on #WorldHabitatDay 🌉🌆 https://t.co/xa8tNRJJXu", "456": "Smart, sustainable and inclusive cities. Allied cities in the face of the climate crisis 🏙️💪\n\nThis is how we work to make them a reality 👇\n\n#WorldHabitatDay #builtenvironment", "457": "RT @Invertia: Sport, an essential part of taking care of the planet: the keys on how to do it\n\nEvent with @elespanolcom and @ACCIONA…", "458": "RT @javiercerrudo: B Lab Spain and @ACCIONA promoted the 2nd edition of the training program to \"raise awareness and accompany\" Spanish SMEs and…", "459": "@fteolindo Thank you very much for your interest! :) Do not hesitate to consult available vacancies on our website https://t.co/QjivCQcTrV and upload your CV to https://t.co/XphYVak4WQ where you can also set up an alert to receive the offers that best fit your needs. preferences.", "460": "#World Animal Day\n\nIn this gallery you will see some of the animals that are best adapting to an environment marked by global warming 🦋🔥\n\nhttps://t.co/CbWAjrInEy", "461": "RT @ACCIONACareers: Learn about the dangers of groupthink that teach us about the risks of conforming to what the majority thinks…", "462": "RT @javiercerrudo: Good news! 🏆\n\n@ACCIONA and its partners have been awarded during the “FIDIC Project Awards 2023” for the project…", "463": "RT @EduardoSanjurjo: Good news! 🏆\n\n@ACCIONA and its partners have been awarded during the “FIDIC Project Awards 2023” for the project…", "464": "RT @elmundoes: Edith Guedella, responsible for construction sustainability at ACCIONA, assures that we must focus on educating the industry…", "465": "RT @DiegoramiroPini: Good news! 🏆\n\n@ACCIONA and its partners have been awarded during the “FIDIC Project Awards 2023” for the project…", "466": "RT @DiegoramiroPini: Good news! @ACCIONA receives the award for the best #Sustainability report from ESG Investing. Congratulations, #ACCIONA!", "467": "RT @Espanha_Brasil: The Brazilian Engineering Ranking by @oempreiteiro places @ACCIONA_BR as the third largest construction company in the country…", "468": "RT @ColegioITOP: @acciona continues with its campaign to disseminate the #CircularEconomy in #Construction. We talk about reuse…", "469": "RT @expansioncom: Edith Guedella, responsible for construction sustainability at ACCIONA, assures that we must focus on educating the industry…", "470": "RT @javiercerrudo: The latest news and most impressive projects from \n@ACCIONA, in the September #newsletter 🗓️ Don't miss anything 📷…", "471": "RT @ACCIONA_CL: In order to support the strengthening of their capacities during the development of activities such as professional internships…", "472": "RT @ACCIONA_CL: The transport of the wind turbine blades to San Juan de Marcona turned out to be a logistical operation that required a…", "473": "RT @cr_alvarez: .@ACCIONA receives a visit from authorities at the Pachacútec WWTP works, with the aim of knowing and verifying on the ground…", "477": "RT @ACCIONA_MX: Can you smell in virtual reality? Discover how technology is stimulating your senses in amazing ways! 🌟👃 Exp…", "478": "RT @DiegoramiroPini: At @ACCIONA, we put people at the center of the strategy 👤\n\nOur commitment to #Diversity and #Inclusion…", "479": "@cynematografyco @alicesilverpol Hello! You have all the info at: https://t.co/yuOIv1HZUK", "481": "RT @vocentoeventos: 🔵Follow LIVE the #ABCDeporteSostenibleForum on Golf and sustainability: good practices, challenges and opportunities.  @…", "482": "RT @RICARDO34873401: Biological batteries: your neighborhood park as a source of energy @ACCIONA #Imnovation https://t.co/Vs8rVJHNfU", "483": "RT @jlblasco: “We must make waste a new raw material.” Edith Guedella, head of construction sustainability at @ACCION…", "484": "Renewable energies are proposed as Europe's greatest ally 🇪🇺 to limit the rise in temperatures on the continent, which doubles the global one 🌡️♨️ https://t.co/pEURDyWDsx", "485": "RT @Renata_RAlves: Good news! 🏆\n\n@ACCIONA and its partners have been awarded during the “FIDIC Project Awards 2023” for the project…", "486": "RT @ACCIONA_MX: Delve into the amazing phenomenon of atmospheric rivers and their relevance in water management, meteorology and climate…", "487": "RT @cr_alvarez: At @ACCIONA, we put people at the center of the strategy 👤\n\nOur commitment to #Diversity and #Inclusion is…", "488": "RT @ProyectoEocene: ♻️EOCENE is a #CircularEconomy project based on the synergies of 6 companies that cover the entire chain…", "489": "RT @AlanHenriquez: At @ACCIONA, we put people at the center of the strategy 👤\n\nOur commitment to #Diversity and #Inclusion…", "490": "RT @accionaopen: Day 1 ✔️ \n\n🔸 Victor García Broto (-5)\n🔹 Jon Rahm (-4)\n🔸 Santiago Tarrío (-3)\n🔹 Alejandro del Rey (-3)\n🔸 Pablo Larrazábal (…", "491": "RT @cr_alvarez: @ACCIONA acquires a 100% electric dumper, in line with its commitment to the #decarbonization of its projects 👀\n\nSupplies…", "492": "RT @AlanHenriquez: .@ACCIONA, preferred bidder for the first large tunnel package of the Suburban Rail Loop East project, in Australia 🙌🚇…", "493": "Natural disasters cause hundreds of fatalities every year, as well as the destruction of homes, infrastructure and million-dollar economic losses 😞\n\nFighting natural disasters is in everyone's hands ⤵️ #DIRRD https://t.co/pJF9qulyo2", "494": "The important sustainability message from @JonRahmpga at the @accionaopen ⛳️👏 #AccionaOpen #golf \n\n🎙@rtve https://t.co/sXfpfwKjbA", "495": "SAVE THE DATE 🗓️\n\nLIVE talk 🔴 from @JaSantaolalla with Paula Silva and Gabriela Sardinha, two of the Latin scientists who will leave for Antarctica on a new @HomewardBound16 expedition \n\n🇲🇽 Tuesday October 17, 4:00 p.m.\n🇪🇸 Wednesday October 18, 00:00h https://t.co/8at5cpZcqZ", "496": "The conjunction of 𝗱𝗲𝘀𝗮𝗹𝗮𝗰𝗶𝗼́𝗻 𝗽𝗼𝗿 𝗼́𝘀𝗺𝗼𝘀𝗶𝘀 𝗶𝗻𝘃𝗲𝗿𝘀𝗮 and energy Renewable energy promises to be the key to the supply of drinking water for the population of islands around the world in the coming decades ☀️🏝️\n\nAnd this is a perfect example 👀 https://t.co/LGu5uOMQ8N", "497": "RT @accionaopen: ♻️ More sustainable ♻️ \n\n@ACCIONA applies a package of measures that make the #AccionaOpen an environmentally friendly tournament…", "498": "RT @JonRahmpga: It is an honor to return to this great event and be able to compete in front of this great audience. It's wonderful to see the support you...", "499": "RT @Renata_RAlves: “We must make waste a new raw material.” Edith Guedella, head of construction sustainability at @A…", "500": "RT @jlblasco: .@ACCIONA, awarded by the Concrete Institute of Australia for its work on the Rookwood Weir dam. Congratulations to #AC…", "501": "RT @Spain_Australia: 🤝 Collaboration agreement between our employers @ACCIONA and @RMIT: the Spanish company will collaborate in the training of…", "502": "RT @jlblasco: Good news! 🏆\n\n@ACCIONA and its partners have been awarded during the “FIDIC Project Awards 2023” for the d…", "503": "RT @jlblasco: Good news! @ACCIONA receives the award for the best #Sustainability report from ESG Investing. Congratulations, #ACCIONAteam!…", "504": "RT @ACCIONACareers: Those who now lament the loss of some jobs forget that these same jobs replaced other jobs with the objective…", "505": "RT @ACCIONACareers: What is the best way to deal with irritability at work? 🤯\nShould we suppress our emotions or address them in a…", "506": "RT @ACCIONACareers: What if achieving better productivity while teleworking means finding the balance between family and work, or…", "507": "RT @EduardoSanjurjo: .@ACCIONA acquires a 100% electric dumper, in line with its commitment to the #decarbonization of its projects 👀\n\nYes…", "508": "A team of researchers creates a low-carbon footprint material with biopolymers that emulates the structures created by marine tube worms\n\n🪱🌊\nhttps://t.co/9Knh38qQf3", "509": "RT @BESTINVER: 🧑‍🎓👩‍🎓 You can now download BESTINVER educatio (📲 https://t.co/hfJePYKZnY), BESTINVER's financial education program…", "510": "RT @Spain_Australia: 🤝 Collaboration agreement between our employers @ACCIONA and @RMIT: the Spanish company will collaborate in the training of…", "511": "For the third consecutive time, we sponsor the @accionaopen, one of the most prestigious golf tournaments, with the aim of promoting a regenerative sport by reducing CO2 emissions, betting on renewable energy and improving the environment 🏌️‍♀️🌱 #BajoParEmissions", "512": "Either sustainable development is for everyone or it is not. \n\nWith this conviction, @ACCIONA_ORG relies on the experience of its cooperation professionals and volunteers to provide affordable, reliable and sustainable energy, water and sanitation services in remote areas 🌎🌍🌏", "513": ".@ACCIONAEnergia joins forces with @Deakin University 🇦🇺 to build @ascend_wsc, a solar car that thousands of engineering students have worked on\n\n🚗☀️\n\nAnd today it begins its journey in #BWSC2023, the main race of its kind in the world 💪 ⤵️ https://t.co/aAax2dLzpt", "514": "📅 This Wednesday, October 25, our Director of Systems and Transformation Projects, Ernesto Díaz Bernardo, will be present at the @CIONET Data Quest 2023, where we will carry out a 360º analysis of several projects and cases 🗣️\n\n🔔 Join the meeting here ⤵", "515": "RT @ACCIONA_ORG: 🌟 The journey of '#LaLuzQuePermanece' begins\n\nA docuseries that narrates the incredible adventure of Ibra Youssef, audiovisual technician…", "516": "RT @Amanda_SandN: .@acciona_org launches the docuseries '#LaLuzQuePermanece' to raise awareness about universal access to energy #ACCIONAtea…", "517": "For us, every day is \"Day against climate change.\" But we have to confess that climate change cannot be avoided... or can it? 🤔\n\n#ClimateChangeDay https://t.co/HGjTPNjmre", "518": "Ending the climate crisis is possible if we begin to see our relationship with the rest of nature as REGENERATIVE 🌱🤝👪 That is to say: leave the world better than how we found it\n\nOn #ClimateChangeDay we tell you how ⤵️ https://t.co/xUP8ENcdMt", "519": "RT @ACCIONA_CL: “The energy industry, in particular, requires more diversity that allows it to broaden its outlook to face the multiple…", "520": "RT @ACCIONA_CL: A team of researchers creates a low-carbon footprint material with biopolymers that emulates the structures created by…", "521": "RT @Obrasurbanas: Award for the company that best meets ESG criteria.\n@ACCIONA \nhttps://t.co/usowpIZr87", "522": "The EU imports 90% of its phosphorus, an essential resource for our food security, as a key component in fertilizers. Therefore, we work on this project to promote its recovery 💧✅\n\nAll the details 👇", "523": "RT @LolaOrtizSanch2: 👇#HappyMonday I share with you today this magnificent recovery of a converted #OMBU industrial building thanks to @NormanF…", "524": "@LolaOrtizSanch2 @NormanFosterFdn One of the jobs we are happiest about. We encourage you to read an in-depth report on the work here: https://t.co/yuOIv1HZUK", "525": "RT @JBALogan: GOOD NEWS.....", "526": "We face the future as pioneers of a new sector that creates a positive impact on people and the planet 👩‍👩‍👧‍👦🌎 For example, some numbers 🔢👀\n\nDiscover more at #ACCIONAInforme22 https://t.co/oQOjPOw2Eb", "527": "RT @ACCIONACareers: At @ACCIONA we are part of the ecological revolution. Our #paperless initiative means less printing of documents…", "528": "📅 Tomorrow, at 9:30am, André De Angelo, Country Director at @ACCIONA_BR, participates in the ABDIB Forum moderating a panel on the economic potential and legal security for attracting investments in the Southern and Southeastern States of Brazil 🇧🇷🗣️\n\n🔗 All the details 👇", "529": "RT @SURescuela: Of still lifes and angles. \n\n_____________________\n\nDrawing workshop with Jacobo Pérez Enciso\n#SUR Master of Arts and Professions.", "530": "RT @chiquitectos: \"With this generation of chiquitectos things are going to change and what we are doing is going to help us have a #city…", "531": "RT @VolCorporativo: #CorporateVolunteering generates social impact 🩷 Learn about a successful example through the latest collaboration between…", "532": "Our latest news and most impactful projects, in the October #newsletter🗓️ \n\nDon't miss anything 📷⬇ https://t.co/xB2fkgbQb1 https://t.co/eW8uiYqncI", "533": "RT @ACCIONACareers: We explore how the world of work is evolving and why the office can no longer go back to what it was 🎯 Flexi…", "534": "RT @ACCIONA_ORG: 🎙️ PODCAST ‘#LaLuzQuePermanece' | Have you ever wondered what the light sounds like where there was only night? 💫 \n\nInside…", "535": "RT @cr_alvarez: .@acciona_org launches the docuseries '#LaLuzQuePermanece' to raise awareness about universal access to energy #ACCIONAteam…", "536": "RT @_infoLibre: How to move around in the cities of the future?: urban sustainability under debate in #ForosinfoLibre\n\nJuan José Conde participates…", "537": "RT @cr_alvarez: The twin tunnel boring machines of the Broadway subway project (Canada) arrive at the fourth station. Congratulations, #ACCIONAteam:…", "538": "RT @ACCIONA_CL: \"We must abandon the polluting energy model and expensive prices not only because it is economical and competitive, but also…", "539": "RT @_infoLibre: How to move in the cities of the future?: urban sustainability under debate in #ForosinfoLibre\n\nJuan José Conde participates…", "540": "RT @_infoLibre: Juan José Conde @ACCIONA: \"It is a conjugation of elements: shared mobility vehicles, service networks will grow…", "541": "RT @_infoLibre: Juan José Conde @ACCIONA: \"We must give the citizen what they are asking for\" and he talks for example about public transport…", "542": "RT @_infoLibre: Juan José Conde @ACCIONA defends that three elements must be mobilized in the right direction: \"Vehicle technology…", "543": "Various floating garden projects capable of desalinating seawater and operating with solar energy propose an alternative to agriculture on land 🥬🥦\n\nDon't miss how ⤵️\nhttps://t.co/BuFWbFrsGI", "544": "RT @ACCIONACareers: Did you know that prioritizing professional priorities catapults your #performance? 👌🧐\n\nHow do you organize your daily tasks…", "545": "RT @GeneracionCode: 90 Women in STEM careers travel to Antarctica Thanks to @homewardboundprojects and @ACCIONA!\n#computing #codeorg #…", "546": "RT @javiercerrudo: The twin tunnel boring machines of the Broadway subway project (Canada) arrive at the fourth station. Congratulations, #ACCIONAtea…", "547": "RT @cr_alvarez: The first episode of the docuseries #LaLuzQuePermanece, by @acciona_org, is now on YouTube. Amazing work! #ACCIONAtea…", "548": "We talk about 𝗾𝘂𝗲́ 𝗲𝘀 𝗹𝗮 𝗲𝗰𝗼𝗮𝗻𝘀𝗶𝗲𝗱𝗮𝗱 and how it can become an obstacle or, also, an incentive to fight against climate change 🌡️🌏💪 https:// t.co/z5rgyOLdzT", "549": "RT @ProyectoEocene: What is the #ProyectoEocene? 🧐 \n\nIn our informative flyer we tell you in a practical way what it is, how to apply it…", "550": "RT @ACCIONA_CL: Ian Ovalle, Diversity and Inclusion Analyst at @ACCIONA, spoke about his work at the company during the conversation…", "551": "RT @ACCIONACareers: Measure, improve and re-evaluate. That is the path to success 🚀 That is why it is important to know how #culturaorga is measured…", "552": "RT @CaminosUPV: 🔵🔚 On September 12, @ACCIONA and its partners in the CCLEX consortium were awarded at the “FIDIC Project Awards 2…", "553": ".@HomewardBound16 is creating an international network of 10,000 women from STEMM disciplines to collaborate on projects in scientific fields, giving visibility to women in science so that they are leaders with decision-making capacity in solving global challenges 🌏 https://t .co/2Gxq2tJre7", "554": "RT @ACCIONA_CL: There are two types of leaders, those who sacrifice or those who sacrifice themselves. The second, the managers who understand sacrifice…", "555": ".@ACCIONAEnergia is focused on the greatest photovoltaic challenge developed in its 30 years of life in the renewable sector: building 🇺🇸 solar plants with a combined power equivalent to a nuclear power plant, with more than two million panels 👇https://t .co/HPfeti7ABI", "556": "Two islands connected by a huge bridge 🌉\n\nBut not just any one: 2.5 km long with a 650 m cable-stayed main structure. We are talking about the Cebu cable-stayed bridge, one of our largest engineering works in Southeast Asia 👇\n\nhttps://t.co/CQywj6hV2g https://t.co/Yfv7RU8rfQ", "557": "Episode 2 of the docuseries '#LaLuzQuePermanece' is now available on the social channels of @acciona_org. Don't miss the mysteries of the Amazon jungle and the commitment of the Copal Urco community to renewable energies 👇 https://t.co/Fmpu2s8bxi", "558": "𝐀𝐥𝐞𝐣𝐚𝐧𝐝𝐫𝐨 𝐁𝐞𝐢𝐯𝐢𝐝𝐞, Director of Digital Infrastructure Transformation, will be present tomorrow, Wednesday, November 15, at 9:00 am, in Cantabria 🇪🇸 giving a presentation on Industrial Connectivity 📅📢 Don't miss it!\n\nAll the details here ⤵", "559": "City bees collect much more than pollen\n\n🐝🐝🐝\n\nThese pollinators trap samples of bacteria and microbes that allow us to know the state of health of the environment 🏙️⚕️ Find out how they do it 👇 https://t.co/DoBjqNi6Dk", "560": "@CarlosaUruetav Here are some of them https://t.co/UyTN84UKiP and https://t.co/XKJe3SPKDQ Greetings!", "562": "📅 Tomorrow, Manuel Navarro, Director of Water for Agriculture, participates in the @Tecniberia Conference, sharing his experience in Session II, Water Table ''𝐀𝐠𝐫𝐢𝐜𝐮𝐥𝐭𝐮𝐫𝐚, 𝐫𝐠𝐢́𝐚'', along with other professionals in the sector 🗣️\n\n💦 More information here:", "563": "We have built more than 5,000 km of highways, highways and roads in recent years around the world: Australia, Spain, Canada, Denmark....🌏🛣️ A world map of increasingly innovative and sustainable smart roads 👉 https:// t.co/lYFJ8wo0PV https://t.co/UEd6g7JNsh", "564": "Good news for the wind sector! The project combines our experience in the use of composite materials, @ACCIONAEnergia's access to disused wind turbine blades and @renercycle's activities in the dismantling of wind turbines\nhttps://t.co/1xNBfSZ1Nv", "565": "The @ACCIONA_ORG foundation extends its renewable and affordable supply service and already benefits more than 1,600 people in the province of Coquimbo \n\n🇨🇱🇨🇱🇨🇱\n\nhttps://t.co/TWAljGdc5u", "566": "Ultrasound to the rescue 🦹‍♀️🦸‍♂️\n\nAccording to the latest research, chemical residues that accumulate in groundwater and wastewater 💦 could be cleaned using ultrasound 👇 https://t.co/LS8FLUW6Dw", "567": "This system will calculate the water footprint in the @COE_es facilities, promote the reduction of water consumption and replicate the model in other sports organizations 👇💦\n\nhttps://t.co/IbtKG9tb5I", "568": "The main challenge is to develop correct water management based on climate adaptation and mitigation. We take on the challenge of extending a positive water footprint through the design of regenerative water infrastructure\nhttps://t.co/IbtKG9tIVg", "569": "What is reverse osmosis desalination? 💦 \n\nIt is the most widespread and advanced desalination system in the world 🌏 Its implementation represents more than 60% compared to the rest of the methods 👇 https://t.co/lKRjLHUL4U", "570": ".@ACCIONAEnergia is simultaneously constructing four photovoltaic projects in 🇺🇸 that add up to 1.3 GWp of peak power. The new facilities will generate clean energy equivalent to the consumption of more than 210,000 American homes 🏡 https://t.co/I0f7Jm69CB", "571": ".@ACCIONA_ORG, together with @AECID_es and @ayalafoundation, deploys access to clean electricity from home photovoltaic systems to areas of the province of Palawan (Philippines) without connection to the conventional electrical grid 💡🇵🇭", "572": "⚡️Renewable energies ⚡️\n\nWhy are they key to combating 𝗰𝗿𝗶𝘀𝗶𝘀 𝗰𝗹𝗶𝗺𝗮́𝘁𝗶𝗰𝗮 🌡️ and what are their benefits 👇", "573": "@Robertolui8995 Thank you very much and also!", "574": "📅 This Friday, November 24, our colleague Miguel Ángel París, from the Construction Technology Center, participates in the CONSTRUYES congress, debating the future of construction, with a focus on hydrogen and electrification ✅\n\nAll the info ⬇", "575": "Good news! We have begun excavations for the #construction of the second phase of the Western Harbor Tunnel in Australia 🚇🇦🇺\n\nAll the details 👇", "576": "Have you ever thought of the city as nature? 🌆🌳 \n\nA new perspective for the urban future through biourbanism ⤵️ https://t.co/uBHBMneIjn", "577": "4 decades developing desalination projects that bring a key asset for life to more than 30 million. of people, most of them residents on islands around the 🌎 and in areas threatened by water stress 🏝️ \n\nThis is how we do it ⤵️ https://t.co/6fYCQ9qYtV https://t.co/mPhxG3oelz", "578": "The rehabilitation project of the emblematic Canfranc Station (Huesca) 🇪🇸 has been awarded three important recognitions 🚉🏅\n\nKnow the details ⤵", "579": "We incorporated a new #energystorage system for energy in the construction of the Alentejo hospital in Portugal 🏗🏥🇵🇹\n\nKnow the details 👇", "580": "The coexistence of renewable energy ⚡️with agricultural practices 🧑‍🌾🚜 has led to the birth of the 𝗲𝗻𝗲𝗿𝗴𝗶́𝗮 𝗮, which promises to revolutionize sustainable crops of the 21st century ⤵️ https://t.co/uUljA6INhw", "581": "The @AccionaSainz of our pilots @LaiaSanz_ &amp; @mattiasekstroem concludes a new season of @ExtremeELive E in one week, this time in the #CooperXPrix test in Antofagasta 🇨🇱 with the possibility of becoming champion for the first time 🏆\n\n #DrivenByNature https://t.co/RiezO8wOzT", "582": ".@ACCIONAEnergia deploys two #BladeLifters to transport blades to the MacIntyre wind farm. These vehicles are the first of their type used in Australia and will increase the pace of on-site shovel delivery and reduce the environmental footprint of the project 🌬️☀️ https://t.co/kYxJCMNEqN", "583": "Flying over an impressive pumping station in Spain 💦🇪🇸 https://t.co/Xwq9oitrMy", "584": "🔴🗣️ Aina Soler, Project Manager, participates this Wednesday at 10:05 a.m. in the Young Water Hack, organized by the IWA, speaking in the presentation “From waste to resource: the paradigm shift in wastewater treatment” 💦\n\n🔗 All the details here:", "585": "News that we love to share: @ACCIONAEnergia revalidates its status as the greenest electricity company in the world for the ninth consecutive year according to the \"Top 100 Green Utilities\" ranking prepared by @energyintel, an independent consultancy specialized in energy markets 🥳🎈", "586": "A new generation of garments arrives that contract depending on the temperature and insulate better from the cold, among other functions 🤯\n\nSmart fabrics 👕🧠 https://t.co/9DFYxDHsmf", "587": "Our Foundation @ACCIONA_ORG premieres a new episode of the documentary series '#LaLuzQuePermanece' on YouTube. Do not miss it! https://t.co/Yk1GAeGoob", "588": "📢 Coinciding with our 25th anniversary in Portugal, we attended the ENEG 2023 meeting, organized by the APDA, where we had a stand to present our solutions and establish a meeting area with professionals in the sector\n\nFind out the details ⤵", "589": "We boost the #renewable supply of Mostostal Warszawan, our subsidiary in Poland 🇵🇱, with our #decarbonization fund ✅\n\nAll the info 👇", "590": "🗣️ Paula Pérez, Digital Transformation Manager, will give a presentation tomorrow on “Water Positive: Water-Energy Nexus through desalination and reuse” 💦\n\n📅 3:45 p.m.\n📍 CETA – CEDEX (Madrid)\n\nMore info 👇", "591": "We introduce bioclimatic and bioconstruction technologies in the new complex of the Xunta de Galicia (Spain) 🇪🇸\n\nThese systems represent an important #innovation in terms of #construction and #engineering thanks to the use of natural resources 🚧✅", "592": "The Pajares variant of the Madrid-Asturias High Speed ​​Line has been inaugurated 🇪🇸🚇\n\nThe waterproofing of the tunnels using a coating system based on composite materials has received international awards 🙌\n\nDiscover the news ⤵", "593": "The #COP28UAE begins, the climate summit to fulfill the Paris Agreement 🌡️To mitigate climate change, coal, oil and gas production must decrease rapidly, and global renewable energy production must triple by 2030 📈 https:// t.co/jIidN198Xl", "595": "Wind turbines take up space for agriculture and livestock --&gt; ✖️ FALSE ✖️\nThe surface area occupied by a wind turbine is minimal. In fact, wind farms are perfectly compatible with agricultural and livestock activities that take place in that same space 🌬️🐏", "597": "One of the main keys when working with tunnel boring machines is choosing and adapting the right machine for each terrain. To face these challenges, we have several types of tunnel boring machines: open Main Beam type, single shield, double shield, etc. 🚇⤵️ https://t.co/ayhyTVjhYB", "598": "“Civil society should not wait for regulation, but lead the transition”\n\nOur president and CEO, José Manuel Entrecanales, participates in # COP28UAE, where he sends a clear message to increase climate action 💪🌎\n\n#ACCIONACOP28 https://t.co/WpUt0wRoQU", "599": "On the 30th, we received the Spain-Italy Chamber of Commerce Award in its seventeenth edition🏆\n\nThis award is awarded annually by the Spanish Chamber of Commerce in Italy to companies that stand out for their innovation and sustainable management of water infrastructure💧", "600": "The largest female expedition to Antarctica, organized by @HomewardBound16 and ACCIONA, has just concluded after a journey in which 188 women have contemplated the effects of climate change.\n\nAnd what better way to end it than with this message from Jane Goodall 👇 https://t.co/dDwjowD5mp", "601": "We had it in our hands, but it couldn't be. We are proud of the work of all the members of @AccionaSainz ❤️\n\nThank you for this year @LaiaSanz_, @mattiasekstroem, @CSainz_oficial #DrivenByNature\n\n➕info: https://t.co/sZHrkMeEli https://t.co/wdfpXTFVDO", "602": "Great news! Ecuador inaugurates Line 1 of the Quito Metro 🇪🇨\n\nThe inauguration and entry into operation of the line constitutes the first element of a new public transport system in the city 🚇\n\nAll the info ⤵", "603": "Good news from Australia! 🇦🇺⤵️\n\nThe project will increase renewable energy that can be delivered through the national electricity grid, helping Australia transition to a low emissions future 👏⚡️\n\nhttps://t.co/MWcOZ5s5GR", "605": "A plant capable of generating 1.5 MW of renewable energy could be one of the first demonstrations of the potential of thermal gradient energy ⚡️🌊\n\n👇Ocean thermal energy 👇\nhttps://t.co/LqTNMJ2wai", "606": "EPISODE 1 #ACCIONACOP28 | We start our coverage of the @COP28_UAE with @tv_Amaro ⤵️\n\nA world of contrasts, but a path towards regeneration 🌎 Discover the perfect example 📺👇\n\nhttps://t.co/VtmRVU6WoR", "607": "📢 Discover all the #news that our company has experienced during the month of November 2023 📺 #ACCIONAin1min", "608": "What just a few years ago seemed like a utopia is today a reality. We are already printing 𝐦𝐨𝐛𝐢𝐥𝐢𝐚𝐫𝐢𝐨 𝐮𝐫𝐛𝐚𝐧𝐨 𝐞𝐧 𝟑𝐃 for the homes we build and exploring a near future where buildings are 100% net zero 🏗️ 🏙️ We tell you about this progress 👇", "609": "The energy transition is already saving more than 200,000 lives a year thanks to the reduction in the use of coal and air pollutants 🌫️👏\n\nA study confirms this 👇 #COP28UAE \nhttps://t.co/3N6jqNenNz", "610": "EPISODE 2 #ACCIONACOP28 | In episode 2 of our trip to @COP28_UAE, we move among sands that, little by little, are swallowing the roads that surround Dubai 🇦🇪🐫 \n\nA global alarm signal ♨️\n\n#COP28 | @tv_Amaro https://t.co/wq9Mrhvmi6", "611": "@COP28_UAE @tv_Amaro EPISODE 2 #ACCIONACOP28 | Every year around 12 million hectares are lost to desertification, 2,000 soccer fields per hour. A consequence of climate change and unsustainable use of soils ♨️🥴\n\n#COP28 | @tv_Amaro https://t.co/wq9Mrhvmi6", "612": "@COP28_UAE @tv_Amaro EPISODE 2 #ACCIONACOP28 | However, there are measures and technologies to combat this problem. We visited the largest vertical garden on the planet, also located in the UAE, which promotes a regenerative agriculture model\n🥬🥬👩‍🔬🧑‍🔬\n\n#COP28 | @tv_Amaro https://t.co/wq9Mrhvmi6", "613": "Green hydrogen: why it is on the right track to be the fuel of the future 🟢 👇 https://t.co/jWU2zZ8QMh", "614": "Water or nacelle? 💧⚡️ Can you guess which surface these views are reflected on? 👀\n\n(Video recorded by Iñaki Antoñana, O&M technician of the #ACCIONAteam. Thanks, Iñaki!)\n\n#ClimateGramers https://t.co/52gjkDuRSE", "615": "@pablovinueza2 Thank you very much for your message! #ACCIONAteam", "616": "@elmanyana Hello Eloy! We want to contact you by DM to present you with an initiative that we think might be of interest to you, but it doesn't allow us to send you a message by not following us back. Are you interested? We look forward. Thank you so much!", "617": "@PedroFresco Hello Pedro! We want to contact you by DM to present you with an initiative that we think might be of interest to you, but it doesn't allow us to send you a message by not following us back. Are you interested? We look forward. Thank you so much!", "618": "We're proud to support the @HomewardBound16 program and the incredible scientists within it who are redefining the narrative of global leadership 👩‍🔬👷‍♀️This year's trip to Antarctica is over, but as @FabianDattner says: \"This is just the end of the beginning\" https://t.co/Bdk1Xb8B7M", "619": "We are approaching the end of the journey of '#LaLuzQuePermanece' jumping from the jungle to the Andean mountains. Don't miss episode 4 here \n\n📺👇 https://t.co/TdWvdNHdH2", "620": "Great news! The Victorian Government has selected us to carry out the first batch of tunnels for the Suburban Rail Loop East project, in Melbourne 🇦🇺 within the Suburban Connect consortium, together with CPB Contractors and @GhellaSpa 🚇\nhttps://t.co/d4LUwxOCzI", "621": "📅 This Thursday, our colleague Ana Garcia, Responsible for the Sustainability Report of the Water area, participates in the sustainability sessions of @CatalanWaterP “Reporting sustainability to the Water sector” 💧🗣️\n\nFind out the details and sign up ⤵", "622": "Have you ever wondered what makes everything spin steadily and precisely? 🔄\n\nDiscover the wonderful force that drives the world and our essential role in The Planet Cycle 🌎✨\n\nHappy Holidays! #ThePlanetCycle", "623": "Recently, Ecuador inaugurated Line 1 of the @MetrodeQuito. A milestone in the country's sustainable mobility and in the transition towards a net-zero city model to which we are proud to have contributed. Discover the project here 🚇👇\n\nhttps://t.co/GPcWxZU5Vt", "624": "After two weeks of intense negotiations, #COP28 ends with a milestone: the express mention of leaving fossil fuels behind 🏭👋\n\n#COP28UAE @COP28_UAE \n\nhttps://t.co/zV7gfaDAzS", "625": "Another point that remains is the need to continue promoting renewable energies. A decision that is based on the report published in October by the International Energy Agency (@IEA)\n\n#COP28UAE @COP28_UAE\n\nhttps://t.co/zV7gfaDAzS", "626": "@IEA @COP28_UAE In six years, renewables should account for 77% of the total installed capacity, and 68% of that generated ⚡️📈\n\n#COP28UAE #COP28 @COP28_UAE\nhttps://t.co/zV7gfaDAzS", "627": "Despite being only 6% of the population, they take care of 80% of the world's biodiversity ⛰️🫏🌴\n\nWe talk about the wisdom of indigenous peoples 👇https://t.co/txzhKhIbFU", "628": "@quetzalenergia @elgansospain Thank you very much! https://t.co/mC6lAPqShV", "629": "We began the expansion works of the Granada Metro (Spain), which represents an extension of 2.7 kilometers and the construction of four new stations 🚇🏗\n\nMore info 👇", "630": "We are very proud of all the people from the #ACCIONAteam of @ACCIONAEnergia who have made it possible ❤️\n\nThe Aldoga PV (380 MW), in Australia, will create up to 350 jobs during its construction and will generate clean electricity to supply almost 185,000 homes 🏠 https://t.co/jik163dFnL", "631": "Have you ever wondered what makes everything spin steadily and precisely? 🔄\n\nDiscover the wonderful force that drives the world and our essential role in The Planet Cycle 🌎✨\n\nHappy Holidays! #ThePlanetCycle", "632": "They are the first shoes in the world made with recycled wind blades ♻️👟\n\nWe teamed up with @elgansospain to launch a line of sneakers whose manufacturing used a 23-meter-long blade from the Aibar wind farm in Navarra 🌬️ https://t.co/n2hQND3JQr", "633": "Have you ever wondered what makes everything spin steadily and precisely? 🔄\n\nDiscover the wonderful force that drives the world and our essential role in The Planet Cycle 🌎✨\n\nHappy Holidays! #ThePlanetCycle", "634": "The project will remove 19,000 vehicles a day from the Greensborough road and will include the planting of 4,000 trees 🇦🇺🛣️🌳🌳🌳\n\nhttps://t.co/dSNnuD0VlW", "635": "@COP28_UAE @tv_Amaro EPISODE 3 #ACCIONACOP28 | We conclude our trip to Dubai with the main conclusions of the #COP28UAE and interviews with our president José Manuel Entrecanales, @PEspinosaC and @marcelomena 🌎🫶\n\n#COP28 | @tv_Amaro https://t.co/M9EW4TiS4l", "636": "Now that we end the year and the holidays are approaching, this evocative metaphor with hand-drawn illustrations invites us to reflect on our coexistence with life and the Earth 🌎✨ #ElCiclodelPlaneta\n \nShare so the cycle continues: https://t.co/fHAKM2RjJ2 https://t.co/WZWc3lBqkJ", "637": "𝐄𝐱𝐨𝐞𝐬𝐪𝐮𝐞𝐥𝐞𝐭𝐨 🦿\n\nPeople with hemiplegia who walk again or construction workers who lift 90 kilos effortlessly are some applications of this technology ⤵️ https://t.co/6C8reaz4kE", "638": "Good news! @AimRoads, our subsidiary in Canada dedicated to infrastructure maintenance, has been awarded for safety and health in infrastructure maintenance 👷🏆\n\nMore details ⤵", "639": "We are very happy to tell you that we are going to develop one of the largest renewable energy networks in Australia 🇦🇺 The new infrastructure will mobilize an investment of €6.2 billion and will generate 5,000 jobs during its construction 😍👇\n\nhttps://t.co/A2pqQAhbkg", "640": "The dam, whose construction was completed in September, is 60 meters high and more than a kilometer long at the crest 🇨🇦\n\nhttps://t.co/KXEIJ29daT", "641": "Innovation and renewable energies ⚡️could be key to tackling Madagascar's emergency food state 🇲🇬 Find out how ⤵️\nhttps://t.co/37lhkj681R", "642": "A century after its construction, the Seira Hydroelectric Power Plant, in Spain 🇪🇸, continues to produce clean energy, while the beauty of its architecture and the machinery it houses inside are a true joy for the senses 👇 https:// t.co/S5WfkPI64M", "643": "There is a different way of doing business that seeks to lead climate action to make a healthier, safer and more prosperous planet possible for everyone🌎🫶 \n\nOur #ACCIONAteam works this way to achieve it 😍👇", "644": "@revenergetica Thanks Xavier! We hope you like them ⚡❤️ @ACCIONAEnergia", "645": "@Sergio_FerMun @elgansospain Thank you Sergio! ⚡❤️", "646": "This year we celebrate the holidays with #ElCiclodelPlaneta, a piece with which we share the desire that unites all the people who make up ACCIONA: to continue working day after day for a more prosperous future for our planet 🌎 \n\nShare the congratulations here 👇", "647": "▶ Discover all the news that our company has experienced during the month of December 2023 👀 | #ACCIONAin1min", "648": "The 𝗿𝗲𝗴𝗲𝗻𝗲𝗿𝗮𝗰𝗶𝗼́𝗻 is a commitment to the reconciliation of humans with nature and the restoration of its balance 🌳👨‍👩‍👧‍👧\n\nOne step beyond the sustainability that we tell you in detail here 👇", "649": "We end the year with a piece to congratulate the holidays and to share the wish that unites all the people who make up ACCIONA: to continue working day after day for a more prosperous future for our planet 🌏✨🤝\n\nShare the congratulations 👇 #ElCicloDelPlaneta", "782": "@cecile_texier We tend to agree Cécile :)", "790": "We're happy to provide ČD-Telematika with ETCS Level 2 in the Czech Republic and Slovakia \n\n▶️Learn more: https://t.co/jeNvzYeE7b\n\n#signalling #ETCS https://t.co/RMXyrZIhUA", "848": "@BB27000 🚂always, BB! 😉", "1032": "@tgvdu45 @SNCFNumerique Wohoo! See you soon Theo! No need to test our simulator I think? 😁", "1034": "You are toujours welcome dear Théo! \n#TeamAlstom #VivaTech https://t.co/LEBpIsqP3Z", "1835": "Ramadan Mubarak from BT Group #Ramadan https://t.co/Z0Nc1zGPRK", "2177": "Game on, 2023! We are pleased to announce that Danfoss extends global sponsorship for Danish sports club #SønderjyskE. SønderjyskE has brought home victories for South Jutland with @SEishockey @SEherrehbold and SønderjyskE Damehåndbold. Read more: https://t.co/RWSkiipNP5 https://t.co/DGJvY0CMrw", "2325": "“We are proud to be able to count on a group like Danone and its teams who choose France and innovation. You are synonymous with excellence and employment.”  — Élisabeth Borne, French Prime Minister", "2326": "“If I am here today it is because the projects you are carrying out contribute to building the France of tomorrow. So we will continue to support you. You represent the future of our food.”  — Élisabeth Borne, French Prime Minister", "2327": "\"The Saclay center is the future of health through food. I am happy that you have chosen to set up here, this center shows the excellence and rigor of French research. We have confidence in you.\" – Élisabeth Borne, French Prime Minister", "2345": "@remitouja Hello Rémi, and yet this change of colors is important. Colored bottles are more difficult to recycle, going through specialized recycling channels and being necessarily intended for uses other than food. (1/2)", "2346": "@remitouja With these new transparent plastic models they can be recycled for food use, therefore allowing better \"recyclability\". (2/2)", "2352": "SURPRISE INTERVIEW 📚\n\nClarisse Agbégnénou (@Gnougnou25) and @SoldeTyphaine, our @Danone champions found themselves “On the board!!!”\nIn front of the children, the athletes answered all their questions without taboo!\n\n#ChampionsATousLesAges\n@autableoff", "2354": "A look back at a special day... This April 6, on the occasion of Olympic and Paralympic Week (SOP), our Danone Champions brightened up the morning of the children of a school in @villedesuresnes. \n@Paris2024 #SOP2023 #ChampionsATousLesAges https://t.co/nsbJ0TC4Aj", "2355": "Olympic and Paralympic Week has been part of the @education_gouv ministry's program since 2017. The opportunity to discuss access and inclusion in sport, major health issues. As an official partner of @Paris2024, Danone supports this initiative https://t.co/wBtppvN6hv", "2356": "Olympic and Paralympic Week is also a great opportunity to promote “moving well and eating well”, from a very young age and at all stages of life! #ChampionsAtouslesAges #SOP2023 @Paris2024 https://t.co/ygl6Tp4WAo", "2357": "The opportunity for Danone champions to return to school, to meet the champions of tomorrow! @sofyanemehiaoui @JKR_17 @SoldeTyphaine @ZhoyaSasha @SMartinetJudo @Paris2024 #SOP2023 #ChampionsAtouslesAges https://t.co/Tp3bD64fPm", "2371": "“Have anyone ever told you that you suck?”\nClarisse Agbégnénou be like: becoming world champion for the sixth consecutive time.\nWe have the answer to the question 😉\nBRAVO @Gnougnou25🏆 Danone is so proud to support you!\n#ChampionsATousLesAges https://t.co/Xijd5UOZHx", "2372": "Weak point: too strong.\n@Gnougnou25 six times world champion.\n🥇🥇🥇🥇🥇🥇\nWe still can't get over it 🤩\n#ChampionsATousLesAges https://t.co/i7jF3NuULC", "2381": "#OlympicDay #LetsMove!    \nWho better than our champions @JKR_17 and Melvyn Richardson, members of the #DanoneChampions Team to make everyone want to move🤸\nSo let's move as often as possible with colleagues, family or friends!  #ChampionsDanone https://t.co/lgsZincahw", "2389": "The @Paris2024 Olympic Games are in exactly 1 year! On this occasion, discover our team of #DanoneChampions ⤵️ \nLet's start with @Gnougnou25 🥋\nD-3626: First world title\nD-365: Ready to be on top of the world!\nhttps://t.co/nlTizzlA1a", "2390": "We continue with @SoldeTyphaine \nJ-1387: First national selection \nJ-399: A crucial objective\nhttps://t.co/ZkSm9bFfLB", "2391": "It’s @JKR_17’s turn🤾‍♂️\nJ-4006: In full preparation\nJ-365: Ready to give voice\nhttps://t.co/x3CranXCuY", "2392": "Without forgetting @FERRANDPREVOT 🚴‍♀️\nJ-3960: Team time trial champion \nJ-365: A golden opportunity in mountain biking\nhttps://t.co/j6lqztxk3m", "2393": "And of course @ZhoyaSasha🏃‍♂️\nJ-922: The beginning of the story on the web \nD-365: Ready to reach for the stars\nhttps://t.co/cYOe83RAq4", "2394": "Here is now @sofyanemehiaoui 🏀\nJ-4101: Heading to a European final \nJ-399: Destination the ultimate competition\nhttps://t.co/yNsXl3fXml", "2395": "After Richardson Sr., we ask for the son!\nD-3263: The succession is assured\nD-365: The medal is hoped for\nhttps://t.co/M5bi27XoI1", "2396": "And finally, Sandrine Martinet-Aurières 🥋\nD-1065: It was not the end in Tokyo \nD-399: We continue until Paris 2024\nhttps://t.co/dSIR4HNkvy", "2397": "D-365 before @Paris2024🤸‍♂️ \nThe #ChampionsDanone team takes to the track ✨ For the occasion, from 1500 likes on this tweet we will give you 12 prizes of 2 places to attend the competitions. To participate: like this tweet and subscribe to the @Danone account. Good luck 🍀 https://t.co/kQ8SHpiWBA", "2398": "We will be there in 365 days to cheer on Clarisse in the stands of the Paris 2024 Olympic Games! You too, support the athletes of the #ChampionsDanone collective \n#1YearToGo https://t.co/ILtchnvu1h", "2401": "14th world title for our champion Pauline @FERRANDPREVOT 🚵‍♀️\nYes you read correctly: 14TH WORLD TITLE🤩\nBravo Pauline, we are so proud to accompany you! \n\n#ChampionsATousLesAges https://t.co/uBeOkjXWEy", "2402": "She's just too strong... \n\nBravo Pauline @FERRANDPREVOT for this new demonstration and this 15th global title! 🇫🇷🚵🏻‍♀️ #Championatouslesages https://t.co/ewSgtDczZE", "2409": "Sport, champions, meetings, emotion on the program for Paralympic Day @Paris2024. A taste of the “return match” in Paris in 2024! Thank you to the visitors and our #TeamChampionsDanone @sofyanemehiaoui, Sandrine Martinet, @SoldeTyphaine, @ZhoyaSasha 🙌", "2410": "We vibrated with you during Para' Day🤸\nRelive the highlights before the return match in a few months! \n@paris2024\n#ChampionsATousLesAges https://t.co/qRuyAoZJPm", "2423": "Alongside @CarrefourFrance and @Paris2024, we support healthy eating and physical activity for all! With the “Sports Clubs Program”, 100,000 products will be offered for snacks to licensees of 5 amateur clubs 💪\n#ChampionsAtousLesAges #Paris2024 https://t.co/MayPHpUXmx", "2428": "170 years after it was named, Deutsche Post has discontinued the Telegram on December 31, 2022. On the last two working days of the year, more than 3,000 customers used the Telegram again.\nhttps://t.co/OUybIcAa3Q https://t.co/Q23qaybITy", "2429": "@RehmTechnology @mfk_berlin Best regards! We don't know about it here📯.", "2430": "@Christi15932309 That shouldn't be the case. Can you tell us exactly where the problems were? Thank you very much!", "2433": "A must for all stamp lovers📯. @Essen_Ruhr #Stamp https://t.co/HtyB28ULCJ", "2434": "@Kxstja_hamann @DHLPaket ...that definitely looks like bulky goods, right @DHLPaket? or is that a case for Knut @IKEA_Presse? 🤔", "2435": "@WesleyJBarSim @Essen_Ruhr @DHLPaket, can you support?", "2437": ".@FIAFormulaE and DHL renew partnership to launch new Gen3 era\nhttps://t.co/vjaHYyjSxJ", "2438": "@32dani64 @UwangaMabuhbuh Thank you 😀📯.", "2440": "@mielert Thanks for the tip!", "2441": "New #directmarketing guide print mailings: tips, tools and expert knowledge for practice. Press release: https://t.co/RyfNMWya9p https://t.co/yciKtNbsgO", "2442": "David Bowie, Benjamin Blümchen or perhaps Heinrich Heine? We are looking for Germany's most beautiful #stamp of 2022. https://t.co/RULC2KH0p0 https://t.co/eH5in9tkky", "2444": "In Germany, @DHLsupplychain is opening its largest, fully automated warehouse with robotic picking for Peek &amp; Cloppenburg #Düsseldorf. More: https://t.co/z8dJrxRnLT https://t.co/4sobDL9zXI", "2445": ".@DHLsupplychain opens its largest fully-automated robotic fulfillment center in Germany for Peek &amp; Cloppenburg Düsseldorf. More: https://t.co/AHAzulB9q4 https://t.co/pV3LGoIS35", "2449": "\"Transport home!\" #almosttruemoviequotes", "2450": "@miciphone here you can see the size specifications for the large letter: https://t.co/aHP846Fp3l. Best regards", "2451": "@miciphone @DHLPaket can you please give feedback? Thanks", "2454": ".@dhl_forwarding supports @grundfos in reducing CO2 emissions. #SustainableLogistics #oceanfreight https://t.co/BEFsIh5Fo4 https://t.co/cmimjbZUZb", "2457": "🐈Deutsche Post is launching a new special postage stamp series \"Popular Pets\". It starts with the most popular pet, the #cat. https://t.co/qCjo293wB6 https://t.co/on7epoRxmn", "2458": "@goldeneblogger We are happy to be there 📯.", "2459": "@ValentinMoeller @bennibaehr @DHLPaket can you please help?", "2460": "@LadyLachfalte @deutschepost @DHLPaket can you please help?", "2462": ".@DHLeCommerce and @OfficialCainiao join forces in Poland: Initial investment of 60M euros in building the largest out-of-home delivery network. https://t.co/mPZC4Xe20Z", "2466": "DHL 2-Mann-Handling opens new logistics location in Saxony-Anhalt. https://t.co/AijBB3XzDN https://t.co/XtwmNYUMD6", "2470": "@Dora_Xplorer_ @julimaelle Postal voting is our absolute priority, and we have taken all necessary precautions (special emptying of mailboxes and Sunday delivery to the electoral offices) to ensure that the documents sent in arrive on time for the count.", "2471": "After collective bargaining, the ver.di union rejects a record offer for wage increases of up to 20.3 percent. https://t.co/mr6ZxdgcXc", "2472": "\"Northern Lights\" is Germany's most beautiful #stamp of 2022. The 100 cent stamp was released in April in the \"Celestial Events\" series in a print run of 3.4 million copies. https://t.co/oQH5hZt5V9 https://t.co/LA4N8l9SqY", "2474": "@2smart4u @fckoeln @DHLPaket Can you help here?", "2476": ".@DHLexpress brings international happiness summit @WOHASU to Italy in 2023. https://t.co/sOtqgUellq https://t.co/33m1FCjtlY", "2478": "@kai_ser69 @DHLPaket The colleagues will definitely like to take a look here.", "2479": "@Neitjrj @DHLPaket Do you know anything more about this?", "2480": "@nessi6688 @cixio @DHLPaket Is this a case for you?", "2481": "@derMacUser @norman_dus @DHLPaket Can you check this?", "2483": "@HerrGruenkocht Hello @HerrGruenkocht, we don't know who exactly wanted to talk to you. Could you follow us so we can clarify this via DM? That would be great! Thank you very much.", "2484": ".@DHLexpress launches GoGreen Plus: First global express courier gives customers the option to use sustainable aviation fuel to reduce emissions. #sustainablelogistics https://t.co/JCBW3HtGaD https://t.co/n7SkIonn9b", "2486": "@_xMJx__ @DHLPaket Can you help here?", "2489": ".@DHLexpress donates 30,000 euros for cancer prevention projects. https://t.co/fEz9VHQ2ki https://t.co/LL93sWb0DJ", "2490": "@molibtw We are very sorry. @DHLPaket Can you help here?", "2491": "@kali0x2a @DHLPaket Can you check this?", "2492": "@schlumpfinchen @DHLPaket Can you find out something here?", "2493": "@FrankNe32985582 @DHLPaket Can you please take over here?", "2496": "@jizzle88 @DHLPaket Please take delivery.", "2498": "High up on the yellow car, I sit in the front with an oat drink. 📯 #veganeSongs", "2499": "@TimThaler14 @DHLPaket Can you please take care of this case?", "2501": "@marivstheworld They look amazing 😍. Submissions of motifs are handled by the Ministry of Finance. Here is the process: https://t.co/JN7eJkzj0Q", "2503": "@spitzerjoe1 @DHLPaket Can you investigate here?", "2504": "\"100 years of Disney\" #stamp with Mickey Mouse and friends. The stamp will be released on March 1st and is worth 85 cents, which can be used to frank a standard letter (up to 20 grams), for example. https://t.co/zdA3VRt2Ok https://t.co/XQIbQJHYgC", "2505": "@seraphinho @DHLPaket Can you please take over?", "2508": "@TheChaosqueen @DHLPaket Can you take over here?", "2509": "Deutsche Post DHL Group is an international leader in refugee integration. This is according to a report published in February 2023 by the data provider Refugee Integration Insights. @RefugeeInsight_ https://t.co/gZ0RhH3rbf https://t.co/Z4wxbz6xsV", "2511": "@BeastyArtsy @MariaZynis Have you contacted your colleagues at @DHLPaket about this?", "2512": "@archphant @DHLPaket Can you explain that?", "2513": "@peepocomfy__ @lebtep_ @DHLPaket Can you check this?", "2514": "@SonnengottNika @DHLPaket Can you help here?", "2516": "@Freeride8319 @DHLPaket Can you help here?", "2517": "@MarkusOellers @DHLPaket Please take over. Thank you! 🙂", "2518": "@PanPagan @becker_meister @uransoft @UPS @DHLPaket Can you help here?", "2519": "@_noriqwq We're sorry! @DHLPaket Can you help here?", "2520": "@christoftenor @DHLPaket can you support?", "2521": "@sammy_ahren @DHLPaket can you please help?", "2522": "@WolfmannotJack @tagesschau Hello, we currently have over 23,000 electric vehicles in use.", "2525": "Thanks to outstanding international business, Deutsche Post DHL Group has achieved new records and is well prepared for 2023. #DPDHLresults https://t.co/OKMbypctUa", "2527": "Here are our results for the 2022 financial year in detail. More information: https://t.co/OKMbypctUa #DPDHLResults https://t.co/KrnfSXBGjA", "2529": "Deutsche Post and ver.di will continue collective bargaining on March 10. https://t.co/AaiRN50F0U", "2530": "@SleepingPills @DHLPackage Can you check this?", "2532": "Deutsche Post DHL Group and Poste Italiane agree on strategic partnership in the international parcel market. https://t.co/lw2imvPP2K", "2533": "After extremely difficult negotiations, Deutsche Post and ver.di agree on significant wage increases for employees\nhttps://t.co/afBFcJw62O", "2534": "Employees and trainees will receive a special payment to compensate for inflation totaling 3,000 euros over 15 months.\nIn addition, the basic monthly wages of collective bargaining employees, trainees and students will be increased by 340 euros from April 1, 2024.", "2536": "@JonArbuckle6 @DHLPaket Can you help here?", "2537": "@DeHoehner87 @kicker @DHLPaket Please take over. Thank you.", "2538": "@marisateez @DHLPaket Can you take a look here?", "2539": "@zielona_papuga @DHLPaket You can definitely help here.", "2540": "@kjbieda @DHLPaket Can you please check this?", "2542": "DHL Global Connectedness Index: Globalization remarkably robust, despite increasing decoupling between the US and China. #DHLGCI https://t.co/vsrMFkuq8E https://t.co/aGJwtrM6Le", "2546": "@lufthansaNews @lufthansa And we're waving from next door. Have a nice flight 👋👋👋.", "2548": "@StephanPschera @SpekulatiusC @DHLPaket Could you please take a look at this?", "2549": "@DerLandjaeger @DHLPaket Please take over. Thank you.", "2553": ".@aramco and @DHLsupplychain announce new joint venture for end-to-end procurement and logistics services.\nhttps://t.co/e9yxH9MxLv", "2554": "Deutsche Post DHL opens Germany's largest parcel location. https://t.co/NeJVqApOBm", "2555": "@mystayabroad @DHLPaket Can you take a look here?", "2558": "@coderobe @dpdhl_ber @DHLPaket Can you take a look here, please?", "2559": "@claudiapape @DHLPaket Please take over here.", "2560": "@Gloutondefleur @DHLPaket Can you help?", "2561": "@HJS_CC_HJ @DHLPaket Can you take a look here, please?", "2562": "@geblitzdingst @DHLPaket Can you take over here, please?", "2564": "@lv33_x We're sorry. @DHLPaket Can you take a look here, please?", "2565": "Great success for the first European edition of the World Happiness Summit @WOHASU\nhttps://t.co/j9lEBD9Nws", "2567": "@Shinji_NOIR @DHLPaket Can you take a look?", "2568": "@obermotzer Thanks for the tip! @DHLPaket Please take over here.", "2569": "@TehSemiN4p @DHLPaket Can you look at what happened here, please?", "2571": "@goretzkai We're sorry. @DHLPaket Can you please check this?", "2575": "More than 60,000 aid packages delivered to Ukraine\nhttps://t.co/HETFkXRx1G", "2579": "Dominique von Orelli becomes new CEO of Hillebrand Gori - a DHL company\nhttps://t.co/4IHS7nE1Pq", "2581": "@crunkz520 @DHLPaket can you please support?", "2583": "@Real_McJoker @DHLPaket can you support?", "2585": "We can #barge. Our Spreewald barge deliverer Andrea Bunar starts her twelfth season today. #bargedelivery #Spreewald. https://t.co/dVzkSyBWNF", "2587": "@by_kody @DHLPaket @dhlexpressuk We love red/yellow! Thanks for this tweet 😀💛♥️.", "2588": "Books for everyone! April 23rd is @UNESCO #WorldBookDay in cooperation with @StiftungLesen. Over 1 million books will be given away to schoolchildren. On top of that, there will be books from the delivery person. Supported by Deutsche Post 📕📯. https://t.co/Bw1jXEj9kz", "2590": ".@DHLexpress expands its aircraft fleet with nine B777-200LR aircraft converted by Mammoth. https://t.co/iicldp0nNh https://t.co/WA9E9QtArL", "2596": "@goldeneblogger @sipgateDE @Duesseldorf @meandall_hotels @ruv_news @glsbank Thank you for letting us be there 📯❤️💛", "2597": "Putting words into action: DHL presents sustainability milestones and a new tool at the industry's first global summit. #SustainableLogistics \nhttps://t.co/8II5uvTNqy https://t.co/OoLmAslY6Y", "2603": "Germany has the fourth cheapest postage in Europe. https://t.co/jhc1JSyif7", "2611": "@schweizok2 @anandmahindra @hankookreifen @DHLPaket @DHLGlobal @DHLexpress Have fun with the contents 😀.", "2613": "Deutsche Post DHL Group proves itself even in a challenging market environment and confirms forecasts. #DPDHLResults https://t.co/Nyw9kXqz5C", "2615": "Resilient business development: Tobias Meyer & Melanie Kreis will explain our Q1 performance today at 10 a.m. CEST in the investor call. The stream is here: https://t.co/KS8TKSm8if #DPDHLresults https://t.co/9njODVrCxs", "2616": "Here are our financial figures for the first quarter of 2023 in detail. More information: https://t.co/Nyw9kXqz5C #DPDHLResults https://t.co/RAlSUx79K2", "2618": "\"With the fundamental improvement in results in recent years, we have raised our financial strength to a new level.\" CFO Melanie Kreis on the developments in the last quarter. #DPDHLresults https://t.co/BsRLpVRGIo https://t.co/S2qJSOBefZ", "2621": "Follow the live stream of our Annual General Meeting from 10 a.m. here: \nhttps://t.co/rWLmSGShts #HV_DPDHL https://t.co/beh7FK1Yfo", "2623": "Shareholders of Deutsche Post AG decide to increase the dividend. #HV_DPDHL https://t.co/JBlfSA8QEd", "2625": "Up to 240 truckloads per week from road to #rail. DHL Freight reduces up to 11,500 CO2e with new rail connection between Denmark and Germany. 🇩🇰 https://t.co/NhPCRWjI16 https://t.co/cBNzxWg36o", "2627": "New CO2 report shows DHL business customers in detail how many CO2e emissions are generated each month through the national shipping of their parcels, returns and goods mail. #SustainableLogistics https://t.co/CsWUFjwEYr", "2628": "CMC print mailing study 2023: Advertising letters demonstrably generate more traffic in online shops. #Ecommerce #OMR23\nhttps://t.co/3s5XQGZ2Q1 https://t.co/9IZAIiGVHk", "2634": "@acewiedeinsaft greetings go out 👋👋.", "2637": "Deutsche Post sees higher #letter postage as absolutely necessary from 2024. The current volume, revenue and cost development deviates significantly from the forecasts that formed the basis of the price cap metric decision of the Federal Network Agency in 2021. https://t.co/VV5TsSajvi https://t.co/9rlYqewIzg", "2639": "@post4julia Thanks for the visit 📯.", "2640": ".@dhl_forwarding relies on the United Arab Emirates railway network as its central means of transport. @Etihad_Rail #Railway #SustainableLogistics #RailFreight https://t.co/HoRMT2PwV8 https://t.co/U9pHgHpON2", "2645": "Deutsche Post is looking forward to the IBRA (International Stamp Exhibition) 2023 in Essen. #Stamp https://t.co/fNhQ0qP6gZ https://t.co/SO9usnxOTz", "2657": ".@DHLsupplychain Global positioned as a global leader in the @Gartner_inc Magic Quadrant™ for Third-Party Logistics. https://t.co/MPxu5U3FpY https://t.co/Oa8ULl1Ebz", "2659": "DHL introduces its first fleet of 18 trucks powered by biofuel. #Biofuel #Trucks #SustainableLogistics https://t.co/ZHLqqpRnbj https://t.co/nY62V0yrfu", "2663": "Here's a podcast tip for you: Listen to the latest episode of mobiliTALK, in which our colleague Dr. Christoph Hempsch talks to Arnd Bernsmann @FraunhoferIML about sustainable last-mile deliveries! https://t.co/ok8IKAQ329", "2665": "Deutsche Post presents Germany's democracy #stamp. https://t.co/ZQ5eJFQaF1 https://t.co/jFqkYxPbRU", "2667": "More comfort in the residential area: Vonovia and Deutsche Post DHL cooperate on packing stations\nhttps://t.co/xdgtwrSbZZ", "2677": "These adorable squirrels have captured our hearts! 💌💚 It will definitely be worth waiting for them! 🐿️ #SquirrelLove https://t.co/1oZG9E953o", "2678": "Another step towards sustainable air freight: @dhl_forwarding cooperates with IAG Cargo to promote Sustainable Aviation Fuel. #SAF #aviation #SustainableLogistics https://t.co/ISs7nVk6aw https://t.co/2VPCz8D9Ns", "2683": "Don't worry, carrier pigeons used to be the rock stars of communication, but times have changed! 😎🚀 #ThrowbackThursday https://t.co/mBhBOyT8zO", "2685": "@joahnamerida What's the problem?", "2686": "@keinSpekulant @DHLPaket can you please support? Thanks", "2688": ".@DHLexpress is building a new gateway in #Helsinki.\nAll inbound and outbound express shipments in Finland will be handled at the logistics center, which is scheduled for completion in the second half of 2025. https://t.co/V3q8qF8ev7 https://t.co/YN8SZnNWlj", "2691": "Deutsche Post DHL expands network to 1,000 post offices - 24/7 availability of postal services in cities and rural areas. https://t.co/vi0sqt247s https://t.co/rNtAxewDqe", "2692": "Deutsche Post sends out around 21.5 million notifications about the 2023 pension adjustment. https://t.co/IkWzEfxkHB", "2693": "Deutsche Post DHL Group will be renamed DHL Group. https://t.co/LzJLFvQPaI https://t.co/MH8B8A8lbN", "2694": "Deutsche Post DHL Group renames to DHL Group. https://t.co/veIRzq6fCy https://t.co/uV7OHnY4It", "2695": "💦🏃‍♀️\"Let's take the stairs today\". 828 steps, 41 floors, 147 meters in altitude. The Tower Run in our #Posttower. #Bonn https://t.co/ReQCqVAQM6", "2697": "Dear horse fans. We have now switched to electric carriages. This means we can whizz through the city faster and our four-legged friends can relax in the pasture. #ThrowbackThursday https://t.co/IqTfwqZlSz", "2698": "@Itsreallycryz Have you checked the branch locator? https://t.co/N288w6qb2P", "2699": "@geschke We're sorry. It's best to contact your colleagues: https://t.co/UqfUqOt49A", "2700": "Book parcel delivery with Deutsche Post DHL free of charge. Thanks to a new service, DHL parcels can now be sent even more conveniently from home. #Parcel https://t.co/jarGJpNdTP https://t.co/b19NML66q5", "2704": "@deutschetelekom @Pandarudelhirte we don't have anything like that 😀📯.", "2706": "⚽️We are DERBYSTAR's new logistics partner and will now deliver around 1.8 million footballs from the sporting goods manufacturer to 1,500 specialist sports retailers every year. https://t.co/BelROYwjTR https://t.co/dhgiw0rs6F", "2708": "📯🖐️\"Five is trumps\". Cheers to the 5-digit #postcode. After reunification, a new postcode system had to be introduced to avoid the approximately 800 duplicates. Fun fact for all post nerds: The postcode: 5300 was previously shared by Bonn and Weimar. More: https://t.co/XsQlazQL6P https://t.co/ITtNTQ6j8X", "2713": "#ThrowbackThursday. Back then... 30 years ago we introduced the 5-digit postcode. So that everyone knew that \"five is also trumps\", 40 million postcode books were printed and distributed. Who still has this good piece at home? \nhttps://t.co/XsQlazRiWn https://t.co/OEIaqMrHfb", "2714": "Deutsche Post is discontinuing #Einkaufaktuell on April 1, 2024. The reason is increased costs and declining advertising expenditure by companies for brochures. The transition period allows business customers to adapt their advertising strategy and makes the transition easier for service providers. \n\nhttps://t.co/M0OjSPcmqY https://t.co/rJH5jATPml", "2715": "Warehouse innovation at @DHLSupplyChain:\nIn collaboration with @LocusRobotics, we will deploy 5,000 autonomous mobile robots in our warehouses by the end of the year.\nLearn more about the reasons and benefits here: https://t.co/G0iPDD4Ttp https://t.co/M1ogM9ywm7", "2716": "Have you/will you introduce robotic picking in your warehouses?", "2717": "Rail freight is an excellent sustainable alternative to road transport, producing less than 6% of greenhouse gases compared to 52 trucks. Discover more on #DHLDelivered: https://t.co/aUGCgYSU5V\n\n#Trainspotting #RailTransport #DHL #Delivery https://t.co/ciRfmmNwd6", "2718": "Are you team rail or road?", "2719": "Many of you embrace the future of warehousing with robotic picking or plan to do so.\n\nBut 53.8% of you answered \"no\" 👎.\nWhat's stopping you from implementing robotic picking in your warehouses?", "2720": "@DHLexpress has appointed Mustafa Tonguç as Managing Director Germany. With extensive experience in the logistics industry, he will be responsible for the strategic direction and operational business of DHL Express in Germany. https://t.co/zcueuCTmuM\n\n#DHLExpress #DHL", "2721": "Now new at Deutsche Post: The improved post scan service! Letters can now be easily scanned, saved and managed online. Can be booked now, available from August. https://t.co/MXtMJ9cHlL\n\n#DeutschePost #PostScan", "2722": "We are deploying a new electric truck fleet in Berlin! Together with the Federal Minister for Digital and Transport, @Wissing, 13 new electric trucks were presented in the capital yesterday. Find out more:https://t.co/3IKa3QguI8", "2723": "German companies are increasingly relying on #dialoguemarketing! According to the Dialogue Marketing Monitor 2023, dialogue media will grow by 4% to 22.9 billion euros, while traditional media will decline by 4% to 18.9 billion euros. Find out more here: https://t.co/1UBZH3HVLz", "2726": "DHL Group takes over the Turkish parcel service provider MNG Kargo @mngkargo. More: https://t.co/ULqp7TxxWQ https://t.co/snJdjcMXG5", "2729": "#ThrowbackThursday to a time before shipment tracking 😱\n\nWho stands excitedly at the window after ordering online despite shipment tracking?\n\nAnticipation is still the greatest joy 😉\n\n#DHL #Delivery #TBT https://t.co/z3mUPfMyPM", "2730": "Private customers can now actively avoid greenhouse gas emissions when sending their DHL packages and parcels to the #USA, #Australia and #Israel. #SustainableLogistics More: https://t.co/6unoWLjl3t", "2731": "@raripopari @tperlen We say: \"Hello, fine Gurki\"👋😊", "2732": "🎸Special stamp honors #JimiHendrix. Start of the new series \"Legends of Pop/Rock Music\". There is also a special edition pack set. #Stamp. ➡️https://t.co/1rz0XJXq3W https://t.co/7CsRdTiLEs", "2733": "Nicola Leske will be the new Head of Corporate Communications &amp; Sustainability at DHL Group from August 1st. #DHL https://t.co/T1hizDAIec https://t.co/ieRJc1J3D0", "2734": "DHL Group holds its ground in a weak market environment and raises the lower end of the Group EBIT forecast. #DHLresults https://t.co/Bn9olg1TwN", "2735": "Investor conference call at 10:00 a.m. Melanie Kreis (CFO) explains the group results for Q2 2023. #DHLresults https://t.co/KS8TKSm8if", "2736": "Here are our financial figures for the second quarter of 2023 in detail. #DHLresults More information: https://t.co/Bn9olg1TwN https://t.co/3dBxCCfdMv", "2737": "\"In the second quarter, we once again demonstrated our performance.\" CFO Melanie Kreis on the developments in the past quarter. #DHLresults More: https://t.co/rgcvVHBxTt https://t.co/vIEJURmaQg", "2738": "@MrWissen2Go Could you please DM us the location so we can sort this out? Thank you!", "2739": "We had the bird for short messages as early as 1960. #TwitterX #ThrowbackThursday https://t.co/d2ELUBKpDb", "2740": "@MissPennywise2 That's really sweet, thank you very much👍.", "2741": "@JessicaBllr Even more than 280 characters ☺️.", "2742": "@toxocracy Hello, we just checked. Have you filled in all the fields? After that, the button should actually be activated. Best regards", "2743": "Deutsche Post considers the Federal Network Agency's decision against restarting the postage procedure to be wrong\nhttps://t.co/f1RZDqVmIl", "2744": "DHL Global Forwarding announces leadership change in air freight business\nhttps://t.co/hoqJF2LcKb", "2745": "Deutsche Post and the Association of German Philatelists are once again calling for the \"Stamp of the Month\" competition\nhttps://t.co/mOAAXSBffD", "2746": "⚡️🔌What more could you want? We are currently testing the stylish @TrucksVolta in our DHL Freight Terminal in Cologne. Range 200km by the way. #Electromobility #SustainableLogistics https://t.co/L27BhEAsy9", "2747": "@mahnkenzeichen so much 😎.", "2748": "@d_b_z the older ones also remember how important a pencil could be to save batteries 😎.", "2749": "DHL Global Forwarding is seeing increasing demand for sustainable transport solutions. For customers like the life sciences group @novonordisk, decarbonization options are becoming a key factor when choosing a logistics partner. #SustainableLogistics https://t.co/v5lanoRum6 https://t.co/HfH6WRiRlB", "2750": "@ursula_bub @TrucksVolta @DHLPaket, can you support?", "2751": "@L_Normann Welcome 😉.", "2754": "DHL expands solar ship route in #Berlin. More than 50,000 packages have already been delivered by boat in a CO₂-neutral manner in the capital. #Solar #SustainableLogistics https://t.co/o9F4xuwIJo https://t.co/MSn1q0sEas", "2755": "Recommended by dachshunds, delivered by DHL: sniff, run, deliver – in record time! #DogsOfDHL #dhl #dogs #dogday https://t.co/3Jzleqiu3q", "2756": "Delivery to #Helgoland ❤️. https://t.co/X98d0JDgTc", "2757": "DHL Parcel increases prices for business customers. The prices for DHL parcel shipping by private customers remain unchanged. More: https://t.co/R57O2Du9Au https://t.co/C7MC44jRRM", "2758": ".@DHLeCommerce celebrates 100,000th access point in Europe. #ECommerce https://t.co/Y9OPP46n43 https://t.co/IDoJChjctE", "2759": "LEJ CAMPUS officially opened at the DHL hub #Leipzig.\nhttps://t.co/YtVauBSkqH https://t.co/PReRvpMi7C", "2762": "@magnarssonTV @BMF_Bund Sounds like a great idea! The boys would certainly have deserved it, wouldn't they @BMF_Bund ? 🏀 😉", "2763": "Global Volunteer Day: 1.3 million DHL Group volunteers get involved in 15 years. #volunteering https://t.co/Mt23DbYxsh", "2765": "@stefan_lingen ahem... that looks weird. We passed it on straight away. Thanks for the tip. https://t.co/E8ZqBRZZDh", "2766": "The partnership between @F1 and DHL shows how the latest technologies and new ways of working can ensure a more environmentally sustainable future for Formula 1 racing. https://t.co/DeG0sYoYWs https://t.co/Ln6lxs2JTY", "2767": "@frankzdeluxe Oh Franky, you as a \"deliverer of serenity\". That would be a dream. Best wishes 📯😉.", "2768": "Postal companies around the world are becoming more and more environmentally friendly. On the occasion of #GreenPostalDay celebrated today, the postal companies organized in @IntPostCorp have published their progress in #climate protection. https://t.co/vAI5kQIYhF https://t.co/juECRprtUG", "2769": "@freexfly Hello, thank you for your message! We recommend that you contact our customer service directly with your request: https://t.co/6UaiGKGuNt", "2770": "@frankzdeluxe @hajoschumacher @prjournal @DPRGde @radiopragentur Thank you very much for the 👍👍👍and then a Langnese ice cream.", "2771": "Triple: @DHLexpress secures the title of best employer in Europe for the third time in a row. #Greatplacetowork. More: https://t.co/RSpsecA9Vs https://t.co/MPdCut3Pi9", "2772": ".@DHLexpress is the new \"Exclusive Partner\" for the @RBLeipzig women's team. More: https://t.co/c4vSYAJngT https://t.co/uTyJRCphuJ", "2773": "DHL Online Shopper Survey: 95 percent of online customers cancel their purchase if the delivery option is not suitable. More:\nhttps://t.co/e2fQVwxu29 #ecommerce #shopping https://t.co/xxqciRsOlj", "2774": "Many paths, many languages ​​- and yet connected. 💛 ​​We reach so many people worldwide every day and in (almost) all languages! Cheers to the European Day Of Languages ​​🌎 \n\n#EuropeanDayOfLanguages ​​#DHLFamily #Delivery https://t.co/jmnUX3LTTS", "2775": "20 years of #Packstation - A yellow machine revolutionizes the receipt and sending of packages. More: https://t.co/xEKURf2deA https://t.co/KXUuxcVfxH", "2776": "@WolberJC_RegPol @DHLPaket @dpdhl_dus Great! 💛", "2777": "Connecting people, in East and West, in Germany and the world: That is our mission. #TagderDeutschenUnity https://t.co/XNZuEnMHju", "2778": "DHL Group launches GoTeach program for young people in Ukraine\n@sos_children\nhttps://t.co/jQ0Is7vcBw", "2779": "#AI-supported #ComputerVision is an industry-defining technology according to the latest DHL Trend Report\n#DHLinnovation #trendreport\n\nhttps://t.co/dN94PxgXkq", "2780": "Acquisition approved: Turkish parcel service provider MNG Kargo now part of DHL Group\nhttps://t.co/LTAi2M9CI9", "2781": "@Cole_Thatch Hello Cole! Of course it's possible. :) Create a customer account and you can flexibly redirect your shipment to a packing station or branch near you. \n\nYou can read everything else here: https://t.co/pfWhF4Tvkr\n\nWe hope this helps you! 😊", "2782": "@Cornykikiyt @DHLPaket Hello Chiara, \n\nIf we don't have any information about your shipment yet, there may be various reasons for this, e.g. that the shipment has just been delivered to the branch and the status information has not yet reached our system.", "2783": "@Cornykikiyt @DHLPaket You can read here what each status means.\nhttps://t.co/3OqmaDO779\n\nIf not, please get in touch with us again! Best wishes, your DHL team 💛", "2784": "DHL acquires all remaining shares in Danzas AEI Emirates to further strengthen its position as a leading logistics provider in the GCC markets. More: https://t.co/No1k5oRbJL https://t.co/yvBzidnewH", "2785": "@JN574040 Hey Noah, sorry for the delay. 🥺 did you get your letter yet?", "2786": "@Candice72621612 Hey you! We're sorry that your package was delivered to you opened. We can't explain how that could have happened. Maybe the clasp wasn't closed properly? We hope nothing got lost.", "2788": "@Placebox Hello Klaus, we are sorry that you had a negative experience with us. Have you already asked customer service? \nKind regards\nYour DHL Twitter Team", "2789": "@littlemissmessy Dear Kirstin, we are sorry that you have had a negative experience with us. Have you already asked customer service?", "2790": "@Ashley8053 @DHLPaket Hey you! Forwarding to branch means that the package is still being delivered but has not yet arrived. Here is an example of a screenshot: if the message \"Shipment is ready for collection at the branch\" appears, the package is only ready for collection. https://t.co/Bi9Uy8n5wO", "2791": "@The_Woodtree Hey there! We're sorry about the delayed delivery. Unfortunately there's nothing we can do about it - try again via customer service. We're keeping our fingers crossed that you'll be successful soon!", "2792": "@Galaktischer53 Hello. When was your delivery sent and when is it expected to arrive? It's best to contact customer service directly, they can probably give you more information.", "2793": "@JestaedtThomas Hello! We are sorry that your package arrived like this. Unfortunately, we cannot explain it and do not know what happened here.", "2794": "@FeyEtros Dear Fey, we're sorry to hear that. This is of course completely unacceptable and cannot be excused. Unfortunately, we cannot help you or your friend here as we do not have any further information. 🥺", "2795": "@TugrulKaynakGS Hello! You are welcome to redirect all mail, both those addressed to a PO box and those addressed to a house, to the PO box for the mailbox owner and, if desired, also those of his co-users, instead of to the house mailbox: https://t.co/ASX2u6YlDs", "2796": "@TugrulKaynakGS This can be determined individually.", "2797": "@stadtleben_HAL @stadt_halle @DHLPaket @HalleVerkehrt That's the way it has to be! 🚴", "2798": "@Catlady_AC We're sorry to hear that. Unfortunately, we can't help you any further and just hope that things will work better in the future. Have you received your mail yet?", "2799": "@JuliaMarasha Dear Julia, we are sorry that the letter ended up with you by mistake. But mistakes can happen and that is human. 😊", "2800": "First official German #crypto #stamp is coming. More: https://t.co/IqcouOeygG https://t.co/XS4y5nkFCo", "2801": ".@DHLsupplychain is investing 350 million euros in Southeast Asia to make customers' supply chains more resilient. More: https://t.co/AmFZXDM6Qx https://t.co/CNhn3GZlqC", "2802": ".@DHLexpress and @NewsWorldEnergy agree global partnership to accelerate decarbonization of aviation through #SustainableAviationFuel Certificates. More: https://t.co/25FpxSKPFg", "2803": "#Throwback to the office in 1925. It's quite nice here, isn't it? 🤭\n\n#dhl #tbt #officelife #throwbackthursday https://t.co/UgBZHeMuv1", "2805": "DHL puts bio-CNG filling station network into operation. #SustainableLogistics\nhttps://t.co/Yy094TG3jr", "2806": "@_Paulomart @DHLPaket Hey, thanks for letting us know straight away. The app should actually work and registration should work after the first time. When should your package actually arrive? The best thing to do is ask customer service directly, they can definitely help you. 🙏", "2807": "Logistics for #ecommerce - DHL Fulfillment Network creates space for more customers with a new warehouse in Euskirchen. More: https://t.co/ku0ryFQ06T", "2808": "DHL becomes official logistics partner of the International Luge Federation. #Luge More: https://t.co/8zgOnaPIFw", "2809": "Today, Federal Finance Minister Christian Lindner and Nikola Hagleitner, Board Member of Post & Parcel Germany, officially presented the first #crypto stamp in Berlin at the Museum for Communication @mfk_berlin. @BMF_Bund https://t.co/nfm74tRUtk", "2810": "@KBerger112 @mfk_berlin @BMF_Bund Hier https://t.co/mn8N4OxPx8", "2811": "Ready, set, flight! 👀✈️ Always delivered quickly, then and now. #dhl #dhlthrowback #avgeeks https://t.co/Jn261sx2I2", "2812": "@TheRavenW0lf Hey, we're sorry and we can imagine that this can be annoying - especially if it has happened several times. However, mistakes can happen and that is absolutely human. So please remain respectful. 🙏", "2813": "@NikolausKatrin Dear Katrin, we are sorry that the packages could not be delivered directly to you. Unfortunately, we cannot say exactly what happened today. We really hope that you will receive your packages soon! 🙏", "2814": "@Levent_Creator Do you want a shitstorm? 👀", "2815": "@Levent_Creator One thing is certain: everyone is welcome here. 💛🙏", "2816": "He doesn't do anything! #Halloween https://t.co/KaKSgRPNu2", "2817": "New Christmas stamps for festive #letters. \nhttps://t.co/nxkSNvDKJj https://t.co/EnG0heLTe9", "2818": "Ordnungsfimmel in a cool way 😎 #tbt #post #dhl #ThrowbackThursday https://t.co/qEiK5YDVbA", "2819": "#Christmas 2023: DHL expects over 11 million shipments in the German parcel business on busiest days\nhttps://t.co/0zquQ9VVnl", "2820": "🤖@DHLsupplychain and robot manufacturer AutoStore™ are expanding their partnership to automate warehouses worldwide. #Robots #Logistics More: https://t.co/TK73aPahTr", "2821": "DHL Group meets market expectations in the third quarter of 2023 and demonstrates financial strength in a weak global environment.\n\nMore:\nhttps://t.co/jYS5BR2h2r \n\n#DHLresults", "2822": "Here are our financial figures for the third quarter of 2023 in detail.\n\nFurther information:\nhttps://t.co/jYS5BR2h2r \n#DHLresults https://t.co/99RUGgCSHV", "2823": "\"We are on track to achieve our annual targets. Now it is paying off that we prepared for the increasing uncertainty early on.\" CEO Tobias Meyer on the developments in the last quarter.\nhttps://t.co/flHQZYIGdX #DHLresults https://t.co/9wG6phtSlh", "2824": "Groundbreaking ceremony in #Berlin-Marienfelde: DHL Freight plans sustainable terminal on Buckower Chaussee. https://t.co/u3xxc3CPE3", "2825": "DHL officially opens expansion of Hamburg parcel center\nhttps://t.co/fN7AddthfA", "2826": "Our Christkindpost branch in #Engelskirchen is open again 📯🎄. https://t.co/G0OhzLHTKU", "2827": ".@DHLexpress opens new, expanded global hub in #HongKong, positioning itself for the recovery of world trade. More: https://t.co/KZ3cG2DKg8", "2828": "New corporate green transport policy sets global sustainability standard for @DHLsupplychain's fleet. More: https://t.co/ZWQ8b0B3FP #SustainableLogistics", "2829": "DHL Express among the top three of the world's best employers for the fourth year in a row\n#BestWorkplaces #GreatPlaceToWork #gptw\nhttps://t.co/Q9fK8YoUQ1", "2830": "Santa Claus was spotted in an electric vehicle from Deutsche Post DHL 🎅.\nChildren can write a letter to him, the Christ Child or Santa Claus and get an answer.\nhttps://t.co/sxMI8lbKY8\n\n#SantaClaus #Christmas #DHL #DeutschePost #WishList https://t.co/aJRTzCxUrB", "2831": "#Throwback to a time before smartphones.📞 Hard to imagine, right? #TBT #ThrowbackThursday \n\n📷 @mfk_berlin https://t.co/o1Kw8cqdgo", "2832": "DHL ends the 2023 @F1 season with the awarding of the fastest lap and fastest pit stop prizes. #Formula1 https://t.co/kTiudYBuO2", "2833": "@ThomasBusch4 Hello Thomas, we understand how important your delivery is to you. To help you as best as possible, we recommend contacting our customer service directly. https://t.co/6UaiGKH2D1", "2834": "@sinnverloren Hello, thank you for your message! We recommend that you contact our customer service directly with your request: https://t.co/6UaiGKGuNt", "2835": "@LesterBurhamm Hello, we understand how important your delivery is to you. To help you as best as possible, we recommend contacting our customer service directly. https://t.co/6UaiGKH2D1", "2836": "DHL is building a new European Innovation Center in Troisdorf and is focusing entirely on sustainability. https://t.co/ytER7E2KOI", "2837": "🎄📨📦This is how letters and packages arrive safely before Christmas Eve. More: https://t.co/1mZN1PdcOD #Christmas https://t.co/hrFJtiOkSC", "2838": "Moin, with a look back to 1976 and a postman who cycled through the streets of Hamburg at that time. Get on the saddle, pedal, go! 🚴‍♂️📬 #tbt #VintageVibes #ThrowbackThursday https://t.co/Sd28w4ByMX", "2839": "Hillebrand Gori - a DHL company becomes official logistics partner of the International #Wine Challenge. More: https://t.co/FMbPpOYZPf https://t.co/zbon1SJy1c", "2841": "@sinnloslustig Hello, we understand how important your delivery is to you. To help you as best as possible, we recommend contacting our customer service directly. https://t.co/6UaiGKGuNt", "2842": "@bicpi Thank you for your comment, we have passed this on internally.", "2843": "@AblenkSeb Hello, for inquiries regarding your delivery please contact customer service https://t.co/6UaiGKGuNt", "2844": "@youknowigotyou_ Hello, we understand how important your delivery is to you. To help you as best as possible, we recommend contacting our customer service directly. https://t.co/6UaiGKGuNt", "2845": "@StepIntoPurple If there is a problem with your shipment, please contact our customer service directly: https://t.co/6UaiGKGuNt", "2846": "@Exobass If there is a problem with your shipment, please contact our customer service directly: https://t.co/6UaiGKGuNt", "2847": "@EchtKeinPlan_ @DHLPaket If there is a problem with your shipment, please contact our customer service directly: https://t.co/6UaiGKGuNt", "2848": "@holyashura Hello, we understand how important your delivery is to you. To help you as best as possible, we recommend contacting our customer service directly. https://t.co/6UaiGKGuNt", "2849": "@pascalzahn Hello, we understand how important your delivery is to you. To help you as best as possible, we recommend contacting our customer service directly. https://t.co/6UaiGKGuNt", "2850": "@Cartoon_King_ Hello, we understand how important your delivery is to you. To help you as best as possible, we recommend contacting our customer service directly. https://t.co/6UaiGKGuNt", "2851": "@TWuddi Hello, thank you for your message! We recommend that you contact our customer service directly with your request: https://t.co/6UaiGKGuNt", "2853": ".@DHLexpress announces leadership changes in Europe and the Americas region. More: https://t.co/g0eRBBweYO", "2854": "No lie: Captain Bluebear and Pinocchio are getting their own stamps. #Stamp \nhttps://t.co/Oiszr7N4nv", "2856": "@CoolDad96427717 @DHLPaket @dpdhl_muc Hello, we understand how important your delivery is to you. To help you as best as possible, we recommend contacting our customer service directly. https://t.co/6UaiGKGuNt", "2857": "@DerCool77713966 Hello, for inquiries regarding your delivery please contact customer service https://t.co/6UaiGKGuNt", "2858": "@foediausg @DHLexpress Hello, for inquiries regarding your delivery please contact customer service https://t.co/6UaiGKGuNt", "2860": "@foediausg If there is a problem with your shipment, please contact our customer service directly: https://t.co/6UaiGKGuNt", "2861": "@TheSuperjuliaxD If there is a problem with your shipment, please contact our customer service directly: https://t.co/6UaiGKGuNt", "2863": "@TheUnlimited64 Hello, thank you for your message! We recommend that you contact our customer service directly with your request: https://t.co/6UaiGKGuNt", "2864": "@catweazle69 Hello, we understand how important your delivery is to you. To help you as best as possible, we recommend contacting our customer service directly. https://t.co/6UaiGKGuNt", "2865": "@wodahs2011 Hello, thank you for your message! We recommend that you contact our customer service directly with your request: https://t.co/6UaiGKGuNt", "2866": "@EchtKeinPlan_ @DHLPaket Hello, we understand how important your delivery is to you. To help you as best as possible, we recommend contacting our customer service directly. https://t.co/6UaiGKGuNt", "2867": "Wind, rain, thunderstorms: No problem for our mailbox in Cuxhaven - all letters have always been safe here. ⚓️🌊 #TBT #ThrowbackThursday https://t.co/YMN3Rj8yFO", "2868": "DHL Group receives Corporate Health Award for excellent #healthmanagement. More:\nhttps://t.co/8ws4EOtis9", "2869": "@Don_Don_Katsu If there is a problem with your shipment, please contact our customer service directly: https://t.co/6UaiGKGuNt", "2870": "@GermanGermanZo1 If there is a problem with your shipment, please contact our customer service directly: https://t.co/6UaiGKGuNt", "2871": "@Miki28201 If there is a problem with your shipment, please contact our customer service directly: https://t.co/6UaiGKGuNt", "2872": "@AndreasStocki If there is a problem with your shipment, please contact our customer service directly: https://t.co/6UaiGKGuNt", "2873": "@KiPos_info Hello, thank you for your message! We recommend that you contact our customer service directly with your request: https://t.co/6UaiGKGuNt", "2874": "@Unstoppabl0611 @DHLPaket Hello, thank you for your message! We recommend that you contact our customer service directly with your request: https://t.co/6UaiGKGuNt", "2875": "@ArmyBts2019 @DHLGlobal Hello, thank you for your message! We recommend that you contact our customer service directly with your request: https://t.co/6UaiGKGuNt", "2876": "@stitch_inside If there is a problem with your shipment, please contact our customer service directly: https://t.co/6UaiGKGuNt", "2877": "@DoktorMunich Hello, thank you for your message! We recommend that you contact our customer service directly with your request: https://t.co/6UaiGKGuNt", "2878": "@basti1897 Hello, thank you for your message! We recommend that you contact our customer service directly with your request: https://t.co/6UaiGKGuNt", "2879": "@EkoFreezy Welcome to the team, dear @EkoFreezy 📯📦. https://t.co/5M47bRbXJS", "2880": "The most unusual DHL deliveries of 2023 - a special annual review from the world market leader in logistics. \nhttps://t.co/5ZNemzzcTI", "2881": ".@UNIDO and DHL Group join forces to fight food waste and climate impacts. More: https://t.co/YAT1H6wX6h https://t.co/LYBk6YdNNB", "2883": "@CrashedYou Hello, thank you for your message! We recommend that you contact our customer service directly with your request: https://t.co/6UaiGKGuNt", "2884": "@AlbrechtSBine Hello, for inquiries regarding your delivery please contact customer service https://t.co/6UaiGKGuNt", "2885": "@dupontmolotov Hello, thank you for your message! We recommend that you contact our customer service directly with your request: https://t.co/6UaiGKGuNt", "2886": "@delmundogaming Hello, we understand how important your delivery is to you. To help you as best as possible, we recommend contacting our customer service directly. https://t.co/6UaiGKGuNt", "2888": "@JrgNeb Hello, thank you for your message! We recommend that you contact our customer service directly with your request: https://t.co/6UaiGKGuNt", "2889": "@GermanGermanZo1 Hello, for inquiries regarding your delivery please contact customer service https://t.co/6UaiGKGuNt", "2890": "@Bl4ckmoooon Hello, thank you for your message! We recommend that you contact our customer service directly with your request: https://t.co/6UaiGKGuNt", "2892": "@DoktorMunich Hello, we understand how important your delivery is to you. To help you as best as possible, we recommend contacting our customer service directly. https://t.co/6UaiGKGuNt", "2895": "@TechDad1977 Hello, we understand how important your delivery is to you. To help you as best as possible, we recommend contacting our customer service directly. https://t.co/6UaiGKGuNt", "2896": "No one can resist this sight - #Planespotters, do you know the model? 👀✈️ #TBT #DHL https://t.co/v0ZwQVFwsp", "2897": "@JBorowski Hello, we understand how important your delivery is to you. To help you as best as possible, we recommend contacting our customer service directly. https://t.co/6UaiGKGuNt", "2898": "@fetischterranov Hello, thank you for your message! We recommend that you contact our customer service directly with your request: https://t.co/6UaiGKGuNt", "2900": "@schnabelschnell Please get in touch here: https://t.co/6UaiGKGuNt. Thank you very much!", "2901": "@DTreubler9319 Hello, thank you for your message! We recommend that you contact our customer service directly with your request: https://t.co/6UaiGKGuNt", "2902": "@spickermann Hello, thank you for your message! We recommend that you contact our customer service directly with your request: https://t.co/6UaiGKGuNt", "2903": "@wickedWTstormer Hello, we understand how important your delivery is to you. To help you as best as possible, we recommend contacting our customer service directly. https://t.co/6UaiGKGuNt", "2905": "@getigART_neu Hello, for inquiries regarding your delivery please contact customer service https://t.co/6UaiGKGuNt", "2907": "@bitterlemmer Hello, thank you for your message! We recommend that you contact our customer service directly with your request: https://t.co/6UaiGKGuNt", "2908": "@yd0b0nico Thank you for your feedback. We are in the middle of the pre-Christmas period and many people are sending a lot of mail at the moment. Therefore, a mailbox can get quite full.", "2909": "@ServiceLiese @DHLexpress Hello, thank you for your message! We recommend that you contact our customer service directly with your request: https://t.co/6UaiGKGuNt", "2910": "@Duracelde Hello, we understand how important your delivery is to you. To help you as best as possible, we recommend contacting our customer service directly. https://t.co/6UaiGKGuNt", "2911": "@AllerleiLeberei Hello, thank you for your message! We recommend that you contact our customer service directly with your request: https://t.co/6UaiGKGuNt", "2912": "@sulm76677 Hello, thank you for your message! We recommend that you contact our customer service directly with your request: https://t.co/6UaiGKGuNt", "2914": "@SpeedTutorial Hello, thank you for your message! We recommend that you contact our customer service directly with your request: https://t.co/6UaiGKGuNt", "2915": "Express delivery 1979 with a view. What a unique shot! 💛📦 #tbt #Sydney https://t.co/hySaeBYhp8", "2916": "Seven Deutsche Post Christmas post offices in 2023: 609,500 wish lists for Christ Child, St. Nicholas and Father Christmas\nhttps://t.co/VYIMVKeEp9", "3076": "Massive thanks to all the other fantastic scientists featured in this video! Yang Huang, Xue-Fei Bai, Yang Huang, Monica Wanyi Xia, Jingyan Qu, Ivy Yuhan Li, Ann Zhu Chen, Grace Yuan Yuan, Anna Mei-Tong Lin, Daany Wenhao Li, Echo Yun Yu, and Yiming Ji 👏", "3242": "We are waiting for you at #SIBCA2023. Come meet us (A11) to talk and discuss our #CimentBasCarbone. Today, come and attend our conference, Joffre room, at 10:30 a.m. on the theme: “Low-carbon concrete: ECOCEM solutions, feedback from 3 key partners” https://t.co/acdc4htpcu", "3297": "@le_egar Bravo! Who wants a harder one?😌 https://t.co/7Jc5cw0zXp", "3298": "@sahiim_ ⚡️The tension in this episode⚡️", "3299": "@sahiim_ Our hearts are wavering https://t.co/gk4jV2aDOP", "3300": "“A tireless servant of the State, Mr. Roussely never stopped defending French industry. At the head of EDF, he led major transformations at the dawn of the 21st century. My thoughts are with his loved ones and those who worked alongside him.” Luc Rémont https://t.co/492xyB37Or", "3301": "@JVCom it’s a UP⬆️💡for ecology️", "3303": "Carried out every 10 years, the ten-year inspection is a real highlight in the life of a reactor with a dense maintenance and control program. In Civaux, it marks the 20th anniversary of reactor 1, the safety of which has been further improved. https://t.co/7JICtO7glM", "3304": "In October 2021, it was on this reactor that the phenomenon of stress corrosion was detected on certain portions of piping during scheduled checks. https://t.co/F1mxHjl49H", "3305": "This is a known phenomenon in the industry and can be detected by carrying out specific ultrasonic checks carried out preventively. After checks and expertise, 44 meters of pipes were replaced. https://t.co/6saepqXTxF", "3306": "The Civaux nuclear power plant is the newest in France. It has an installed capacity of 1450MW per reactor, these are the most powerful reactors in the nuclear fleet. They produce electricity for around 3.3 million people. https://t.co/9AMde1ZvYM", "3307": "[THREAD] EDF and the Government of Andorra extend the collaboration agreement in favor of the Principality's energy transition and open new avenues of collaboration.", "3308": "This partnership offers a framework for the Principality of Andorra to fight against global warming by moving towards low-carbon electricity production through concrete actions. \n\n@FEDA_Andorra \nhttps://t.co/yO6hQGYmaD", "3309": "In addition to production solutions, it also enables the development of energy efficiency programs and the deployment of smart meters. Through this partnership, we reaffirm our desire to build a low-carbon and responsible energy model.", "3310": "@Sham_Rock71 Quite a twist of fate ⚡️ https://t.co/EFUvUlrfw1", "3311": "@RebeuDeter It's not too late for you to become the Goat 😎 of Minecraft with our #Carbonfighters datapack 👇 https://t.co/LsP4P1yVyP", "3312": "@epicsefy @RebeuDeter We see that our #CarbonFighters datapack is making people happy! To test it 👉  https://t.co/93nsH95N5C", "3313": "@JeanPaulepanda Our employees are talented!", "3314": "@le_gorafi A power station at home? Easy ! Install the #CarbonFighters datapack on Minecraft 😎👇\nhttps://t.co/LsP4P1yVyP", "3315": "To all students: may fate be favorable to you! 😁\n#enJeuxdAvenir2024 https://t.co/lKhca3zmt8 https://t.co/UsGBaoY2k7", "3316": "@Sat_lys the secret is out 👀 https://t.co/qewJBEOhGT", "3319": "@bennocap To open an electricity contract with us in a few clicks 😉👉 https://t.co/Rc2RETV7va", "3320": "@bennocap We leave this conversation neither seen nor known 😅 https://t.co/XVr8tGmrN2", "3321": "Grandma's advice &gt;&gt;&gt;&gt;\n#UsefulGestures https://t.co/9PY4WK3cE9", "3322": "This morning, @EDFofficiel unveils its 2022 annual results. A first for Luc Rémont, CEO of the Group since last November. Many media responded to the invitation. #tread ⬇️ https://t.co/dBShckzN23", "3323": "Since taking office, Luc Rémont has been in the field, in contact with those who make EDF. He was able to see the remarkable mobilization of the teams during the winter. https://t.co/Mi9GiGBNuW", "3324": "In 2022, the Group's EBITDA is strongly penalized by the drop in nuclear production and the exceptional regulatory measures put in place in France last year. The details of the results can be discovered here 👇 https://t.co/yMxMp05j1Z", "3325": "EDF has faced many challenges and has enjoyed great success in France and internationally. A look back at the highlights of 2022 👇 https://t.co/BXTIRfUuoc", "3326": "Luc Rémont speaks about 2023 \n“Today, our priority is the recovery of EDF and I am convinced that all the actions underway will bear fruit. I can already talk about the successes that we will achieve in 2023” https://t. co/lUle25KnOM", "3327": "\"With a view to improving the group's financial trajectory, I decided with the executive committee to launch 4 operational excellence projects at the start of the year.\" adds Luc Rémont https://t.co/ygde7nwkjs", "3328": "Come and chat with our employees and discover exciting jobs 🤩\n\nFrom February 23 to 26, EDF will be present at the Lyon edition of #VivaFabrica 👇\n\nhttps://t.co/k8icWS9XUb https://t.co/OngyFcnhCo", "3329": "Industry and young people, are they two? Answer in this video 👇 https://t.co/ITNdPelQNe", "3331": "@energiedusport @LaffontPerrine .@LaffontPerrine, one word: https://t.co/sIN40FoSlt", "3333": "@PatrickAdemo Pikachu ⚡️", "3334": "@spotifyfrance @MisterVonline @juiceakakanda @xSqueeZie Still missing a small solar panel? 😁☀️", "3335": "A competition committed to the climate and the environment by halving its carbon emissions?\n👉 This is the common objective set with @Paris2024 for a new Games model\n\nWant to talk about it? Ask all your questions and see you on March 14 for the 2nd episode of #ExAequo 📢 https://t.co/1ytKL0mYKl", "3336": "Memorable @Paris2024 Games, that's what we all want 🙌🏅\nBut responsible Games, is it possible?\n\nTo find out, follow our #live with @Vanessalemoigne, @alainbernard, @franckchauveau1 and @Amadea_k 🎙️\n\nAnd we don't forget the reminder 🔔👇\nhttps://t.co/t6QARzfCvC", "3337": "#ExÆquo returns Tuesday with @Vanessalemoigne for an episode on the responsible commitments of @Paris2024!\nDon't miss this #Live, we're offering you tickets for the Olympic Games:\n👉Subscribe to @EDFofficiel\n👉Connect to #Spaces to enter the draw ⤵️", "3338": "The @Paris2024 Olympic Games are getting closer!\nAnd the new episode of our #ExAequo series even more!\n\nMeet at 7 p.m. with @Vanessalemoigne, @alainbernard, @Amadea_k and @franckchauveau1 to get their opinions and answers to your questions 👉 https://t.co/z5jP0fA4dI https://t.co/cpSuuv4yWT", "3339": "#EDF announces the appointment of Brice Bohuon to the Executive Committee of the EDF Group as Group Executive Director, in charge of the General Secretariat.", "3340": "The new episode of #ExAequo is in a few minutes! ⏱️ https://t.co/z5jP0fA4dI", "3342": "It's not 1, nor 2, nor 3... But 5 crystal globes 🤩 Well done @LaffontPerrine 👏 https://t.co/I09DXR35V5", "3343": "By how much will @Paris2024 divide the carbon footprint of the Olympic and Paralympic Games ❓", "3344": "If you don't have the answer, it's hidden here 🙈 Listen again to our #TwitterSpaces 👇\nhttps://t.co/4Y0wDRqmBi", "3345": "What is a STEP? \nLittle tutorial 👇\nhttps://t.co/P5fB68NDbG", "3346": "To explore the subject, see you Friday at 12:15 p.m. for our #Spaces with our experts, hosted by Virginie Hilssone-Lévy 🎙️\n\n👉https://t.co/OwMOtOMiik", "3348": "🎙🔴 We are online and live for our #Spaces on the subject of hydroelectricity in the face of climate change \n\nJoin us👇\nhttps://t.co/qEYjs4FpmJ", "3349": "The EDF group and Maple Power win a one gigawatt offshore wind project off the coast of Normandy.\n\nThis new offshore wind project will provide France with competitive and renewable electricity, contributing to the country's carbon neutrality objective. 👇", "3350": "Working on the deployment of an innovative project offering reliable and #carbon-free energy? 🍃\n\nThis is what Capucine is doing by participating in the development of small modular power plants ☢️\n \nDiscover his job in this episode of #ElectricTeam ⚡️ https://t.co/Zbv5NmvtVd", "3351": "@Paris2024 We will learn it but in the meantime, we will play it easier 😅\n#SOP2023 https://t.co/xMixaPiGcI", "3352": "In partnership with Le Souvenir français, to coincide with the law of April 8, 1946 (nationalization of electricity and gas), EDF will now rekindle the Flame under the Arc de Triomphe every April 8. It has shined since 1923 in infinite respect for French soldiers. https://t.co/BYE19PbxDX", "3353": "In 2022, the #Mediator of the EDF group has 👇\n✅ shortened the average instruction time by 11 days\n✅ successfully completed files in 85% of cases. \n\n#DLDMars", "3359": "EDF announces the appointment of Caroline Chanavas as Deputy Director of Human Resources. She will join the Group on April 17, 2023.", "3360": "🗣️ “The company offers the possibility of a rich and varied career”\n\nAfter 7 years as a #design engineer at #EDF, Farida is now flourishing as a #buyer 👩‍💻\n\nDiscover his daily life in this episode of #ElectricTeam ⚡️\n\n https://t.co/f5Hc7Mk5VE", "3361": "@AurelyMariette Good evening, to help you as best as possible, can you send us your contact details and your customer number in DM via the link https://t.co/CXHEEcXvxk? Mylène, your EDF advisor", "3362": "@JimMuganza Find all our offers here 👇\nhttps://t.co/jtdbhgCCni", "3363": "Yesterday morning, visit to Hinkley Point C with @AgnesRunacher @grantshapps and Luc Rémont. This visit highlighted the synergies enabled by cooperation between the 🇫🇷 and the 🇬🇧. #Nuclear will play a major role in the energy transition in Europe. #netzero https://t.co/Hj5Qy5djys", "3364": "@jul Et la tracklist a bonus. https://t.co/05CNOvEAuE", "3365": "The #alternation at #EDF means a 95% chance of obtaining your diploma 🧑‍🎓👩‍🎓\n\nThat's not enough to convince you? 👇\n\nSee you Wednesday at 12:30 p.m. with @mrlechat94 for a new #EDFRéponde ⚡️\n\n #DLDAvril @EDFRecrute\n\nhttps://t.co/tmEuPFJD1b", "3366": "Any plans for tomorrow?\n\nWe have an idea for you 👇\n\nSee you at 12:30 p.m., for a brand new #EDFRepond on #alternation, with @LucieCMN, @emmanuelraynal4 and @mrlechat94 ⚡️\n\n#DLDAvril @edfrecrute", "3367": "Did you miss it? 😬\n\nDiscover the replay of Space #EDFRRespond on #alternation with @mrlechat94 @LucieCMN and @emmanuelraynal4 ⚡️\n\n#DLDAvril @EDFRecrute\nhttps://t.co/tmEuPFJD1b", "3368": "@energiedusport @Gnougnou25, you dazzle us 🤩👏 https://t.co/1OVPjKFCj8", "3369": "FALSE ❌❌\n\n🟢 CAP\n🟢 BAC, BAC PRO\n🟢 BTS, DUT\n🟢 License\n🟢 Master, engineering degree\n\nWith its 230 professions, the #alternation at #EDF there is something for all tastes and types of diploma! 👩‍🎓\n\n#DLDAvril @EDFRecrute", "3370": "#ElectricTeam is back ⚡️\n\nDo you know the role of #hardwareengineer?\n\nNo ? That's good, Sébastien takes you straight away to discover his #job 🧑‍💻\n\n#DLDAvr \n\n https://t.co/cb6YBykdnG", "3371": "45 meters high and 80 meters wide.\n↕️To within 4m, it is the equivalent of the height of the Notre-Dame-de-la-Garde basilica in @marseille. \nExcept that there, it floats 🛟 https://t.co/quG2LMCLex", "3373": "Mentally we are there https://t.co/ti14WwMXuX", "3374": "@manseril16 Physically, still in place 😉 https://t.co/9YtdNFj6KZ", "3375": "@BazillonLudovic Or a little closer to the stars 🤩 https://t.co/wA1gBmdUlO", "3376": "What if we really took the time to talk about it? 🧐\n\nOn June 5, 7 and 9, #EDFRepond returns for 3️⃣ lives hosted by @AlexKouchner where climate experts will decipher the perception of #climatechange in support of the #ObsCOP study. \n\nDon't forget to turn on reminders 🔔👇🏼 https://t.co/tR1rILNO2c", "3377": "@AlexKouchner Is it up to citizens to act? 👊🏼  \n\nTo try to answer it, meet on Monday June 5 from 12:30 p.m. to 1:15 p.m. with @CdBoisenton, chief impact officer at EDF and Solange Martin, sociologist at @Ademe.\n\nhttps://t.co/PvFdgNz30P", "3378": "How to combat environmental misinformation? 🚫🧐\n\nMeeting on June 7 at 12:30 p.m. with @didierwitko, director of studies at EDF, @chavalarias, director of research at @CNRS and @L_Cordonier, director of research at @F_Descartes.\n\nhttps://t.co/TJsHgJlevO", "3379": "Southern countries, how are they taking part in the climate challenge? 🤝🏻\n\nWe debate it on June 9 with our experts @jaffrelotc, research director at @CNRS, Samadia Sadouni, political scientist and Yvan Roussin, communications manager for the EDF international department\nhttps://t.co/BHJXHiY4t8", "3382": "@SanofiFR @sanofi @orange @vivendi Congratulations again for this victory and heart to all the candidates, what a show!! ⚡️⚡️⚡️ https://t.co/KWAUwxDbpZ", "3384": "@orange @OLYMPIAHALL @SanofiFR @vivendi Congratulations again to all the candidates! No other words, they really shined last night 🤩☀️ https://t.co/cwCR7OxijC", "3385": "Climate change, does citizen action carry weight? 🏋🏻‍♀️\n\nAnswer ➡️ June 5th from 12:30 to 1:15 p.m. to review the conclusions of the #ObsCOP with @AlexKouchner, in the company of @CdBoissezon, chief impact officer at EDF and sociologist @Martin2Solange.", "3386": "Your opinion counts too! 👇🏼  \nDo you think a lifestyle change is necessary to save the planet? 🌍", "3388": "Ask us your questions in the comments and we will try to answer them as best we can in this new episode of #EDFRéponde 😉👇", "3389": "@toof_chris Hello @toof_chris, can you clarify your question here? 😊\nTHANKS", "3390": "@Sou07_ Hello Sou, here is our purpose: “Building a CO₂-neutral energy future, reconciling preservation of the planet, well-being and development, thanks to electricity and innovative solutions and services”.\nAll the info here: https://t.co/nn3fYc7B7F", "3391": "#FakeNews: a threat to the fight against climate change? 🌐\n\nJoin @AlexKouchner on June 7 at 12:30 p.m. with @WitkowskiDidier, director of studies at #EDF, @chavalarias, director of research at @CNRS and @L_Cordonier, director of research at @F_Descartes.", "3392": "According to you 💬\n\nIs disinformation an obstacle to action in favor of preserving the planet? 🤔", "3394": "Ask us your questions in the comments! We will answer them live 😉🌎", "3395": "Second session ! 🎧\n\n(Re)Listen to our entire episode of #EDFRépons in which our experts question the link between disinformation and climate skepticism 🧐\n\n➡️Meeting Friday with @AlexKouchner to close this series under the sign of #ObsCOP 🎙️ https://t.co/y4z5vNmwGy", "3396": "➖ financed, ➕ affected: how are the countries of the South participating in the #climate change?  \n\nMeeting on June 9 with @AlexKouchner who will receive @jaffrelotc, research director at @CNRS, Samadia Sadouni, political scientist and @ivanroussin, communications manager of EDF's international department.", "3397": "Feed the debate 📢  \n\nDo you think that the countries of the South have the means to effectively fight climate change? 🤜🏼🤛🏼", "3398": "Implementation of the compulsory withdrawal of EDF capital securities", "3401": "🎬 End clap for this series of #TwitterSpaces dedicated to #ObsCOP 🌍🎙️\n\nFind the replay of the last episode #EDFRons on the countries of the South facing climate change ⬇️\nhttps://t.co/BHJXHiY4t8\n\nTo listen without moderation ! 🎧\n\n#DLDAvr", "3402": "@ItsNameJr This poster shocks us ⚡⚡⚡", "3403": "Solar energy produces even when you can't see the sun ☀️\n\n#self-consumption #solar #DLDMai", "3404": "This is the first time that a floating solar power plant has been commissioned in France by @EDF_Re ☀️\n\nOn 17 hectares, it can produce 20MW, or the consumption of 12,500 inhabitants.\n\nhttps://t.co/nj9mzYXxiX", "3405": "This is the first time in France that a floating solar power plant has been set up on a lake which is already used to produce electricity from hydraulic sources 🌊\nThis facility has been in operation since 1992. https://t.co/nEGuIXkQhi", "3406": "🥇 We have become the first most visited company in France according to the @EetD_FR Company Visit Observatory!\nSo this summer, do like everyone else, come and meet us! \n👉 https://t.co/rmE6M0Vcz2", "3407": "@guinean224 Energy is our future, let's save it 👀👀👀️", "3408": "We use one of your 600 tweets to remind you that in France, our #electricity is produced 96% without CO2 emissions thanks to nuclear power and renewable energies. Oh yeah 😎 https://t.co/L6qZqOThzy", "3409": "To find out more 👇\nhttps://t.co/WGC4sh8cBy", "3410": "They say that the sun is good for morale, but did you know that it is also good for: \n👉 Your home\n👉 Your wallet\n👉 And the planet? \n\nMeet on July 7 at 1 p.m. with @EMMANUELLEdeco for a new episode of #EDFRéponde dedicated to the challenges of self-consumption ☀️", "3412": "@Jeune_Solitaire Turning off the light when someone is sleeping is a reason for love (and an eco-friendly gesture)😃", "3414": "@GQMagazine 🎀 Electricité De France 🎀", "3415": "#EDF in be like emojis 👀👇\n\nAnd you, if you had to describe EDF in emojis, what would it be? 🤔\n\n#WorldEmojiDay https://t.co/KR8CIJr3n2", "3416": "@Talie_Ra226 We cheated a little 🫣\nWho votes to have them in their next update? 🙋‍♀️", "3417": ".@EDFofficiel and @NHPC_Officiel celebrate the filling of the Nachtigal dam, the largest hydroelectric development in Cameroon. \nWith an installed capacity of 420 MW, the Nachtigal dam will cover 30% of Cameroon’s electricity needs. https://t.co/c84RvatQzN", "3419": "The line-up for our next #Space has just been released!\nSee you on Monday at 12pm to discuss the evolution of women's football with @Vanessalemoigne, @CarineGalli\nand @GeorgesLaura ⚽\n\nWant to take part in the debate?\nAsk your questions here and join us for this 3rd episode of #ExAequo👇", "3420": "Tweet dedicated to all those who want to win the @equipedefranceF jersey ⚽\n\nSee you Monday at 12 p.m., for a new episode of #ExAequo!\n👉 https://t.co/UtKWXdQGEu https://t.co/3aeRlgUl3q", "3421": "|￣￣￣￣￣￣￣￣￣￣￣|\n             APPOINTMENT IN 1 HOUR\n|_________＿＿＿＿＿＿__|\n           \\ (•◡•) /\n                 \\ /\n                 ---\n                 |   |\n\nhttps://t.co/UtKWXdQGEu", "3423": "Ask us all your questions here for this new episode of #ExAequo 👇", "3424": "@Youridefou “Wind turbines are wind!”", "3425": "@gaspardooo DIN-GUE-RIE, especially when it is low carbon😉", "3427": "@equipedefranceF 6-3 😮\nCongratulations to our Blues for this match and this amazing number of goals ⚡️\n\n#ProudtobeBlue https://t.co/La7Je9Vt1e", "3428": "“We’re playing football, always a guy phrase?” ⚽️\n\nTo re-listen to the debate hosted by @Vanessalemoigne in the presence of @CarineGalli and @GeorgesLaura, click here 👇", "3429": "@LeBouseuh Still looking for electric Pokémon around here ⚡️", "3430": "Question: did you also feel like an adult when you signed up for your first energy contract? ⚡️", "3432": "This summer, do like everyone else, go hiking! 🥾☀️\nMore than 40 EDF sites await you for a behind-the-scenes tour of electricity production. \n\nDon't wait any longer and register now 👇", "3433": "How do we transform solar energy 🌞 into electricity ⚡️?  Find out the answer here ⬇️\n#Solar #Energy @EDF_RE https://t.co/pXWqxRAH29", "3434": "@nocontextfre His landscapes https://t.co/zY6NNAh0Mi", "3436": "@KarmineCorp @CalisteLoL Happy birthday and thank you for sublimating Zeri ⚡⚡⚡", "3437": "#JEP2023: have you reserved your places to discover behind the scenes of electricity production ⚡️?\nIn the 4 corners of France, unique visits and a wide program are waiting for you ➡️: https://t.co/lEe6v1gOYe\n#VisitEDF #JEP2023 #IndustrialTourism https://t.co/5s1PV1vsK2", "3439": "And if you also want to post from there, download the #CarbonFighters datapack 📷https://t.co/LsP4P1ynJh", "3440": "After taking on the challenge of playing #Minecraft without coal with EDF's #CarbonFighters datapack, @AypierreMc is back to explore a #nuclear power plant and navigate among 80 #offshore wind turbines in real life with @GaspardG_ 🤩 \n📌 See you on September 12!\n#DLDSept https://t.co/sJGMuRyOXF", "3441": "How do you transform the power of water 🌊 into electricity ⚡️?\nCheck out the answer below ⬇️:\n@EDF_Hydro #Energy #hydroelectricity #RenewableEnergy\nMore ➕ info here: https://t.co/CwfOHIyud3 https://t.co/dJuskxN2K1", "3442": "🔴 ONLINE - #CarbonFighters2 \n\nAfter taking up the challenge of playing #Minecraft without coal with our datapack, @AypierreMc sets off to discover a nuclear power plant and an offshore wind farm with @GaspardG_ 🤩\n\nFrom game to reality, it's just one click 👇", "3443": "Because #Nuclear and #RenewableEnergies are part of the solution to fight global warming, discover how the @EDF_RE teams and their partners are developing wind farms and in particular floating wind turbines.\n#WindAtSea https://t.co/1NRjW4LdcN", "3444": "EDF teams are honored to be included in the top 10 best performing companies in the world, following the study conducted by @Time and @Statista, based on revenues, employee satisfaction and ESG data.\n#WorldsBestCompanies\nhttps://t.co/MELjoOX8t6", "3446": "@NetflixFR Objectively: Zenitsu ⚡️", "3447": "After taking on the challenge of building his Minecraft map without mining coal with EDF's #CarbonFighters datapack, @AypierreMc returns for an #Episode2 to explore a nuclear power plant and navigate among 80 wind turbines at sea in real life with @GaspardG_ https://t.co/uio3xHyXuf", "3448": "@AypierreMc @GaspardG_ Download the #CarbonFighters datapack right here 👇\nhttps://t.co/LsP4P1ynJh", "3450": "@PTropheeGoat If there is a course on electrical circuits we can help.", "3451": "EDF supports overseas territories and Corsica in their energy transition, taking into account their specificities.\nFind out how ⬇️", "3452": "@Vadouuuuu When you sign up for an electricity contract for the first time 📝", "3453": "Supporting the French Overseas Departments and Regions (D.R.O.M.) to achieve 100% renewable production by 2030 is EDF’s commitment.\nMore info here 👇\n#Energy #Renewable #Climate #DLDApril", "3454": "@KarmineCorp If the announcement is indeed the LEC slots, we hope to see Zeri in the roster of characters ⚡️", "3456": "@ricktheizzler1 @bobjouy Hello @ricktheizzler1  \nThe Tempo option offers a favorable electricity price 343 days a year. More info here 👉 https://t.co/MCbewxE0oO", "3457": "#Nuclear, an essential for a low carbon society⤵️\n\n1⃣ For the climate\nThe electricity produced emits very little CO₂ 👉 each kWh produced by EDF's nuclear fleet in France emits the equivalent of 4g of CO₂, when the world average is 12g of CO₂ per kWh.", "3459": "The only thing we want to see: a third electricity station ⚡️ https://t.co/bBhu463N1u", "3461": "Who said that #cooking and saving #energy are not compatible?\n\nTomorrow, chef @NorbertTarayre cooks useful gestures and proves you wrong! 🧑‍🍳\n\n#DLDMai https://t.co/HBGxSZV7GC", "3462": "Useful gestures also apply in #cooking!\n@NorbertTarayre proves it to you with two #recipes that are as delicious as they are economical 😍\n\nAt your stove 🔪 ⤵️\nhttps://t.co/0Jhn2GXNRP\n\n#DLDMai https://t.co/pf3CMAYavi", "3463": "@CelineGuivarch @tourneeclimbio Hello @CelineGuivarch, would it be possible to communicate by private message? 🙂", "3464": "@DrLouiseSlater @PierreGentine @UniofOxford @oxfordgeography @IntelliEarth @PhilipStier Hello @PierreGentine, would it be possible to exchange by private message? 🙂", "3465": "🎉 This week EDF celebrates 25 years of investment in the United Kingdom 🇬🇧.\nEDF group employees are very proud of the work accomplished by @EDFEnergy and wish their colleagues a happy birthday 🎂.\nFind some memories here 🎥➡️ https://t.co/Fm0xcqSFbq https://t.co/vKaRsYHce0", "3466": "On Reunion Island, EDF PEI teams converted the Port Est power plant to liquid biomass. EDF's production fleet on the Island is thus completely renewable*, which makes it possible to support the region in its ambition to be 100% #renewable by 2030.", "3468": "@evudro It’s us 🫡", "3469": "It’s time to preheat your oven 🔥\n\nChef @NorbertTarayre returns Wednesday with a new energy-efficient #recipe, to the delight of your taste buds 😍\n\n#DLDMars https://t.co/dwMSWHLAmd", "3470": "The French urge to shout “THE LIGHT” when someone doesn’t turn off the light when leaving.", "3472": "@gaspardooo I'm a non 😆", "3473": "A 100% oven-baked #chef's menu to optimize your energy consumption, is it possible? 🤔\n\nYES ! 👊 @NorbertTarayre shares with you his #recipes for chicken, rice pilaf and chocolate cake.\n\nPreheat the oven 👩‍🍳👨‍🍳\nhttps://t.co/0Jhn2GXNRP\n\n#DLDMars https://t.co/i89wsmCm0S", "3477": "Being part of the territory means being close to our customers, being reachable and ready to support them in managing their supplies. \nDiscover the Enel Space closest to you: https://t.co/7T3oW2gfqu https://t.co/KaTKqwoAnD", "3478": "Activating the Web Bill is easier than you think. Watch the video and discover all the ways available to you to do it. For info, click here: https://t.co/AIwCkv17Ys https://t.co/7JxzLq6BE3", "3479": "The transfer is the change of ownership of the electricity or gas contract. Unlike takeover, it is requested when the supply is still active, therefore there will be no interruption of service.\nFind out more: https://t.co/Kp9M0UA5Dg https://t.co/XAO9yxrAbK", "3480": "Is it worth using only electricity? Look at it from the right side, that of safety. With the induction hob in the kitchen the risk of burning yourself also decreases. Find out how to best use energy, choose #IlLatoMigliore: https://t.co/FtDWBqV69L https://t.co/dzbcDckPmJ", "3481": "The largest photovoltaic panel factory in Europe opens in Catania with a unique technology in the world.\nFollow the live streaming on Monday 6 February from the construction site here👇\nhttps://t.co/XkOSY0TCoo\n#EnelperlItalia #CINEA_EU #InnovationFund #TANGO https://t.co/I37ApTgGfi", "3482": "Do you know our loyalty program? Many people have already signed up for ENELPREMIA WOW!, sign up too and be amazed: https://t.co/6Z9BJOfQqV https://t.co/f9k5f1woGw", "3483": "Today is #WorldEnergySavingDay, an opportunity to draw attention to issues such as sustainability, respect and protection of the environment.\nThere are many daily actions that we can implement to save energy at home.\n👉 https://t.co/E7bExJg23q https://t.co/6eAFBRN5HL", "3484": "Enel Energia is \"Service Champion 2023\" nominated by the German Quality Institute for the energy sector, but the credit goes to you, because it is you who give us the right motivation and energy to always pursue excellence.\nFind out more: https://t.co/d8POy1Y1Q3 https://t.co/r7TRQuvkao", "3485": "Are you looking for an easy way to monitor your #consumption and manage your #bills? Try the #EnelEnergia app! \nYou will also be able to access the benefits of our loyalty program #ENELPREMIAWOW! and discover many news about the world of #energy.\n👉 https://t.co/kKdsjKoXGp https://t.co/ZrvqOWqwrU", "3486": "⌚What would you do with 3 hours of energy a day? Rediscover your passions with ORE FREE.\nYou have the price of the energy component blocked for 12 months and you can choose 3 hours a day in which the energy component is free. \nFind out more 👉 https://t.co/qT1thjuW9J https://t.co/K6sG4teWRx", "3487": "The credit goes to you if we won the \"Service Champion 2023\" award from the German Quality Institute ITQF for the level of customer satisfaction. Contact us by phone or many other methods. We are always ready to ignite your ideas. 💡 https://t.co/FjreXiJDJt", "3488": "We have provided online support at https://t.co/lR1pMnPLrA but the credit goes to you if we won the \"Service Champion 2023\" award from the German Quality Institute ITQF for the level of customer satisfaction. We are always ready to ignite your ideas. https://t.co/hai63MQH2B", "3489": "It's official: this year too Enel is sponsoring the #MagliaRosa of the #Giro d'Italia 2023! \nAre you ready to follow it step by step with us?\n#EnelperlItalia https://t.co/XCeK00RYEB", "3490": "Thanks to our social channels and with your help we won the \"Service Champion 2023\" award from the German Quality Institute ITQF for the level of customer satisfaction. We are always ready to ignite your ideas. https://t.co/Vt9eRqe1H8", "3491": "The credit goes to you if we won the \"Service Champion 2023\" award from the German Quality Institute ITQF for the level of customer satisfaction. Come and visit us in our stores. We are always ready to ignite your ideas. https://t.co/sYYdQXo9Ja", "3492": "⌚ Enjoy the time outdoors and #Spring, with #summertime you have more hours of light and one more reason to save energy! 💡 https://t.co/Ayjq6gzU8d", "3493": "🌸Welcome back spring with ENELPREMIA WOW! 🐻\nParticipate in the competition and try to win a bill bonus worth €50 every day. Plus you can participate in the final draw for a €500 @Ecobnb_it Gift Card.\nWhat are you waiting for? https://t.co/ZQzCRIkRhw https://t.co/HxnoaDweqk", "3494": "Relaxation and smiles is what we wish you.\nHappy Easter from Enel Energia. 🐰 https://t.co/S5DEU1aHFD", "3495": "Discover Enel Flex, the three-hourly offer that saves you in the evenings and on holidays. Flexible and digital, it adapts to market changes.\n👉 https://t.co/73MFGCX1KE https://t.co/wgjWz0zaF1", "3496": "Is it worth using only electricity? Look at it from the right side, that of saving. With the balcony panel, choose a more sustainable lifestyle for both you and the environment.\nFind out more: https://t.co/4hQPPNozfh\n#TheBestSide https://t.co/eCGNs6iGgY", "3497": "🌍 Today is the day dedicated to the place where we all live: it's #EarthDay. \nLet's always take care of the #Earth starting from simple daily gestures.\n#WorldEarthDay https://t.co/jHMgbWapMw", "3498": "Choose the freedom of having 3 hours of free energy component every day and at a fixed price.\nDiscover the ORE FREE offer 👉 https://t.co/qT1thjuW9J https://t.co/SMFYnn2H2y", "3499": "Is it worth using only electricity? Look at it from the right side, that of safety. With the induction hob in the kitchen the risk of burning yourself also decreases. Find out how to best use energy, choose #IlLatoMigliore: https://t.co/FtDWBqVDZj https://t.co/NWrHS2pTqP", "3500": "Every moment of your life needs a different kind of energy and our mission is to make it easier for you. With Enel you have a unique partner for your home that offers you energy, integrated and innovative solutions and from today also Fiber.\n👉 https://t.co/aaryQDkbBE https://t.co/29cNliq98k", "3501": "The 2023 #Giro d'Italia starts tomorrow, and are you ready to follow it with us stage after stage and discover the winner of the #MagliaRosa?\n#giroditalia2023 https://t.co/yYgsr0DpHH", "3502": "🚴‍♂Take part in the #EnergiaInGiro competition and, if you request your code in one of our stores, you can try to win special prizes every day. Plus you will participate in the final draw for other prizes!\n👉 https://t.co/P3gcf9GC0i https://t.co/nPVWWloYJa", "3503": "🚴‍♂ With ENEL GIRO 15 you have a 15% discount on the list price of the energy component, blocked for 12 months. The offer is valid until 05/29, discover it now⚡\n👉 https://t.co/BO48njiPEJ https://t.co/rdL1QYkFVX", "3504": "Today is World Light Day and we couldn't help but remind you.😉\nWe are proud to be alongside our customers every day.💡 https://t.co/YyoKY1mpHD", "3505": "😍Let's relive together all the emotions of the stages during the first week of the @GirodItalia, from the Costa dei Trabocchi to Naples! Were you there?\nCome visit us in the stage villages and follow the #giroditalia2023 with us!\n#benvenutasemplicità https://t.co/zyRjDM9D0I", "3506": "The Arch of Constantine in Rome is tinged with pink in view of the last stage of the #giroditalia2023.\nThanks to @EnelXItalia for this show! 👇 https://t.co/4bymhHKNLy", "3507": "😍Let's relive together all the emotions of the stages during the third week of the @giroditalia, from Borgofranco d'Ivrea to Val di Zoldo! And were you there?\nCome and visit us in the stage villages and follow the #giroditalia2023 with us!\n#welcomesimplicity https://t.co/LpVjyJRaC6", "3508": "Until Sunday the Trevi Fountain will light up pink, thanks to the sustainable technologies of @Enel\n🤩 Are you ready to find out who will win this edition's Maglia Rosa? https://t.co/WQVpI2xRft", "3509": "The 106th edition of the @GirodItalia ends today in Rome.\n🏆 Congratulations to @Rogla winner of the #MagliaRosa and the #giroditalia2023. https://t.co/fmwPQscNFg", "3510": "It was a Giro d'Italia full of emotions and this year too we followed it from start to finish, together with all of you!\nLet's relive the best moments together 😍\n#giroditalia2023 #benvenutasemplicità\nhttps://t.co/nywoQt6cIZ", "3511": "For us, cycling means the Giro d'Italia, which we support as a sponsor of the Maglia Rosa, but not only that! We love cycling because it is sustainable and allows you to move around the city or in nature easily. This is why today we celebrate #WorldBicycleDay. 🚴‍♂️ https://t.co/deexJ6vGYj", "3512": "@Schirmans @EnelGroupIT Hi @Schirmans, to allow us to delve deeper into your case, write us a private message here on Twitter.\nThank you, the Enel Energia Team", "3513": "⚡With E-LIGHT GAS, if you join online by 06/27, you have the cheapest price of the gas raw material component.\nHurry, it's online only and for a limited time 👉 https://t.co/EKaIRmhY99\nGas raw material component price: €0.75/Sm3 blocked for 1 year. CCV: €10/month. https://t.co/Dr9Ms5Kv8G", "3514": "⚡For you, convenience and tranquility in a single offer. With E-LIGHT LUCE, if you sign up online by 06/27, you have a discounted price for the energy component.\n👉 https://t.co/EKaIRmhY99\nEnergy component price €0.209/kWh blocked for 1 year. CCV: €10/month. https://t.co/2FWBXjFeEy", "3515": "Don't miss the chance to discover the new offers from Enel Energia!\nOur agents come to your home to offer you personalized advice, the important thing is to recognize them.\nFor any doubts call the toll-free number 800900860.\nhttps://t.co/jgCb4OKfqU https://t.co/2bJ3jYimyH", "3516": "What can you do to recognize an Enel Energia agent ringing your doorbell? ​\nAlways remember to read carefully before signing each document and for any doubts call the toll-free number 800900860.\n👉 https://t.co/jgCb4OKfqU https://t.co/sMBwjkcw68", "3517": "Don't miss an opportunity! Our agents arrive at your home to offer you personalized advice, the important thing is to know how to recognize them. For doubts or reports, call the toll-free number 800900860 from Italy.\nhttps://t.co/jgCb4OKfqU https://t.co/09cmQ58qjI", "3518": "@Redivivo_ Hi, we have reported several times to the competent Authorities the phenomenon of scam phone calls made by operators who abusively use the Enel name. Authorized telephone numbers can be easily verified here https://t.co/LSLyVzquUV", "3519": "Discover Enel Flex, the three-hourly offer that saves you in the evenings and on holidays. Flexible and digital, it adapts to market changes.\n👉https://t.co/73MFGCX1KE https://t.co/h5voVHYVg6", "3520": "People make our company special and allow us to offer you a service that is increasingly closer to your needs. They are Ani and Irene, consultants at the Enel Space in Padua.\nCome and visit us in our stores, find the one closest to you: https://t.co/W2p55gAXUK https://t.co/oiHif975KS", "3521": "💡 Participate in “Three steps into sustainability with ENELPREMIA WOW!” and try to win fantastic prizes every day. \nIf you are not yet registered, sign up for ENELPREMIA WOW! 👉 https://t.co/x2eg8KxQII https://t.co/FeUovt6jCG", "3522": "In our Enel Spaces we take care of your energy. Introducing Rossana, consultant for the Enel Space in Treviso. \nCome and visit us in our stores, find the closest to you: https://t.co/W2p55gAXUK https://t.co/czAvGECO1s", "3523": "Contrary to their name, heat pumps can also cool and dehumidify the environment. \nIf combined with a photovoltaic system, the advantages increase considerably.\nDiscover other tips for saving in summer and all year round on ViviElettrico: https://t.co/YCLeFGHnaW https://t.co/ucs1SsoSZc", "3524": "In our Enel Spaces we are always ready to welcome you with a smile. Roberto and Vincenza, consultants at the Spazio Enel in Naples, testify to this. Find the store closest to you and come visit us: https://t.co/W2p55gAXUK https://t.co/lWlon25iJJ", "3525": "☀ Participate in “Three steps into sustainability with ENELPREMIA WOW!” and try to win fantastic prizes every day. If you are not yet registered, sign up for ENELPREMIA WOW! 👉https://t.co/x2eg8KxiTa https://t.co/d197EuhxBJ", "3526": "People who go to Enel Spaces always find kindness and empathy.\nIntroducing Iolanda, consultant at the Enel Space in Bari.\nCome and visit us in the store closest to you: https://t.co/W2p55gAXUK https://t.co/uaWa4Gfkvo", "3527": "@masman007 @a_meluzzi Hi, thank you for the report. We would like to point out that Enel Energia does not carry out this type of unfair practice and that it is also prohibited for our partners. The Company pays the utmost attention to similar cases by reporting them to the AG. For info: https://t.co/anADqIYbUR", "3528": "With Enel Energia, simplicity takes shape, even in the bill! 📄\nNow it is even clearer, transparent and immediate 🤓.\nDiscover all the news 👉 https://t.co/iHKjqamMdw https://t.co/c2b3A0Jy9K", "3529": "Discover Enel Flex, the three-hourly offer that saves you in the evenings and on holidays. Flexible and digital, it adapts to market changes.\n👉https://t.co/73MFGCXzAc https://t.co/e7Y4OKQxkY", "3530": "🫧 Participate in “Three steps into sustainability with ENELPREMIA WOW!” and try to win fantastic prizes every day. If you are not yet registered, sign up for ENELPREMIA WOW! 👉 https://t.co/x2eg8KxQII https://t.co/lLVzEhl6LI", "3531": "When a company like @PianteFaro has to choose the right energy partner, it looks for those who can fuel dreams and ambitions. Look at our Business Story. 👇\n\nMessage also containing promotional content from @EnelXItalia and @enelxwayitalia https://t.co/99UnISv9p5", "3532": "A 24-hour marathon 🕐 to remember the importance of zero value when talking about CO2 emissions. Precisely today, we at Enel Energia renew our commitment to safeguarding the planet. 🌍\n#ZeroEmissionsDay #CarbonNeutrality https://t.co/zMZAWNkbKV", "3533": "Having a reliable partner, like Enel Energia, means having the time to focus on your business to build a better future.\nMario Faro, CEO of @PianteFaro, tells us about it. 🪴\nMessage also containing promotional content from @EnelXItalia and @enelxwayitalia https://t.co/yJvUtPJ9XB", "3534": "🫧 Participate in “Three steps into sustainability with ENELPREMIA WOW!” and try to win fantastic prizes every day. If you are not yet registered, sign up for ENELPREMIA WOW! 👉 https://t.co/x2eg8KxiTa https://t.co/gnaAKXcFf0", "3535": "Our stainless energy is the key to CPC INOX's success.\nFind out how we help a large Italian company grow in our Business Story. 👇\nMessage also containing promotional content from @EnelXItalia. https://t.co/xWkLkenpMl", "3536": "Cooking with an induction hob, in addition to the economic advantages, brings others, such as saving on CO2 emissions, more uniform cooking, more precise temperature regulation and greater safety.\nFind out more about ViviElettrico: https://t.co/ybOpbTS63O https://t.co/HYThnjX9RM", "3537": "Quality and speed are the winning values ​​for a successful company. Alberto Schiavo, CPC Inox Sales Director, tells us about it. Watch the interview. 👇\nMessage also containing promotional content from @EnelXItalia. https://t.co/scfgoiql2o", "3538": "We are the energy that helps you achieve winning goals and break new records. 🏎\nThis is why @SparcoOfficial has chosen us as its energy partner.\nLook at our Business Story. 👇\n\nMessage also containing promotional content from @EnelXItalia and @enelxwayitalia. https://t.co/rQwUm9z7Fv", "3539": "“Energy for a company is like the nervous system for a human being.”\nWatch the interview with Aldino Bellazzini, President and CEO of @SparcoOfficial \n👉 https://t.co/rdEXcSEUHd\nMessage also containing promotional content from @EnelXItalia and @Enelxwayitalia", "3540": "With Choose Today from Enel Energia you have the list price of the energy component blocked for the first 12 months.\nFind out more 👉 https://t.co/RClvrRomW9 https://t.co/MoLIZAQcWP", "3541": "At Creazioni Digitali our energy ignites creativity and illuminates ideas.\nCheck out this and the other Business Stories.\n👉 https://t.co/fh5crLgRlQ\nMessage also containing promotional content from @EnelXItalia. https://t.co/gUuRnU991Q", "3542": "“Using energy in a conscious and sustainable way is a source of pride.”\n@LuciniRoberto, CEO Creazioni Digitali, talks about how our energy mixes with creativity and sustainability. https://t.co/fh5crLgRlQ\nMessage also containing promotional content from @EnelXItalia. https://t.co/F5Peh16LN5", "3543": "🎉When an offer is convenient, efficient and moves with you, it is definitely Formidable👍.\nFind out more 👉 https://t.co/k09D1GZiu4\n#TuttoEnelFormidabile https://t.co/RzwfPsFrIP", "3544": "Have you ever thought that an offer on electric mobility 🚘 could surprise you? Enel's Formidable Dual Mobility will take care of it 👍 with Light, Waybox and free up to 10,000 km. Only until December 31st.\nFind out more at https://t.co/k09D1GZiu4\n#TuttoEnelFormidabile https://t.co/67cpATDgyI", "3545": "With ENELPREMIA WOW! your points last one more year! Collect them until 8/31/24 and claim rewards until 10/29/24. Your WOOOOW is even longer! 🤩 https://t.co/WQiLa5ncGh\nComplete regulations and methods of participation on https://t.co/lR1pMnPLrA and the Enel Energia App. https://t.co/TJwLsArHlj", "3546": "No wonder! With the Formidabile Fotovoltaico offer, you have a 3 kW photovoltaic system for €65/month for 120 months. 🌞 And if you add Formidabile Luce you get a €100 annual bonus on your bill for 2 years. Only until December 31st.\n👉 Find out more at https://t.co/k09D1GZiu4 https://t.co/4LUibpOMnD", "3547": "On November 21st, turn on Black Friday with Enel Energia, the offer you were looking for is arriving. 👀\nFind out more 👉 https://t.co/Prm0kWoiUU https://t.co/R0Df8KJdhn", "3548": "Can't you help but be amazed😲?\nI believe it, it's a FORmidable trio 👍.\nIf you choose Formidabile Luce, Gas e Fibra from Enel you have up to €400 annual bonus on your bill for 2 years. Only until December 31st.\nFind out more at https://t.co/k09D1GZiu4 https://t.co/GxaXk5wWgZ", "3549": "There's an offer on electric mobility that you can't help but... hum! 🎵 It's Formidable Dual Mobility from Enelcon Luce, Waybox and free up to 10,000 km 👍. Only until December 31st. Find out more at https://t.co/k09D1GZQjC https://t.co/Vh6QaSybmH", "3550": "■With Black Friday E-light Luce and E-light Gas are even more advantageous!■ Discover the details of the offers, what are you waiting for? 👉 https://t.co/er2f9ItPdH https://t.co/LT92TG38tp", "3551": "🤩 Let yourself be surprised by #ENELPREMIAWOW! Choose between #Veepee, #AcquaAlma and #Treedom.\nDownload the app 👉 https://t.co/ZqxDCTnDqV https://t.co/0iKxBzBn3a", "3552": "You won't believe your eyes🤓! This is the Formidable Photovoltaic offer, you have a 3 kW photovoltaic system for €65/month for 120 months. And if you add Formidabile Luce you get a €100 annual bonus on your bill for 2 years. Only until December 31st. 👍\nhttps://t.co/k09D1GZiu4 https://t.co/R8LPwV3HQW", "3553": "You'll be left speechless!😦 It's the FORMIDABLE TRIO offer. If you choose Formidabile Luce, Gas e Fibra from Enel Energia you have up to €400 annual bonus on your bill for 2 years. Only until December 31st. https://t.co/k09D1GZiu4 https://t.co/nzuKcGnQM4", "3554": "No wonder! With the Formidabile Fotovoltaico offer, you have a 3 kW photovoltaic system for €65/month for 120 months. 🌞 And if you add Formidabile Luce for you €100 annual bonus on your bill for 2 years. Only until December 31st. 👉 Find out more at https://t.co/k09D1GZiu4 https://t.co/MbrzFcjCY8", "3555": "Have you ever thought that an offer on electric mobility 🚘 could surprise you? Enel's Formidable Dual Mobility will take care of it 👍 with Light, Waybox and free up to 10,000 km. Only until December 31st. Find out more at https://t.co/k09D1GZiu4 #TuttoEnelFormidabile https://t.co/2m48tyvodd", "3556": "🎄Participate in the competition “A sustainable Christmas with ENELPREMIA WOW!” and try to win one of the Dyson products up for grabs every day.\nDownload the app 👉 https://t.co/BDhTODrOHt https://t.co/dCy1i1SFpV", "3557": "A new browsing experience and many new features to manage your supplies, discover our best offers, receive assistance, participate in the ENELPREMIA WOW! loyalty program and so on.\nDownload or update it now📱\nhttps://t.co/PdE0tjDGUn https://t.co/2XTJ8DjYFH", "3558": "Everyone has questions, but now so many answers!\nThe #SpazioDelleAnswers is born, where every week we will give you one to help you better understand the world of energy.\nWhat you can do with our App❓Find out in our first video.👇\nhttps://t.co/PdE0tjDGUn https://t.co/rIvLaEtqoa", "3559": "Can't you help but be amazed😲? I believe it, it's a FORmidable trio 👍.\nIf you choose Formidabile Luce, Gas e Fibra from Enel you have up to €400 annual bonus on your bill for 2 years. Only until December 31st.\nFind out more at https://t.co/k09D1GZQjC https://t.co/krCHUk1yfF", "3560": "You often wonder how to best use energy❓\nThe #SpazioDelleRisponse has many solutions for you, including for this question. Watch the video and improve your daily drinking habits. 💡\n👉 https://t.co/RtulO73Sqt https://t.co/4uArOdNKcd", "3561": "🎄Participate in the competition “A sustainable Christmas with ENELPREMIA WOW!” and try to win one of the Dyson products up for grabs every day.\nDownload the app 👉 https://t.co/BDhTODrOHt https://t.co/UOmJO8JZvx", "3562": "Get ready for the end of the Greater Protection Service. Switching to the Free Market will be very simple with Enel Energia. 👉 https://t.co/iRsGbjfum2\nThe end of the Greater Protection Service for electricity provided for non-vulnerable customers is currently set for 01/07/24. https://t.co/SynWqSGF8b", "3563": "🤩 Experience a special Christmas with #ENELPREMIAWOW! Choose between #infinity+, #go4alltouroperator and #Feltrinelli. Download the app 👉https://t.co/t8htIUaKhP https://t.co/XcVkyxSWBl", "3564": "2023 was a year full of energy, let's relive the best moments together!\nSee you again in 2024. ✨ https://t.co/9I9Nvtg6vd", "3736": "@nomadycat Our local office is best equipped to answer questions about product availability in your local market. You can find contact information at this link: https://t.co/1C7CfKUHhE\n\nPlease note that our offices are not open in the evenings or on weekends.", "3746": "@ladylestrangge Hello - Please contact our team in Brazil to see if there are any patient assistance programs available. You will find all available contact information for this team here: https://t.co/ef56pSsl3N", "3758": "@shex47171391 Hi, We don't have a Whatsapp number. If you let me know what country you are in, I may be able to provide a link to contact information for our local office, where they can discuss your concerns.\n\n-Crystal", "3763": "@shex47171391 We have recently changed our business model in Iraq. From now on, we aim to provide GSK medicines and vaccines directly to the Ministry of Health, or in partnership with transnational organizations. You will need to speak to the Ministry of Health regarding medicines.", "3768": "@flyriviera In the interest of patient safety, GSK would like more information about the experience you reported. Contact GSK at https://t.co/Me3riY9QER", "3852": "@gabborosas Our local office in Mexico is best equipped to answer questions about product availability in your local market: https://t.co/fUKrhsGfzX\n\nPlease note that our offices are not open at night or on weekends.", "3906": "@iarumk Hello - Haleon takes over GSK's consumer healthcare division. The product falls into that category. For anything specific about Haleon, please contact them directly via their social media: @Haleon or their website, https://t.co/nVW29kMR2D", "4098": "@ninnuliinu79 Haleon took over GSK's Consumer Healthcare division. The product belongs to this category. If you have something specific about Haleon, please contact them directly through their social networks or their website, https://t.co/nVW29kMR2D", "4111": "@halisulatif Please contact our local office in Turkey and they will assist you. You can find all available contact information for this team using this link: https://t.co/2XiCCsqTHF\n\nPlease note that our offices are not open in the evenings or on weekends.", "4112": "@matthew_kda Please contact our local office in Turkey and they will assist you. You can find all available contact information for this team using this link: https://t.co/2XiCCsqTHF\n\nPlease note that our offices are not open in the evenings or on weekends.", "4150": "@skett2605 Hello - The link I gave was for our office in Turkey. You can use this link to find all contact information for our teams worldwide: https://t.co/Ka7zRsMaVr", "4398": "@delvaldes Nice combo 👌", "4408": "@dominos There is no 'i' in pzza", "4500": "@F1 @SChecoPerez Here's to Sergio 'The Mexican Way' Pérez! 🍻🎊", "4506": "@godmitzu Jihyo, best beer enthusiast 👏", "4595": "@AshBandicoot17 Now thís is a mood 💅", "4802": "@ChampionsLeague Two UEFA Champions League winners 🙌", "4806": "@ChampionsLeague Griezmann is on fire 🔥", "4850": "@Amy_rights Zero alcohol. 100% smoothness 😉", "4870": "@F1 Fabulous 🤩", "4920": "𝙍𝙀𝙉𝙀𝙒𝘼𝘽𝙇𝙀𝙎, 𝙉𝘼𝙏𝙐𝙍𝘼𝙇𝙇𝙔\n\n[̲̅-] Support a sustainable 🌍\n[̲̅-] Stop #climatechange ✋🏼\n[̲̅-] End #fossil fuels ⚠️\n\nNature + clean energy = a perfect combination for everyone's benefit 🍃\n\n#WorldWildlifeDay #WWD2023 #ForNature https://t.co/6JVvCJa2Nz", "5554": "Mr. @turhan_mumcu @LeasePlanNL, can we ask you to send us your phone number and e-mail address via private message so that our quality team can review the issue you have submitted and contact you? We wish you a nice day.", "5558": "@bizimFikri Hello @bizimFikri, we have forwarded your experience to our Quality Team. We would like to state that we will contact you after detailed investigations on the issue are carried out. We wish you a nice day.", "5694": "@doylxv We're coming to the rescue! Order the missing parts for free at https://t.co/g7WEc881N8 and we will send them to you as quickly as possible. 😊", "5725": "@Fr_Pellegrin This is storage box 791-1, released in 1972! 🧰", "5752": "@fbillys Mhm, mhm 🥰", "5788": "@Sebat That should work again. If it still doesn't work, please send us a DM and we'll take care of it. 🙂", "5884": "@LoftheStars Ninjas unite! 🐉✨", "5904": "@ciamaulex We are happy to know that we could help. If you would like to join our team, keep an eye on https://t.co/BsjG1eIt5b to check out open positions. Good luck! 🍀😊", "5953": "@Machtain We have recently received a large number of orders and we are doing our best to ship your package as soon as possible! You should receive a shipping email very soon, thank you for your patience. 📦📧", "6148": "@chessasaur LEGO Feng Shui! 🧱💛", "6501": "@MattJM211 📈 LEGO Shadow\n📉 LEGO Eggman", "6824": "Turkey Chili https://t.co/zrIHpOSwqt", "7019": "@TSileve Otterly adorable. 🦦", "7056": "@OMS_Benji_32 Marvel-ous choice! 🕸️", "7211": "@renanbarco A masterpiece 🤌", "7303": "Interested in a career in Logistics and Services?\n\nOur LATAM leaders discuss what it means to work in Logistics and Services at Maersk.\n\n👉🏼 Click below to watch the video: https://t.co/63578hRvhi\n\n#maersk #logistics #services #work https://t.co/C2xpQNVi1x", "7307": "Are you ready to score goals that make a difference?⚽\nFor every goal scored in all @dhf_haandbold matches on January 28 and 29, #Maersk and A.P. donate. Møller Foundation NOK 50 for this year's @DKIndsamling 🤝\nEvery goal counts🎯 Together we can make a difference for the world's most vulnerable children🌍 https://t.co/2yf37BqdTS", "7773": "@GurkanDevrim @gemitrafik @GemiJurnali @ertugrulbirel @MarineTraffic Great picture💙", "7840": "How does a pair of sneakers that are produced on the other side of the world reach your front door?👟\n\nInfluencer Maria Jarjis has set out to investigate this 🔎Come behind the scenes and see how #Maersk transports goods around the world🌍\nSee more here: https://t.co/IFiqWw9VC0 https://t.co/FD6B4CVpyI", "8275": "@thrustforever We're sorry you think that way ☹️ We are truly authentic and committed ✊ We are the only Swiss chocolate manufacturer that exclusively uses IP-Suisse certified milk from local farms 🥛 🍫", "8286": "@socialprener For proper dissolution of your cup of NIDO FortiGrowth, make sure the spoon used is completely dry before taking your NIDO® powder. When preparing, make sure to always add the milk powder to the water, and not the other way around.", "8378": "@NielsFuglsang Dear Niels. There are currently no approved alternatives to animal testing. We actively participate in finding alternatives, but they must never compromise patient safety.\nWe are happy to enter into an open dialogue &amp; our public affairs department will reach out to you so we can continue it directly.", "8379": "@sherlockandmum @DRNyheder @rickygervais We are obliged to test for possible side effects in animals before the medicine can be given to humans. Right now, there are no approved alternatives to these tests. We work actively to reduce the use of laboratory animals. You can read more here: https://t.co/awY6JdlbTF", "8445": "We strongly deny that there is any connection between the contact with Bolette Friderichsen and our or her participation in the media. We reached out because we want to be in dialogue, also with those who have different views than ourselves! https://t.co/Cb1LG8Ig9x", "8447": "If you are interested in our explanation of the contact with Bolette Friderichsen and other facts about our performance in Deadline, you can find more information and the mentioned contract here: https://t.co/bphOZUybhZ", "8465": "#PRESS Novo Nordisk invests DKK 15.9 bn in expansion of manufacturing facilities in Hillerød, Denmark", "8507": "@YaelBassan Hi Yael\nI'm sorry to hear about this issue and will try to help. Can you send me an email at digital@novonordisk.com? Then I try to find the right employee with whom you have been in dialogue.\nMany greetings\nBenedikte, Novo Nordisk", "8508": "@YaelBassan Hi Yael. I'm glad the problem was solved but sorry it took so long. Hope everything is as it should be now. We follow up internally. have a nice Sunday", "8512": "@YaelBassan Not really - I'll follow up again. Sorry that the reminder has not been paid 😞", "8569": "#PRESS: Novo Nordisk to acquire molecule for uncontrolled hypertension from KBP Biosciences", "8588": "@GaardThomsen Hi Marianne, we are sorry you are experiencing problems. We are in dialogue with the municipality about a new local plan that could enable a new car park.\n\nWith best regards\nSteffi\nNovo Nordisk", "8606": "#PRESS: Novo Nordisk invests more than 42 billion Danish kroner in expansion of manufacturing facilities in Kalundborg, Denmark", "8633": "@techdronemedia Dear Henrik,\nFor some positions, we receive many applications from relevant candidates, which may be the reason why you have unfortunately not been invited for an interview.\nI would recommend that you keep looking for positions. \n\nThe best greetings,\nClara, Novo Nordisk", "8729": "@SvejgaardYeah Hey! Yes, unfortunately there are fake e-mails and text messages circulating at the moment, where someone pretends to be Ørsted and tries to get you to hand over your personal bank details. Finally, you may NOT click on links or provide personal information. Best regards, Julie.", "8738": "A new era in green shipping!\nToday, we broke ground on Europe’s largest e-methanol project, FlagshipONE, in Örnsköldsvik in Northern Sweden 🙌\n\nDiscover more 👉 https://t.co/PKqlXkWZ2M https://t.co/bIy6FF4Vgu", "8846": "@Bidakkamidem Hello, how can we help you?", "8848": "@Bidakkamidem Can we know which product you contacted?", "8853": "@mstfbyndr55 Hello, we can direct you to our service regarding the issue. Can you share city and district information with us?", "8875": "@capetinys We're sorry about that! We have the Oneblade blade recurrence plan, which is a good opportunity to always buy the blade at a more affordable price. Find out more at the link: https://t.co/WWxQjSDuZV", "8879": "@mehmet_snlr Hello, how can we help you?", "8892": "@gly_dmry Hello, we kindly ask you to contact us via DM so that we can assist you. With love.", "8900": "@dlfraile Hello David! Thanks for your interest in our products. For more information, please do not hesitate to contact us by private message on Facebook, Instagram or Twitter. If you wish, you can also contact us through our official website. \n1/2 https://t.co/7VMKPAMQbA", "8901": "@dlfraile We look forward to your message, see you soon! \nMary \n\n2/2", "8907": "@uAburakkk Hello Mr. Burak, can we know which product you are contacting us for?", "8916": "@edwardhotchkin1 Best! Thank you for your message. We would like to help you as best as possible.\nMy colleagues and I would love to see what we can do for you, so please feel free to contact us. You can do this by sending a private message via Facebook or Twitter. https://t.co/7VMKPAMQbA", "8918": "@Cenk_Vakti Hello, we are passing on your feedback on the subject. For your information.", "8929": "@DokterTeunis This can be done by sending a private message via Facebook or Twitter, but also by telephone or via chat.\nKind regards,\nMary Phillips Team \n\n2/2 https://t.co/7VMKPAMQbA", "8955": "@omrgrd1 Hello, thank you for your comment.\nWe are sorry that you were not satisfied with our services.\nWe have a number of repair centers available for you in Turkey which you can find here: https://t.co/AQFN6Kn5tR .", "8964": "@fatute123 Hello Ms. Tuğba, we kindly ask you to share the service information with us when you send the product to the service. With love.", "8965": "@fatute123 Thank you for reaching out. I hope we were able to help you. You can click on this link to evaluate the service you receive from us: https://t.co/hur6xlwMtL. Thanks!", "8979": "@Spiritiis Dear Dido\n\nI thank you for your message.\nIn this case, we advise you to contact our technical team. \nOur technical support experts can help you by calling us on (+33) 1 5732 4050\nMonday - Friday: 8:00 a.m. - 7:00 p.m.\nSaturday: 9:00 a.m. - 4:00 p.m.", "8980": "@Stephane51 Dear Steph@Reims\n\nI thank you for your message.\nTo continue your case, I would like to collect your TV data.\nAre you willing to move to a private conversation?\n\nBest regards, \nPhilips TV Consumer Care", "8988": "@mehmet_snlr Hello, we would like you to contact us via DM so that we can assist you. Best regards.", "9000": "@nurenschwiizer You can read it via the following link: https://t.co/8bKcqaey79 \nIf you have any further questions, please do not hesitate to send us a private message.", "9002": "@InktZwarte Best regards, \nPhilips TV Customer Service \n\nThis message has been written with a translation tool. It may contain some inaccuracies.", "9006": "@aricyaoliveira Hello, how are you? :)\n\nTo better assist you, please contact us with the exact model of your product and date of purchase?", "9007": "@aricyaoliveira Please send us a DM with a photo of the purchase invoice and the product.", "9011": "@KogojSlavko Our technical support experts can help you by calling us at (+386) 18888312\n\nGreetings\nPhilips TV Consumer Care", "9025": "@LHEUREU03821797 Hello,\nThank you for your post.\n\nTo match your toaster to your coffee machine, we recommend the reference HD2581/70.\n\nWe remain at your disposal.\n\nBeautiful day.\n\nSincerely,\nThe Philips team", "9026": "@iversonfalopa Hello, we are very sorry for the inconvenience. Could you contact us by private message so we can assist you? Thank you very much in advance.", "9032": "@edapltt Hello, can we know which product you are contacting us for?", "9034": "@SCCP_Eduardo Dear Eduardo, we are very sorry for the inconvenience. We would like to analyze your case further so we can help you. Can you send us a private message so we can contact you?", "9036": "@LHEUREU03821797 Hello\n\nUnfortunately, we do not have information on future product availability on our Philips website.\nWe are sorry for the inconvenience caused.\n\nSincerely,\nThe Philips team", "9040": "@BademBade4 Hello, you can access the accessories online at https://t.co/Md7LWdsqoV.", "9044": "@sirinyerhipodrm Hello, thank you for your comment.\nWe're sorry you're experiencing some issues with your TV.\nPlease contact us via direct message. We'd like to help you.", "9046": "@brksbrks2 We kindly request you to get support from our service regarding the issue.", "9050": "@KaanBalci_7 Hello, we kindly ask you to contact us via DM so that we can assist you with the issue. With love.", "9051": "@antiortoreksikk Hello, we kindly ask you to contact us via DM so that we can assist you. With love.", "9053": "@hermafrederika I understand that you find this annoying. I will pass on additional notification to our team. However, we do have to rely on PostNL to solve this problem and we will have to wait for that answer.", "9055": "@elifasfabricio We saw your message on Instagram and responded there.", "9073": "@null0set Currently, the Philips company has already partially changed production lines and supply chains at the global level, so new models of hair care categories for women and men are already arriving in Ukraine without these certificates in the packaging.", "9076": "@Susana_Pedreira We are very sorry about your last experience with our customer service. We have already sent you a private message to find a solution to the problem you are having. We hope you can see it.", "9081": "@grevvarr Hello, we are sorry about your experience. We share your feedback on the issue. With love.", "9082": "@mervegulfem Thank you for reaching us. I hope we were able to help you. You can click on this link to evaluate the service you received from us: https://t.co/52JUXngNaA. Thanks!", "9087": "@AllanJohnMacedo Allan, what is the model of your product and what happened?", "9106": "@Astor_White Can you send us a private message so we can look for a solution together.", "9110": "@null0set At the production stage, it is not known to which market the product will be sent, so it is completed with all the necessary documents for import to the likely sales markets. Ukrainian legislation does not prohibit placing in the packaging the documentation required for sale in other markets.", "9111": "@elifasfabricio We are happy to hear that everything went well with the service. We want to continue this partnership for a long time and it is great to know that you were happy and satisfied!\nIf you need anything, feel free to contact us!", "9112": "@BohneDen If you have any further questions or comments, please do not hesitate to contact us, we will be happy to help you.", "9124": "@AhmetOztr15 Hello, we are sorry about your experience. Our authorized services provide support on this issue. With love.", "9137": "@agozubek We will be in contact with you regarding the process. With love.", "9142": "@man_sunglasses Hahahahaha as the saying goes, practice makes perfect 👌 The main thing is that you have clean and shiny teeth 🦷", "9143": "@cantrophies Hello, the relevant product is not imported by Turkish Philips. For this reason we cannot help. You can access product information from retail stores and reliable e-commerce sites. With love.", "9144": "@muratsenturk346 Dear Murat\n\nThanks for your message.\nHave you had a bad experience with our TV?\nIf so, could you share your comments with us via private message?\n\nKind regards,\nPhilips TV Consumer Care", "9153": "@al3jandr0uh If the problem occurs again, please let us know.", "9157": "@deryaa8484 Hello April.\nThank you for your comment.\nWe are sorry that your television is not working properly. Please send us a direct message. We would like to help you solve this problem.\n\nKind regards, \nPhilips TV Consumer Services", "9158": "@deryaa8484 This message was written using a translation tool. There may be some inaccuracies in it.", "9162": "@thersinayvaz Thank you for reaching us. I hope we were able to help you. You can click on this link to evaluate the service you receive from us: https://t.co/L4CELdthrE. Thanks!", "9166": "@BaiuBaer Thanks for the message. So that I can help you, could you please contact us via private message so that we can take a closer look at your issue? https://t.co/7VMKPAMQbA", "9170": "@sevgiyillmaz Hello, we kindly ask you to contact us via DM so that we can assist you. With love.", "9171": "@shushanna47 Clearing the Bluetooth cache on the mobile device may also resolve connection issues.\nNote: Sonicare 9900 Prestige toothbrush users may also be able to resolve connection issues by resetting the handle.", "9180": "@AKGKERO This is not a fault of the TV.\nThis is within specifications.", "9188": "@JaanisAlksnis Please contact us privately so we can help resolve the issue. Thank you!\nhttps://t.co/4OQlejDTH5", "9202": "@lmorono Good morning! What model do you have?", "9209": "@Kerem_A78 Hello, we ask you to shop from reliable sellers. We shared the issue with the authorized unit. Necessary actions will be taken. With love.", "9212": "@modbr1967 Good morning Marian, has the problem with your vacuum cleaner been resolved? I hope so! If you still need help, please send us a message via the link below. Then my colleagues and I can see how we can help you. :) Greetings, Carmen. https://t.co/7VMKPAMQbA", "9222": "@vZelfde Hi Richard, thank you for sharing your experience. How annoying to hear that this all turned out this way, that is of course not the intention. I would like to look at the situation with you. By the way, do I understand correctly that your device is back with our team?", "9237": "@JuzzTv Hello, we kindly ask you to contact us via DM so that we can assist you with the issue. Best regards.", "9240": "@jwmannen Thanks for your response. For questions and information about lighting, please contact us via the link below. https://t.co/Jj0sfYScG0", "9243": "@LvntTmr There are several different models available in the same series. Shows the operating time for one of the models in the series.", "9256": "@AciSerkan Hello, can you share the problem you are experiencing with us?", "9257": "@AciSerkan Hello Mr. Serkan, we would like you to contact us via DM so that we can discuss the issue in detail.", "9259": "@senagiv Hello, how can we help you?", "9261": "@AciSerkan If you can share the photo of the title with us, we can help you.", "9265": "@AciSerkan Mr. Serkan, we cannot provide free replacement, but as we stated, you can obtain the part at a discounted price.", "9273": "@beelen_stephan Hello Stephan, Thanks for your response. Sorry to hear that you are having problems with the Hue lamp. You can contact us for information and help via the link below. https://t.co/CTTvsAyEAA", "9290": "@bluezinn_ how can we help you?", "9291": "@bluezinn_ can answer all your questions and understand what happened by talking to our team at the Philips Store at: (11) 3474-8022, or if you prefer by sending an email via the link: https://t.co/YLRZLDGugq", "9292": "@bluezinn_ here we only support social networks, we do not have access to the information and procedures of the Store, which has its own Customer Service Center.", "9297": "@lnxcz Hi Pavel\n\nThank you for your message.\nUnfortunately, Philips does not have technical support for projectors on social media.\nIn this case, I recommend you contact our technical team. \nOur technical support experts can help you by phone", "9298": "@Geek_Gen_France Thank you for this exchange. I hope I was able to help you. If you still have 30 seconds to give me, please click on this link: https://t.co/eiPFEKhIyk", "9302": "@enesbilgin61 Hello, when you bring the product into full contact with heavily flowing water, a malfunction may occur if water leaks onto the main board of the device. We forward your feedback to the authorized unit. We wish you a nice day.", "9317": "@PedroLebens Hello Pedro, We are sorry to hear that the discount code does not work. We would like to help your wife buy a beard trimmer for you. Would you mind sending us a private message so we can look at the situation together?", "9324": "@1__llllllll Hello, how can we help you?", "9325": "@1__llllllll Hello, we kindly ask you to contact us via DM so that we can assist you. With love.", "9329": "@insan_insan752 Hello, we kindly ask you to contact us via DM so that we can assist you with the issue. With love.", "9338": "@pioupioutwittou Hello, thank you for your opinion. It was the goal of our advertising to deliver the content in a funny way.", "9344": "@ichbrauchehiIfe Since we as a company take the connection with the quality, safety or effectiveness of our products very seriously, we feel it is very important that you contact us via private message! Thank you very much", "9352": "@ErkalFusun Hello, you can contact us via DM so that we can assist you. With love.", "9353": "@GorterNicole That is certainly possible, Nicole! To illustrate, here is a recipe for a chocolate cake (https://t.co/mVsKyST41L) and a zucchini lasagna (https://t.co/NhOnDMH32R), both prepared in an Airfryer. You know where to find us if you have any questions! Greetings, Otto.", "9354": "@fattmos Hello, we kindly ask you to contact us via DM so that we can assist you. With love.", "9369": "@wallaceteix To improve shaving performance, we suggest using it with shaving foam or wet shaving and swiping slowly on small areas of the face. This way the blade will cut the thread more precisely.\nOneblade models have the same performance.", "9370": "@wallaceteix The difference is in the number of accessories and charging time for each one.", "9371": "@war666beast We hope that this information will be useful to you.", "9376": "@ErkalFusun Hello, your process regarding the issue continues. Once completed, we will get back to you. With love.", "9391": "@42_44 Hello, we would like you to contact us via DM so that we can assist you. Best regards.", "9410": "@wallsoflower Good morning\n\nThanks for your message.\nHow can I help you?\n\nBest regards, \nPhilips TV Consumer Care", "9422": "@cetnbudakk Hello Mr. Çetin, we would like to help you on this issue. You can contact us via DM. With love.", "9423": "@cetnbudakk Mr. Çetin, we kindly request you to contact us via DM with the product invoice.", "9424": "@mecburbodur Hello, you can access the original parts of our products from the link https://t.co/XO18WWbuyH and our authorized services. In accordance with Competition Law and Philips General Business Principles, each retailer is free to determine the resale price they deem appropriate.", "9543": "@PramanikKuntal Bravo 🥳", "9590": "@ANiissalo Bravo 👏", "9596": "We're providing support, including immediate donations to the @RedCrescent and @Refugees. Geçmiş Olsun. https://t.co/16gTTGz3YX", "9598": "@marcobuescher Well done! 🙌", "9629": "@AmilcarDX Well done 👏", "9660": "ICYMI 👇 https://t.co/AjaV1ur7fe", "9666": "@Vinay_kumawat Bravo 👏", "9682": "@jaiestudillo Bravo 👏", "9702": "@SAPPartnerEdge Bravo 🥳", "9824": "@FrankGeisler1 Bravo 👏", "9878": "@ilyass_500 ABAPsaurus Rex! 🦖", "10117": "@AufarAditya Major congrats ✈️", "11445": "@HannesHoracek @gandi80 The network situation is essential for this: on the one hand, bottlenecks within Germany and a lack of transmission lines within Austria. @apg_at is working intensively on the #Salzburg line, but lengthy approval procedures have cost a lot of time.", "11446": "CEO Strugl: \"We have to be careful that society does not fall apart in this crisis.\" https://t.co/BqJToVHhvw", "11447": "Spot market prices are highly volatile markets. Relying on them would be extremely risky. That's why electricity contracts are usually concluded a year or more in advance. Daily prices have little significance for the general price level. @cl__an @naapi @evn", "11448": "@LionHirth The examples of France and Finland are not particularly suitable for promoting trust and confidence in a rapid and cost-effective contribution of nuclear energy to the #energytransition.", "11449": "@chri_gru We would like to clarify: the transmission capacity at the German-Austrian border is not the problem, but the bottleneck in the German network.", "11450": "@Christi60023283 Our private customer company also buys electricity from the producer at market prices. Anything else could be interpreted as abuse and distortion of competition.", "11451": "@Christi60023283 While procurement for existing customers takes place over the long term, price movements can be reacted to more quickly in the new customer segment. We are reflecting the wholesale prices, which are currently falling again from a very high level.", "11452": "@Marc_Elsberg @sat1 Auge, @apg_at : there will be mail again.", "11453": "There is no turning back in the #energytransition. Here are a few impressions of the dismantling of our coal-fired power plant block in Dürnrohr.\nhttps://t.co/PhYUIaTTpB", "11454": "@MarcusWadsak @APAOTS Not to forget: the famous Bernhard Weingartner as a physics expert.", "11455": "@Energielix There are large pumped storage facilities in Austria for the control market. For primary control we have the \"Blue Battery\" at the Wallsee-Mitterkirchen power plant.\nhttps://t.co/ZnqNJzL3Dy", "11456": "@Energielix At least through ours 😀 (map at the bottom of the page)\nhttps://t.co/YRkymmJMeE", "11457": "@Energielix We don't want to hide anything: @OeEnergie has an overview of the whole of Austria.\nhttps://t.co/i3fzvg2BFP", "11458": "@OeEnergie @Energielix Thanks. You can rely on your gang.😉", "11459": "Yesterday in Berlin, CEO Strugl discussed with @NinaScheer_SPD @MiKellner and Felix Menzel, Mayor of the municipality of Milower Land/Brandenburg. “State, federal government or Europe - what is needed for the expansion of renewables?”\n\nMany thanks to @AustriainDE\n\nhttps://t.co/dAN7sIzxcO", "11460": "@marcfriedrich7 All questions that can be answered. We just need a social consensus: There is no alternative to switching to alternative energies. #MissionV", "11462": "@abbyleetee @4ArB2 @chorherr @vpetritsch @chri_gru @apg_at Conversely, we have to ask whether climate change is not a greater threat to our living space than 90 km² of photovoltaic open space. \nIf this debate is held in every municipality every time before every rezoning decision is made, a lot of time is lost.", "11463": "@abbyleetee It doesn't always have to be extreme. Where there is truly untouched nature in Austria, it is usually unattractive to develop renewables anyway. But it won't work without balancing interests.", "11464": "@abbyleetee @4ArB2 @chorherr @vpetritsch @chri_gru @apg_at You're welcome. All electricity producers would welcome appropriate building and spatial planning.", "11465": "@abbyleetee Rejecting interventions as such per se is also an extreme position. We live in a highly modified cultural landscape. Power plants, especially near water, give us the opportunity to correct past interventions.\n1 example: https://t.co/J2UhwoBaHy", "11466": "@HolzheuStefan We have been dealing with this topic for decades, as a look at our cartoon archive proves. https://t.co/jQ7JrYIF51", "11467": "@fatmike182 @klimarecht Wording: \"If the electricity volumes are not actually purchased on the EEX,\nbut generated within the group, an index that uses the ÖSPI as a basis for calculation\nis not appropriate in order to maintain the subjective equivalence of the contract.\"", "11468": "@klimarecht @chri_gru That is already the case. However, VERBUND Hydro Power GmbH is only 80% owned by VERBUND AG. The rest is held by various national companies. https://t.co/CZv7A4OEGU", "11469": "@klimarecht @HannesHoracek @chri_gru That has been the retailer's business model since the 2000s and led to a tough price war. The market distortion since 2021 has greatly reduced that.\nhttps://t.co/bjhy5Gnh1V", "11470": "@harald_friebe @klimarecht Every market system has its problems with external shocks. But if demand increases and expansion does not keep up, it is not the lack of a market that is causing prices to rise. The answer must be: accelerate the expansion of renewable energy.", "11471": "@Harald_Friebe @klimarecht Wholesale electricity prices have already risen sharply since the beginning of the third quarter of 2021. \nhttps://t.co/igEhED1TmY", "11472": "\"Energizing Chemistry\": Exciting panel at @FCIO_ChemInd with @monikaturyna @ceos4future and @mi_spiekermann #fff on the question of energy transformation for Austria's chemical industry. https://t.co/96eWFmKN7Z", "11473": "@Harald_Friebe @klimarecht If that's what you mean: The collapse in French nuclear energy production due to technical and climate-related problems was not foreseeable and hardly factored in.", "11474": "Support for those particularly badly affected: targeted and unbureaucratic with the VERBUND hardship fund.\n\nhttps://t.co/exI3w0SU2p", "11475": "In the current @profilonline, there is a reference to one of our most beautiful renaturation projects on the main topic of #water: the #fish migration aid 🐟 at the Altenwörth Danube power plant, a @LIFEprogramme partner project. \nMore: https://t.co/1AujDigJfR https://t.co/sLTBEUR54V", "11476": "@monikaturyna If the e-economy is not covered in detail, we can recommend additional literature. https://t.co/nu4ZeLsVpO", "11477": "Regarding yesterday's #zib2 about electricity and the market: the white elephant in the room is the fact that Austria has long been dependent on electricity imports. \nhttps://t.co/t83Jx2yvrf", "11478": "@citybergler @IngridFuhrmann3 The legal obligation to contribute to security of supply exists for the electricity network operators - on their instructions the producers can sometimes be obliged to feed in or switch off electricity to ensure grid stability.", "11479": "@rr120_80 One from the list is enough. \nhttps://t.co/NHmDO3Ztb1 https://t.co/2mHT1E6T3G", "11482": "Ok. That was a success. https://t.co/BpcW5W1BGg", "11483": "@ralphy_a3 We would like to invest - where we are allowed to, we do so. However, the lack of zoning and long approval procedures are slowing us down massively.\nhttps://t.co/wGBWw9CPJz", "11484": "@OeEnergie The threat to biodiversity from global warming is already alarmingly advanced.\nhttps://t.co/vnPfFSayRZ", "11485": "@altagrantla Gladly. We are diversifying technically and geographically in line with our strategy.\nhttps://t.co/FYajBNWmPY", "11486": "Tomorrow we will present our annual report for 2022! #BilanzPK\n🕘Start: 09:00 CET\n🎥 Livestream https://t.co/KU1KskmrNL", "11487": "Our result for the 2022 financial year: EBITDA +100.2% to €3,160.7 million. Consolidated profit increased by 96.6% to €1,717.0 million \n\nDetails here in our press release: \nhttps://t.co/KSkDNgOdra", "11488": "If you have any questions about the 2022 annual report, we will be available from 9:00 a.m. #BilanzPK\n🎥 Livestream https://t.co/KU1KskmrNL https://t.co/fwakhdC2L1", "11489": "What will we do to invest our way out of this crisis? Over the next 10 years, VERBUND plans to invest around €15 billion in expanding the renewable energy system. CEO Strugl: \"What we need is legal certainty.\" #BilanzPK https://t.co/34EnGjCbar", "11490": "Our investment plan for 2023-2025: approx. €4.6 billion in energy systems – generation plants, networks and storage, such as Limberg 3 #BilanzPK https://t.co/XOffb49IDY", "11491": "CFO Kollmann outlines the challenge of the last year: billions of euros in liquidity had to be held in reserve to compensate for volatile prices, while at the same time investments had to be increased by 50%. #BilanzPK https://t.co/xrWuLpVNHd", "11492": "The dry year of 2022 resulted in a further decline in the generation of electricity from hydropower: 14% below the long-term average. \nFor 2023, a change of 1% (hydropower generation) means: +/- €36.4 million #BilanzPK https://t.co/O4gwAFccDk", "11493": "Wind and photovoltaics currently account for a total of 4% of VERBUND's generation portfolio, and this share is to be increased to 20% to 25% by 2030. #BilanzPK https://t.co/VEocPJeEPd", "11494": "@marterbauerm We add where the surpluses will go: €4.6 billion in investments in 2023-2025 and additionally in the distribution to our owners. https://t.co/JfWNXgLZKV", "11495": "@thomaseisenhuth @verbund @michaelstrugl @magnusbrunner \nCEO Strugl on the question at today's #balancesheetpress: VERBUND has no plans for a new power plant on the Danube.", "11496": "@unremovedb The grid expansion is not being held back by a lack of will or capital, but by long approval procedures. (The expansion of renewables is very similar, by the way.)", "11497": "@patrick_erli @WienEnergie We don't complain. We invest.\nhttps://t.co/wGBWw9CPJz", "11498": "@christophbrenn1 @bernhardecker @evadichand VERBUND is largely publicly owned. That is where the profits also flow. https://t.co/uqnEVTUMeE", "11499": "@unremovedb Because it is the job of a corporation to trade at market prices. We cannot influence the price formation of electricity. \nRepayment takes place in the form of an increased distribution of profits, which mainly goes to the public sector. https://t.co/jlpbM6cHWg", "11500": "@marterbauerm Can we agree on the possibility of rapidly expanding supply? This is much more difficult from a legal perspective, but it is a permanent solution to the imbalance between electricity demand and the generation gap.", "11501": "@wmoitzi ... and give these record profits back. Mostly to the public owners. https://t.co/NFVwoAstfr", "11502": "@sturn_j @PeterRippl There is already a proposal for the AG's general meeting this year.\nhttps://t.co/iAoIa2emGm", "11503": "@sturn_j @PeterRippl You can watch today's entire press conference here: #BilanzPK\nhttps://t.co/KU1KskmrNL", "11504": "@heiffler We add: if our profits are not reinvested, they will be distributed. The main beneficiary: the public sector. https://t.co/8iphAg8xfZ", "11505": "@arbeiterkammer for the sake of completeness: profits are distributed where they are not reinvested. The main beneficiary: the public sector. https://t.co/oSaWMPx1PX", "11507": "@thapexarchive This bag belongs largely to the public sector. The gap between production and consumption inevitably leads to rising prices (with or without a gas crisis). The only way we can get out of this crisis is to invest our way out. https://t.co/cBqqofXtEz", "11508": "@heiffler Yes, there are households that have been hit hard by the energy crisis. Anyone who has problems with their bills can also get immediate help from us. \nhttps://t.co/NHmDO4010z", "11509": "@bastiboti To make the debate more objective: the price increase resulted in a sharp increase in demand for gas, then the war in Ukraine came along. The gap in production and the dependence on imports subsequently led to price fluctuations. \nhttps://t.co/UmdDbRlgl0", "11510": "@lebensschueler Yes, there are households that have been hit hard. We have created an aid program for these hardship cases.\nhttps://t.co/NHmDO4010z", "11511": "@schulrategger @werni007 No, that's exactly why. We want to distribute this profit where we don't reinvest. The public sector will primarily benefit from it. https://t.co/mwb2ReQ0F0", "11512": "@bastiboti Demand has increased, the supply of electricity has remained the same (in the hydropower sector it even fell by 14% in 2022). This means that everyone wants electricity and is willing to pay more for it.", "11513": "@SchulratEgger @Werni007 It's true: many households have been hit hard by the energy crisis. We offer emergency aid for these cases.\nhttps://t.co/NHmDO4010z", "11514": "@lang_psy Unfortunately, this is based on a mistake. There is too little electricity from renewable energy on the market and too much fossil import. The increased demand after 2021 will be exacerbated by the war in Ukraine. The price is rising due to the gap.\nhttps://t.co/UmdDbRlgl0", "11515": "@martinsadleder @BastibotI We simply don't have enough electricity for everyone, at any time. Therefore, the electricity is sold to the highest bidder at the price determined by supply and demand. Those who produce cheaper than this price make a profit. 1/", "11516": "@martinsadleder @BastibotI But only until other market participants expand their production and also offer it at these costs. That is competition. 2/", "11517": "@martinsadleder @BastibotI We have a gap in the electricity market between domestic renewable energy and demand. This has to be covered with imported electricity or gas power - at a much higher price. This stimulates the market to invest more in renewables and dampens the price. 3/3", "11518": "@martinsadleder @BastibotI The anger is understandable, which is why we are trying to clear things up here. Austria has been dependent on electricity imports for 20 years. As long as it was cheap, it was hardly noticeable. Now this gap is making itself painfully apparent and is forcing us to boost our expansion - wherever we are allowed.", "11519": "@schulrategger Long-term contracts are necessary in the industry in order to calculate prices in the long term. This has nothing to do with \"speculation\".\nAs far as we are concerned: we are largely in public hands, but that is probably already known. https://t.co/lI9xkHQjsV", "11520": "@lang_psy Legal certainty and accelerated procedures would be a start for the accelerated expansion of renewable energy. That's easy to tweet, but in practice it's an enormous challenge. Interventions in the market won't result in a single additional wind turbine being built.", "11521": "@dinischwab @bastiboti Yes, we have been dependent on imports for many years. Since 2021, due to the demand for gas and the war in Ukraine, imported electricity has become enormously more expensive - and now determines the domestic market price.\nhttps://t.co/5DyO9oF96P", "11522": "@werni007 @schulrategger Nobody benefits in the long term from high electricity prices. Local customers, households and industry need a lot of electricity. We distribute most of the profits to the public sector and invest in renewables - wherever we are allowed to. https://t.co/BxmnXShicE", "11523": "@bastiboti @dinusschwab We sold at market prices. We are not allowed to ask for more (abuse of market power) or less (disloyalty). Any profits are either distributed or invested, because the root cause is too little production from renewables.", "11524": "@IdealismPrevail How about: capital for investments in the energy transition (assuming the legal situation allows it).", "11525": "@JohannesSpalj Wait a minute! Please remain respectful despite all the outrage.", "11526": "@netzverwalter This is emergency aid for serious cases and we know that it does not solve the problem. The bottom line is: we have too little electricity from renewable energies. Therefore: expansion - wherever we are allowed. The rest will be distributed: mainly to the public sector. https://t.co/dCTw6Xx1dQ", "11527": "SAMMLUNG VERBUND is showing the first exhibition of the renowned French artist #ORLAN in Austria and is publishing the first German-language monograph on her work.\nhttps://t.co/Gvoef4huef", "11529": "@VortexGerhard Good morning! How can we help?", "11531": "@VortexGerhard The frustration is understandable, we regret it. The number of inquiries has increased significantly again. We are working on it and apologize for the wait.", "11532": "Our fish pass in Altenwörth is so beautiful even in spring that it appeals to the (allegedly very demanding in such things) fans of @LASK_Official. \nMore about the entire project here: https://t.co/92f0vVvoTP https://t.co/9Dywo9bRE8", "11534": "@Peter_Jelinek A good reason to ask what happened to #Olkiluoto3. Since we've been on Twitter, the Finnish power plant block will \"soon\" begin commercial operation.", "11537": "@eukommwien @europe_direct \nThanks for visiting! More about the Limberg III project:\nhttps://t.co/dyI3yh4ibo", "11538": "May 5th from 8:30 a.m.: our next #morningconversation. CEO Michael Strugl will discuss the EU draft for a new electricity market design under the direction of @corinnamilborn with @maurerchr @AKoppl and Jürgen Wahl from #EXAA. #MeritOrder\nRegistration&amp;Livestream 👇\nhttps://t.co/8dtKkeAE2x", "11539": "@chri_gru @at_AEA @EU_Commission @knaus_karina We'll be discussing this live soon.\nhttps://t.co/MtWZDJRvms", "11540": "@alexlausch We are stone sober. Further information for traders is available from @wkoe\nhttps://t.co/cjbktcxN6i", "11541": "@newsroom_jobs Affinity to power plant construction sites (deep down &amp; high up) is not a disadvantage.\nhttps://t.co/NoQ7IsFIWN", "11542": "REMINDER! May 5th, 8:30 a.m.: our #morningconversation: CEO Michael Strugl discusses under the direction of @corinnamilborn with @maurerchr @AKoppl and Jürgen Wahl from #EXAA on the EU draft for a new electricity market design. #MeritOrder\nLivestream 👇\nhttps://t.co/8dtKkeAE2x", "11548": "Our #morningconversation starts in 30 minutes: CEO Michael Strugl, led by @corinnamilborn, will discuss with @maurerchr @AKoppl and Jürgen Wahl from #EXAA about the EU draft for a new electricity market design. #MeritOrder\nLivestream 👇\nhttps://t.co/8dtKkeAE2x", "11549": "Keynote speaker @maurerchr in #morningtalk: #MeritOrder sounded like a \"perfidious\" order, but it is only a model. The electricity market, which has a bad reputation in political circles, worked, as the securing of supplies to France last winter showed. https://t.co/77UWW2Z8Ol", "11550": "Every megawatt hour saved has saved generation from price-setting gas-fired power plants. High prices also provide the right incentives to balance out imbalances in the market - e.g. investment in PV @maurerchr in #morningtalk", "11551": "CEO Strugl: Removing price signals from the market would mean dampening the incentive to invest. If a price signal reduces scarcity, it makes energy saving attractive and encourages investment in renewables. #Morgengespraech https://t.co/0alfe4n2LV", "11552": "@AKoppl: The Commission has taken the right path by focusing on investments, but the effect is medium-term. There is still potential in the proposal to increase the benefits for consumers. This also requires strengthening the network infrastructure. #Morgengespraech https://t.co/TuxSy555Jc", "11553": "CEO Strugl in #morningconversation: The \"Contract for Difference\" would limit the flexibility of pumped storage power plants with a quasi-fixed price. Such restrictions unsettle investments and thus the mobilization of private capital for the #energytransition", "11554": "@AKoppl: Distortions like last year cannot be ruled out. Interventions in short-term consumer prices will be necessary. The dynamics triggered (inflation!) are difficult to get under control. #MorningConversation", "11555": "Jürgen Wahl from #EXAA on the topic of risk: The stock exchange functions as a marketplace. There are a variety of (certified) partners on the stock exchange. With direct marketing with a single partner, the risk of failure increases. #Morgengespraech https://t.co/qL4dezdbpO", "11556": "@PeterMolnarEE From the #morningconversation: The market itself worked. The collateral consequences were and are sometimes harsh. Accompanying instruments are included in the Commission's proposal, but only a comprehensive expansion of renewables will really improve things.", "11557": "CEO Strugl in the #morningconversation on security: A one-year price guarantee, for example, is included in the proposal. The most important building block is sufficient production. If there is a lot of supply on the market, prices fall. That's why the answer is: massive expansion of renewables.", "11558": "@PeterMolnarEE Only as long as gas is needed. Austria also imports an average of 10% of its electricity per year. With each new wind turbine, the number of hours in which expensive gas determines the price decreases.", "11559": "Many thanks to our guests and especially to @corinnamilborn for the excellent #morningtalk moderation! \nOur position on the Commission's proposal will soon be available at https://t.co/8dtKkeAE2x https://t.co/68Qno9DTiK", "11560": "@petermolnaree That's why the best time to create legal certainty for expansion would have been 5-7 years ago. The second best time is now.", "11561": "Perfect timing. https://t.co/1ZmRrVR6hF", "11562": "The water levels on the #Danube are falling again. We visited Austria's strongest river power plant in Altenwörth (Lower Austria) and looked at what the water mass means for the power plant's operation. \n🎥 https://t.co/cavPvFztvq", "11564": "@Energielix Indeed. Unfortunately, it is generally predicted that extreme precipitation will increase as a result of global warming. 1 degree higher temperature means 7% more water in the air, thus higher chances of heavy rain and flooding.", "11565": "@monikaturyna What external costs are estimated in the paper for the final disposal of radioactive waste?", "11566": "@Zolenkan @MarcusWadsak An important contribution to raising awareness about climate change in a Styrian community.", "11567": "@chri_gru Recently it was a bit too much of a good thing.\n\nhttps://t.co/nvsPs6BJvq", "11568": "A full gym guaranteed with guests like these! \nMany thanks to @MarcusWadsak and Hans Peter Hutter for their support at yesterday's information event about our wind farm project in Gaal/Stmk. The #energytransition doesn't happen on its own! #MissionV https://t.co/vUyzMwNb5a", "11569": "The #FishwalkerAid Altenwörth is developing into a diverse habitat as planned. This now requires peace and quiet, for example for the birds that now use the gravel banks as a breeding ground. We ask for your consideration. 🐟🐍🐣\n@LIFEprogramme @via_donau @BML_gv_at\nhttps://t.co/6iwlYAzKgs", "11570": "@derboersianer That's why he was reappointed. 💪\nhttps://t.co/2HXntLuNaL", "11571": "Energy transition needs patient persuasion #MissionV\n\nORF Stmk: Gaaler vote on wind turbines https://t.co/vv0hZmBS25", "11573": "@Kosak_Daniel We can serve as project promoters with the background information.\nhttps://t.co/TImz4wv8WQ", "11574": "Energy transition is sometimes a laborious undertaking on a small scale. We regret the result and thank all supporters of the project. \nhttps://t.co/DSegLFOfdF", "11575": "@derKirchner If you are interested in further information about this project, please click here 👇\nhttps://t.co/TImz4wv8WQ", "11576": "@ichmachnixmit @ThomasPoebel It works. (But not with fossil fuels).", "11577": "@ThomasPoebel More about the planned project: \nhttps://t.co/TImz4wv8WQ", "11578": "@ichmachnixmit @ThomasPoebel By consistently investing in renewables, grids and storage. It will take time, but the technical and physical aspects have already been solved. You just have to want it - and why shouldn't you? #MissionV", "11579": "@ichmachnixmit @ThomasPoebel It would be practical to do it underground.", "11580": "@ichmachnixmit @ThomasPoebel Hydrogen, compressed air and, where possible, classic pumped storage. It's working.\nhttps://t.co/dyI3yh4ibo", "11581": "@ichmachnixmit @ThomasPoebel Yes, we know: the mainstream media is still keeping quiet about it, but it works.", "11582": "@ichmachnixmit @ThomasPoebel We are convinced of that.", "11583": "The VERBUND energy conference is entering a new round 🎉!\nThe implementation of the energy transition is the focus of the inspire energy summit 2023.\n👉 All information at https://t.co/yBBk2E0zG7\n\n#inspire #energyconference https://t.co/0fX6Ut2bcU", "11584": "@struberg @gandi80 @sarah_hoef Yes, the flexibility of hydropower sometimes means that production is throttled back when prices are negative or there are fluctuations in the grid - only in exceptional cases via the weir, mainly, as already described, via the adjustment of the Kaplan runners.", "11585": "@thomaseisenhuth At VERBUND, diversity and inclusion are lived, including in language. That's why we will continue to use gender. Best wishes, Johanna from the VERBUND team.", "11586": "@thomaseisenhuth \nWe at VERBUND stand for diversity and inclusion, including in language. That's why we are clearly in favor of gender equality. Best wishes, Johanna from the VERBUND team.", "11587": "@thomaseisenhuth As I said, we will continue to use gender equality at VERBUND, even if you have your own opinion on the matter. Best wishes, Johanna from the VERBUND team.", "11588": "@nycht Click here for the loyalty offer for our existing customers 👇\nhttps://t.co/NaQI0ISmyj", "11589": "@thomaseisenhuth Our decision to work inclusively and to communicate accordingly means that we address all people of all genders. There is nothing more to say from our side, best regards from the social media team", "11591": "@thomaseisenhuth If gender equality in 2023 is supposed to be \"ideological transformation\", that may be fine with us. https://t.co/kt0wgwkmgC", "11592": "@johanneskopf We are looking for a legally secure solution for both providers and customers. At the moment, this is only really possible with the active consent of the customers. With our offer, we offer a fair price without a contractual obligation - so you can cancel at any time.", "11593": "@martin38990815 No, we are looking for a legally secure solution for both providers and customers. At the moment, this is only really possible with the active consent of the customers.", "11594": "@yvebiskupska Consumers fear price increases, and it is also risky for providers not to have legal certainty for customer contracts. We therefore chose what we believe to be a fairly priced, attractive offer with a price guarantee but the option to cancel at any time.", "11595": "@putzigam Yes: Loyalty offer for our existing customers: 19.70 net cents per kilowatt hour", "11596": "@yvebiskupska Only the developments following the price increases showed for the entire e-economy that the legal framework for price changes is currently inadequate.", "11597": "@nartian22 Hello! What we want to achieve through our customers' consent to the loyalty tariff is legal certainty for both sides.", "11598": "@lucki_van @nartian22 @arbeiterkammer @energiecontrol @bmsgpk @kolbapeter There are no changes to the terms and conditions, existing credits remain valid. What we want to achieve by getting our customers to agree to the loyalty tariff: legal certainty for both sides.", "11599": "@angryfella420 @stefans_tweety No catch: fair price for work + price guarantee for 12 months, although price reductions are possible depending on market developments, and no commitment. There is no change to the terms and conditions, existing credits remain valid", "11600": "@GerhardDeimek The energy transition will not succeed without the massive expansion of wind, solar, storage and grids. This process cannot be reversed, but it can certainly be accelerated.", "11601": "@GerhardDeimek The basis of low prices is a large supply. Therefore, we are grateful for any support in implementing projects - from wind turbines to storage to overhead lines. Without this, there will be neither climate protection nor affordable energy prices.", "11602": "Tomorrow is the day: Our half-year press conference for Q1+2/2023 starts at 9 a.m.\nLive stream 🎥 👇\nhttps://t.co/KU1KskmrNL", "11603": "@Energielix @energate_at Gladly. Anywhere we're allowed. Unfortunately, renewables aren't welcome everywhere.", "11604": "@Energielix @energate_at We are grateful for any support. In addition to an extensive information campaign, events and personal discussions, not even a lecture by @MarcusWadsak could bring about a change.\nhttps://t.co/wgsaPluTnA", "11605": "Ready for the balance sheet press conference for Q1-2/2023!\nHere you can find the livestream from 9 a.m.:\nhttps://t.co/KU1KskmrNL https://t.co/A0vQ52p8DG", "11606": "VERBUND presents balance sheet for the first half of 2023: Good earnings development in the first half of 2023, details in our Corporate News.\nhttps://t.co/XyH8Jg6PnT", "11607": "@Energielix @energate_at @MarcusWadsak That wasn't asked, but was of course part of the information package, but not a relevant reason for the decision.", "11608": "Right from the start, CEO Strugl makes it clear: the good results come from the electricity wholesale business, the household customer business is negative. https://t.co/rbgzZgPisO", "11609": "CEO Strugl: VERBUND, as a leading company in the #energytransition, will invest 15 billion euros in decarbonization over the next 10 years: in renewable generation, storage and networks. #BilanzPK https://t.co/M4wkSACiFi", "11610": "Electricity prices in Austria are still lower than in comparable countries in the EU. #BilanzPK https://t.co/uK8UOpCdIn", "11611": "CFO Kollmann: The energy transformation is a project that requires an enormous amount of capital, intelligence and cooperation. \nCapital is the oxygen for the energy transition and this capital must be earned. #BilanzPK https://t.co/1XGNCFsomv", "11612": "@Energielix @energate_at @MarcusWadsak (Almost) nobody in Gaal questions the necessity of the energy transition and the expansion of renewables.", "11613": "@Energielix @energate_at @MarcusWadsak It is believed that wind and PV systems would be better suited to other locations. To quote a leaflet from Gaal: \n\"Wind power - yes. \nWind farm on the Brandkuppe - NO!!!\" (sic)", "11614": "CEO Strugl: The - understandable - uncertainty among consumers is the result of an uncertain legal situation for price adjustments. It is high time that the legislature ensured legal certainty here. #BilanzPK", "11615": "CEO Strugl: We have a very, very low investment share in new renewables in Austria because the projects all fail, as we recently saw in Styria.#BilanzPK", "11616": "@reicheerde Good advice, legitimate question. It's a work in progress, please be patient.", "11617": "@passchraml Just to clear up any false assumptions: Our end customer business was not responsible for the result. https://t.co/jEDzz7zHDG", "11618": "@oida @energielix @energate_at If we had painted the wind turbines against the sky in a light color, the same accusation would have been made in reverse. Those who want wind turbines will find ways. Those who don't will find excuses. https://t.co/IIh3aL06Tw", "11620": "@LanaTurner12 @a_j_tra @passchraml We have made our customers an offer to switch to a cheaper tariff. This procedure is unfortunately necessary for bureaucratic reasons.", "11621": "@oida @Energielix @energate_at @MarcusWadsak 1. Since 2015, a certificate of origin that excludes nuclear power has been required for imported electricity.\n2. Nuclear power is as dead as Heinz Conrads.", "11622": "@ppudelmutz @a_j_tra @passchraml At this point we remind you who our owners are, i.e. where the money we earn ends up: in the federal and state coffers. https://t.co/9wCE4IquKu", "11623": "@shitlistdotat This is based on the myth that prices are set arbitrarily. A banal principle applies: there is too little electricity from renewables in Europe, so the price is rising. Hanging does not produce a single kilowatt hour more. https://t.co/OI6xWKymHJ", "11624": "@oida @Energielix @energate_at @MarcusWadsak With installations that can be quickly turned on and off. Pumped storage and gas are ideal, with an increasing #H2 share. Nuclear power plants provide base load and are therefore the natural enemies of volatile generation. If there is just enough cooling water.", "11626": "@bernhardkreind @passchraml Electricity market prices are decisive if you act in accordance with the law as a public limited company. Anything else would be market abuse (because you abuse a monopoly position) or breach of trust (if you deprive the owner of his earnings). The problem lies here, among other places 👇 https://t.co/Z7Y1wAoIOV", "11627": "@oida @Energielix @energate_at @MarcusWadsak Norway.", "11628": "@oida @Energielix @energate_at @MarcusWadsak The market will regulate itself. Nuclear power is expensive, risky and comes too late.\nhttps://t.co/LHbPV0EFmO", "11629": "@Energielix @gandi80 They always have been.", "11630": "Registration for the energy conference is now possible! \nWe are looking forward to three days with top-class speakers! The #energytransition needs us all. \n👉 Tickets at https://t.co/S1sHAdBEvb \n#inspire #energyconference #verbund https://t.co/hnNU1Ud2u9", "11631": "The INSPIRE energy summit 2023 offers a challenging and varied conference program full of inspiration, innovation and collaboration!\nWe look forward to your participation 👉 https://t.co/IXVKBi7MY2\n#inspire #energyconference #network https://t.co/3GabanV8cj", "11632": "Keep your eyes open for the flotsam! This message in a bottle🍾 is a rare chance find from the Danube near Altenwörth. We join in the congratulations it contains to Steffi and Simon from Engerwitzdorf. Our (late) wedding present: an invitation to the Berghotel Malta. https://t.co/X9lKl2xoSe", "11633": "@chri_gru Yes, we asked around: it was in the Wachau.", "11634": "⚠️Safety is important: Due to heavy rainfall in Tyrol, the Schlegeis road is closed. We regret this measure. As soon as the road is clear again, we will let you know. 🙏We thank all emergency services and wish those affected in the flood area all the best. https://t.co/J4BTDhUtpQ", "11635": "@masculinetorch @energielix The umbrella organization @oeenergie has compiled the information here: https://t.co/JArJQsMXXz", "11638": "\"Physically everything is fine again\" - well. The transmission network operator @apg_at has its own perception. In principle, however, storage is an indispensable partner in the energy transition. Whether pumped storage or H2 - we will need both.\nhttps://t.co/kXksdWKICc", "11639": "@edwardtellerfan @apg_at It's certainly not a lack of projects and capital. What's holding us back are the extensive approval procedures.", "11640": "@edwardtellerfan @apg_at During the pandemic, yes, but not anymore. The expansion of our generation is closely linked to the level of expansion of the networks. In this respect, there is no room for a shim between us and @apg_at.", "11641": "@puravida_at We'd love to take a look. Are you already a customer of ours?", "11642": "⚽ Today is the day! 🇦🇹 : 🇫🇷 🥅 Austria will face France in the @UEFAcom Women’s Nations League - 📢 it starts at 6:30 p.m.! We wish our ladies from the ÖFB @oefb good luck! 👏 #AUTFRA\n\n#togetherÖSTERREICH https://t.co/Qfz6iEHE10", "11643": "Summarized by @aliciaprager: one of many reasons why the energy transition is not happening as quickly as necessary.\n\nhttps://t.co/Uio3kRwxDC", "11644": "Today we are back in action - together with 25 organizations, 30 task forces and more than 500 people in a large-scale exercise on a challenging #blackout scenario, including @apg_at @EVN @WienEnergie and many others.\nhttps://t.co/1ym8RtoX78", "11645": "@mirellajohler @apg_at @evn @wienenergie As banal as it sounds: turn on the radio and listen to ORF. Official warnings and instructions are given there. \nA good opportunity to find out more here:\nhttps://t.co/JDnliqHsPv", "11646": "Start of the #INSPIRE energy summit 2023 with a joint boat trip in front of a picturesque panorama on Lake Wolfgang. ⛴️⛰️ Getting to know each other, networking and exchanging ideas are the focus on the first day of the conference - implementing the energy transition together! 🤝#energyconference #verbund https://t.co/ldD4Z296eg", "11647": "CEO Michael Strugl officially opened the #INSPIRE energy summit and gave an outlook on the upcoming program. 1/2 https://t.co/3kWpi7Xpye", "11648": "\"With the discussions in the coming days, we want to encourage and show: We make it happen. We will show that this transformation is possible, what we have already achieved together and what we will still achieve.\" 2/2", "11649": "@hanshofinger @mirellajohler @apg_at @evn @wienenergie That is certainly good private precaution. However, a blackout is a threat to society as a whole that can only be overcome through good cooperation between all partners - that is exactly what we are practicing.", "11650": "Historian and author Philipp Blom opened today's #INSPIRE conference day with his keynote speech, emphasizing the lack of future scenarios and analyzing the unusual form of hope. https://t.co/QB5GWCc3t2", "11651": "\"We do not have realistic scenarios for the future - that is not enough. A democracy that does not look ahead will crumble. How can we give hope to our societies? Hope is a strange animal. Hope is not the optimism that everything will be fine.", "11652": "But the indispensable will to do something because it is important. It is time for our society to think boldly, much more boldly than our politicians do.\"", "11653": "Renowned author Marc Elsberg then explained the importance of ideas and their narratives: \"At the beginning of change, we need ideas about what the future should look like. But we also have to be able to formulate these ideas so that the world understands them.\" https://t.co/BAN3sC7HJT", "11654": "“We need to think about our narratives to shape the future.”\n#inspire #energyconference", "11655": "The first session was concluded by CEO Michael Strugl, who emphasized that the green transformation is possible because it is already in full swing: \"It's possible! I have a picture of the future that is positive, it's possible! https://t.co/ZQIoKMFYAP", "11656": "For example, because we are building a 480 MW pumped storage power plant with Limberg III. We at VERBUND are all-in, with our networks, our know-how, our employees and our investments - we are investing around 15 billion euros in the coming decade.", "11657": "I want us to be able to say to our children: Yes, we did everything we could to make this positive image of the future a reality.”", "11658": "The success of the energy transition will be significantly influenced by whether and when it is possible to build a hydrogen economy in which climate-neutral hydrogen is available in sufficient quantities. https://t.co/mXBxDZOUCy", "11659": "The processes to achieve this goal were explained in the panel: “Energy transition through green hydrogen”: from production to transport to use in suitable plants.", "11660": "VERBUND COO Achim Kaspar emphasizes: “Transformation is the constant in the history of VERBUND.” https://t.co/PINwr1okMH", "11661": "Daniel Böhmer from Aurora Energy Research: “Energy Storage Systems (ESS) are essential for the implementation and acceleration of the energy transition.” https://t.co/hamNAJhFaz", "11662": "Werner Brandauer from SIEMENS discusses how the use and analysis of data can support the energy transition. Because a successful energy transition needs intelligent networks. https://t.co/zvZzpV70xp", "11663": "The last panel of the day provided exciting insights into opportunities and challenges for making business models in various industries more sustainable. https://t.co/1gFJTVwFML", "11664": "The day was concluded by the renowned climate researcher Hans Joachim Schellnhuber. He provided startling information and details about the state of the global climate and made it clear that climate neutrality is not enough, but that we must actively restore the climate. https://t.co/eJMSnfNEiB", "11667": "Michael Altrichter gave an overview of the start-up landscape in Austria and outlooks on the use of artificial intelligence: \"No individual or nation state can solve the coming challenges; this requires common knowledge and https://t.co/4V059Mgyre", "11668": "In my opinion, this is artificial intelligence.”", "11669": "Holaluz founder Carlota Pi has revolutionised the Spanish electricity sector with energy and optimism. She explained her vision in a video message: \"We are transitioning from an economy that produces centralized, polluting and non-green, towards an economy that https://t.co/OOTeOZ3MzQ", "11671": "Selected start-ups from the VERBUND X Accelerator program were represented at #INSPIRE and pitched their ideas - the best pitch was chosen by audience voting. https://t.co/hqlorDxk6x", "11672": "As part of the panel \"Innovation is not a solo trip\", the different perspectives from the point of view of business angels, corporate innovations and founders were examined and discussed. https://t.co/S5CctSt5u7", "11673": "PV is experiencing a real boom: never before have so many systems been installed as last year and a slowdown is not expected. With the expansion, the challenges are also increasing: what the PV boom, grid load and costs of the distribution network expansion entail were discussed https://t.co/oshXYXWd8C", "11674": "Viktoria Gass (PWC), Werner Eder (SKE) and Roland Matous (Energy Future Lower Austria).", "11675": "Successful transformation has a lot to do with reliability and stability. A challenge that affects regulators on the one hand and those regulated on the other. What it requires, as well as the opportunities and the current reality https://t.co/Z92bptqQs0", "11676": "were discussed at the final panel of #INSPIRE with Barbara Schmidt (OeEnergie) and Alfons Haber (E-Control).", "11677": "@stefanauer11 it's a shame that you don't want to accept our offer. \nWe would still like to thank you for your long-standing loyalty to VERBUND.\n\nBest wishes,\nSara from the VERBUND social media team.", "11678": "@lexilex75 Find out more about the #Inspire conference here:\nhttps://t.co/Sp4hjivont", "11679": "@stefanauer11 Simply put: Because under the current legal situation, only a new contract provides security. Anything else would be a potentially illegal, unilateral change to the contract.", "11680": "What a day! Perfect conditions for a visit to the Altenwörth bypass, also known as the \"fish migration aid\". @OeEnergie with @vollenergie Thanks for coming! @LIFEprogramme\nMore about the project: https://t.co/92f0vVvoTP https://t.co/wyqkuIN0Fk", "11681": "Unfortunately behind the paywall, but it is worth reading the statements by Erich Frommwald (industry division spokesman at the WKOe).\n\nhttps://t.co/WRXaOMf7R0", "11682": "@oeenergie @vollenergie @lifeprogramme thank you for your visit! It was a great pleasure for us!", "11683": "@chorherr Details can be found in the \"Integrated Report\" (2022), from page 137.\n\n2023 to 2025: €4.5 billion\n\nLong term: With investments totaling €15 billion over the next 10 years, we are fully geared towards the energy future.\n\nhttps://t.co/dd7c5Yia5a", "11684": "#Inspire Energy Talk on October 17th, 8.30 a.m. Topic \"Inventory #H2\" \nUnder the leadership of @corinnamilborn, CEO Michael Strugl discusses with @yooditneyer , Bernhard Painz (AGGM) and Manuel Beschliesser (COO LAT Nitrogen)\n\nTo register 👉 https://t.co/lrLhvEIZSi https://t.co/xBYdDJbEFT", "11685": "\"We need to move from the hard shoulder to the fast lane when it comes to approval procedures.\" https://t.co/ULojVTXW26", "11687": "Reminder for the #Inspire Energy Talk tomorrow, 8.30 a.m. Topic \"Inventory #H2\" \nUnder the leadership of @corinnamilborn, CEO Michael Strugl will discuss with @yooditneyer, Bernhard Painz (AGGM) and Manuel Beschliesser (COO LAT Nitrogen)\n\nRegistration 👉 https://t.co/lrLhvEIZSi https://t.co/9iCP9gbKf7", "11689": "Good morning, we've made coffee! Our #Inspire Energy Talk on \"Taking stock of #H2\" is about to start\n🎥Livestream: https://t.co/lrLhvEIZSi https://t.co/8Nt9HrZwCK", "11690": "Unfortunately, we start the #INSPIRE energy talk with unpleasant news, delivered by moderator @corinnamilborn: CEO Strugl is absent due to illness. Franz Helm, @yooditneyer, Bernhard Prinz (AGGM) and Manuel Beschliesser (COO LAT Nitrogen) will be discussing https://t.co/1k6zNSoUJ2", "11691": "@yooditneyer “Think fast and slow”. \n\"Fast\": increased expansion of renewable energy and #H2 in our own country\n\"Slow\": consider uncertainties, remain flexible, learn from building the #H2 economy\n#INSPIRE https://t.co/41cNMVyFSS", "11692": "Development of infrastructure for #H2 with the goal: Austria should be integrated into a European H2 market as soon as possible. \"Southern corridor\" for pipeline-based import is more economically interesting than shipping, says @yooditneyer at #INSPIRE energy talk", "11693": "In response to @yooditneyer's question about a funding system for #H2: In principle, an action model that will promote competition and should have a long-term effect. The pilot project will start in 2024. #INSPIRE", "11694": "Bernhard Prinz (AGGM): Electrolysis should be close to the producer, as #H2 can be transported more efficiently than electricity. \"The regulator still lacks the regulatory instruments for this in its toolbox.\" #INSPIRE https://t.co/HCWu0Sw7Dd", "11695": "Wind and PV industries are becoming natural partners of the #hydrogen economy. Seasonal energy balancing through stored #H2 is necessary, but this does not reduce the pressure on the electricity grid expansion. #INSPIRE", "11696": "Manuel Beschliesser (COO LAT Nitrogen): Green #H2 is the game changer in the industry. Production and storage are at the heart of the transformation. The request is \"planning security\" in terms of funding and legal framework conditions. #INSPIRE", "11697": "The @BMKlimaschutz has presented the implementation laws and brought them into the budget negotiations for the next 10 years. \"We are doing parallel development work on many levels,\" says @yooditneyer #INSPIRE", "11700": "@PatrickGruska We have dedicated a separate chapter to the topic in our research project \"Hydropower - Electricity - Society\".\nhttps://t.co/inTkSn4vaK", "11701": "We are also at the #GEWINNmesse again this year and from our stand we have the best view of Georg Wailand's impressive interview marathon with the top representatives of the ATX companies. @GEWINNcom https://t.co/K8kvOHMvVM", "11702": "Announcement on our own behalf. We look forward to seeing you. #heaven https://t.co/y4Q8I6vHbW", "11703": "We congratulate the 🏆🏆🏆 winners Sandra Szedenik, Pia Schwarzinger and Magdalene Opoku @tu_wien \nhttps://t.co/gjyoLvLzbb", "11704": "Disprove myths, don't repeat them. https://t.co/A2UvGXSyaC", "11712": "Step for growth in the wind sector: Acquisition of a 56.4 MW wind portfolio in Germany. \n#MissionV\n\nhttps://t.co/2RwYkBPfsw", "11713": "Our results for quarters 1-3/2023: Good earnings development, increased outlook for 2023 and above all: €15 billion for decarbonization and security of supply in Austria #MissionV\n\nhttps://t.co/Ryyq6hAnOg", "11714": "@AttacAustria Thanks for the interesting and fair discussion. (Next time we would like to have a more appropriate setting - there would have been a free meeting room.)", "11715": "More about the Riedl energy storage project here: \n👉https://t.co/5e5bPotI2i https://t.co/Fq8TiSJsy3", "11717": "The environmental organizations @wwfaustria, @global2000 and ÖKOBÜRO are calling for a massive, environmentally friendly expansion of photovoltaics in Austria in a joint consensus paper with VERBUND.\n\nTo the joint release 👇\nhttps://t.co/DQkqTjQ9dn", "11719": "@Rubberinchen @Rubberinchen At least we had your attention ☺\nWe asked around: Registered letters can only be sent with a sender. Unfortunately, it can happen that the colleagues at the post office forget the sender when leaving the notification under time pressure.", "11720": "@Rubberinchen @Rubberinchen Please accept our apologies. The post office is sticking to its description: our envelopes should look like this with the sender on the address sticker. Please send a photo of what you actually received so that we can investigate. https://t.co/14EnsM9SoR", "11721": "Good arguments for the expansion of wind power from @FranzEssl1 and supporters in Lower Austria. The Gmünd district newspapers are offering an online vote. \n(the link is already being shared eagerly on relevant channels. Unfortunately on the wrong ones)\n\nGo to the vote 👇\nhttps://t.co/qmWiu57SXa", "11722": "@melzwitschert @chri_gru Yes, it's true. This position is heard more often.", "11723": "@LT_IR @chri_gru Online voting of this kind is in line with contemporary media logic. If it cannot be prevented, then it must be accepted. \nAnd ensure a certain level of equality of opportunity.", "11724": "@power4eu @FranzEssl1 OK, not so loud. The survey runs until 4 p.m.", "11725": "@thomaseisenhuth @FranzEssl1 @thomaseisenhuth We ask out of interest: Significantly more expensive than what?", "11727": "Winter is actually the time for maintenance for us. In Ybbs-Persenbeug, an exceptional machine is currently getting its overdue service. An insight into the dimensions of a Danube turbine here.🎥\nhttps://t.co/Y2AuSkjZnG", "11728": "#PurpleLightUp Day - International Day of People with Disabilities 💜 We are setting an example and lighting up our company headquarters in purple. People with disabilities have a right to participation and self-determination.\n\n#inclusion #purplelightupday #inclusionmatters https://t.co/Y4OjZ7vZa0", "11729": "@martinsadleder Purple, our friends in favorites would note.", "11730": "@martinsadleder @martinsadleder Hello Martin, \nLila is the German translation for purple! 😉\nThe #PurpleLightUp campaign is intended to send a visible signal for people with disabilities.\nBest wishes, Marie from the VERBUND team", "11731": "#inspire Energy Talk: On December 20th from 8.30 a.m. ⌚ CEO Michael Strugl will discuss the complex topic of \"storage and flexibility\" with Birgit Bach @AITtomorrow2day , Alfons Haber @energiecontrol and @GChristiner from @apg_at\nModeration: @corinnamilborn \nRegistration 👇\nhttps://t.co/k0wS0FBU1q https://t.co/ineqAt8kET", "11732": "⚽ Go girls! 🇦🇹 : 🇳🇴 🥅 In the UEFA Women's Nation League, the Austrians will face Norway this time 📢 Match starts: 7:15 p.m. - good luck ÖFB - Austrian Football Association \n\n#togetherÖSTERREICH https://t.co/i4JvzBac3t", "11733": "@BMLoidl @klimarecht @DeinSalzamt @energiecontrol Unfortunately, we have no influence on the regional networks. As far as the challenge of nationwide expansion is concerned, @apg_at can explain better.\n\nhttps://t.co/yDMKI0WEZr", "11734": "Reminder #inspire Energy Talk: December 20th from 8.30am ⌚ CEO Michael Strugl will discuss the complex topic of \"Storage and Flexibility\" with Birgit Bach @AITtomorrow2day, Alfons Haber @energiecontrol and @GChristiner @apg_at\nModeration: @corinnamilborn \nRegistration 👇\nhttps://t.co/k0wS0FBU1q https://t.co/NUbGUX1HO8", "11735": "Reminder! #inspire Energy Talk: December 20th from 8.30am ⌚ CEO Michael Strugl will discuss the complex topic of \"storage and flexibility\" with Birgit Bach @AITtomorrow2day , Alfons Haber @energiecontrol and @GChristiner @apg_at\nModeration: @corinnamilborn \nRegistration 👇\nhttps://t.co/k0wS0FBU1q https://t.co/ESg4m0sjJa", "11736": "If anyone from the energy bubble still needs a code for heaven 👉DM are open \nhttps://t.co/SYNtbHVrjq", "11737": "In half an hour we start with #inspire Energy Talk: CEO Michael Strugl with Birgit Bach @AITtomorrow2day , Alfons Haber @energiecontrol and @GChristiner @apg_at about \"Storage and Flexibility\"\nModeration: @corinnamilborn \nLivestream from 8.30 a.m.\nhttps://t.co/k0wS0FBU1q https://t.co/8dXkp8wAOO", "11738": "Brigitte Bach @AITtomorrow2day presents current research results on the need for flexibility in the electricity sector at #Inspire Energy Talk: The greatest increase in the need for flexibility is in very short-term and seasonal flexibility. https://t.co/aOYxXu7vt9", "11739": "Good news for hydropower: Climate change is not leading to a decline in production, but rather to a profile shift from summer to winter. In terms of consumption, the need for heat is reduced, but the need for cooling is increasing, says Brigitte Bach @AITtomorrow2day #Inspire", "11740": "Lack of infrastructure is expensive: @GChristiner ner @apg_at mentions 150 million euros in costs in 2023 just due to a lack of network infrastructure for flexibility. And yet: there is no business case for flexibility products on the electricity market in Austria. #Inspire https://t.co/Qq4LZOJIwC", "11741": "CEO Michael Strugl: Germany has a concrete, comprehensive strategy to accelerate storage expansion - including the duration of the process. \"That's how it has to be done.\" #Inspire https://t.co/qb3VKP81nH", "11742": "Brigitte Bach @AITtomorrow2day: We will not be able to avoid large-scale technical solutions, central storage facilities are also needed, specifically: large batteries, hydrogen storage. This requires rapid market integration and market design. #Inspire", "11743": "According to @GChristiner @apg_at, there is still a lot to do in the distribution network to address the flexibility there (home storage, electric cars). Without this, there is no incentive for private customers to make their infrastructure available. #Inspire", "11744": "We will need all options because they offer different levels of flexibility. It might have been wiser to push for storage instead of the PV expansion that is already taking place. \"I would be in favor of subsidizing storage,\" says CEO Strugl. #Inspire", "11745": "CEO Strugl: Pumped storage power plants will continue to be successful in the market in the future when other forms of storage enter the market, because demand will grow with the expansion: from currently 60 GW to 500 GW by 2050 #Inspire", "11746": "Many thanks to our guests at the #Inspire Energy Talk and especially to the excellent moderation by @corinnamilborn \nThe recording will be available here soon 🎥\nhttps://t.co/k0wS0FBU1q https://t.co/G2sPHtOWs8", "11753": "More onshore wind in 🇩🇰 can save electricity consumers billions. It is quick to set up, but slow case processing stands in the way. At @Vestas we are ready to deliver, but political action is needed. Good that @klimamin is now looking at it ➡️https://t.co/q7CZlUPQ4y #dkpol #dkgreen https://t.co/4XWmRzQxKj", "11754": "This is the wrong way to go! Offshore wind projects that should have been dealt with urgently have instead been put on hold. We at @Vestas hope that the government will correct this as soon as possible, so that the projects can be approved and contribute green and safe power to 🇩🇰 and 🇪🇺.\nhttps://t.co/l8BTTNjvgc", "11762": "A solution must be found as soon as possible! Let's not throw either climate ambitions or a Danish leadership position in wind energy overboard. The entire value chain in the Danish wind turbine industry is waiting for the expansion of renewable energy to accelerate. https://t.co/IIoogcl8FC", "11769": "It is very positive that the government is starting negotiations on tenders for 9GW of offshore wind, even if they cannot replace the open-door scheme. The Danish value chain is ready to deliver, also on demands for sustainability and cyber security. Let's get all 9GW tendered quickly.\nhttps://t.co/DC9zZaPLJ4", "11770": "#SPIREC2023 began today with the presence, among others, of the President @sanchezcastejon and the Vice President and Minister of @mitecogob, @Teresaribera. \n\nOur CEO, Henrik Andersen, also present, has warned that all European wind turbine manufacturers (1/2) https://t.co/f0eOu9KNw7", "11771": "are registering large losses and has highlighted the need for closer public-private collaboration that results in the elimination of barriers to the energy transition to consolidate a functioning renewable energy market. (2/2) https://t.co/T1HM2vwM6g", "11810": "It is important that the development of offshore wind in Denmark takes place on terms that balance important considerations such as speed, sustainability, good working conditions, sustainability and cyber security\", says our CEO at @borsendk today. Read more: https://t.co/ J2WObZek6I", "11820": "Welcome to NEKST! We look forward to seeing concrete proposals on how we set the pace for the development of onshore wind in 🇩🇰. The climate target requires 8GW of onshore wind in 2030, so action must be taken behind the work in NEKST as soon as possible! \n\n#dkgreen #dkbiz #dkpol https://t.co/TNCZYz0ygl", "11829": "Thanks for important announcements from @L_Aagaard! \nDenmark leads the way with power-to-x supply and doubling of area for offshore wind. Power-to-x can only happen with much more green electricity, so more wind turbines are absolutely essential.\nhttps://t.co/IknJYc2trX", "11850": "(1/3) As a society and industry, we must get used to the fact that wind farms are critical infrastructure. The huge investments to be made in the development of offshore wind farms in the coming years are due both to considerations for the climate and security of supply.\n\n#dkbiz #dkpol #dkgreen https://t.co/UqVfbBzGrL", "11851": "(2/3) Therefore, it also makes sense to start talking about state co-ownership. Our CEO has therefore spoken positively about the government's proposal that the state can be part owner of the future Danish offshore wind farms to @borsendk:\nhttps://t.co/aibBAnwHpp", "11852": "(3/3) \"But it is clear that the state should not sit as the main shareholder, or have other rights than you normally have as a minority shareholder. And then of course you have to make sure that it neither exceeds the speed nor the amount of the sea wind that comes up.” – tells him. https://t.co/hqNqCQPJi3", "11854": "It is a pity that it has been decided to reject open-door offshore wind projects, which with the production of green power and PtX could have contributed to DK's and European energy security, independent of gas and the green transition already in a few years. https://t.co/ry5M87Yq72\n#dkpol #dkgreen", "11856": "🇩🇰 #Folkemødet thread / in Danish\n \nExciting panel debate at the #Folkemødet about recycling wind energy! Our Head of Sustainability, Lisa Ekstrand and Henrik Gran Pedersen from Stena Recycling shared Vestas' circularity solution and how we, together with Olin, scale the value chain. https://t.co/CGux4LD1bi", "11857": "Ulrik Stridbæk from @OrstedDK was with us and gave an insight into our recently announced partnership. We look forward to working together for a more sustainable future.\n\n #sustainability #dkpol #dkgreen https://t.co/RsfMvWIh73", "11858": "Energy policy is industrial policy, especially in Norway and Denmark. Thank you for the visit, 🇳🇴 Minister of Industry @jcvestre and 🇩🇰 Minister of Business @mfMorten at Vestas' test center. Quality and testing are crucial for the future development of wind. #dkpol #dkgreen https://t.co/pVOMIs3dhz", "11859": "Debate on offshore wind on the last day of #fmdk. @MDyrholm: 🇩🇰 has more to gain than most when it comes to being a leader in offshore wind. Energy and industrial policy go hand in hand with a wind turbine industry that employs 30,000. https://t.co/cGZxZ0q0sw", "11860": "Therefore, the focus on conditions for testing and development is also crucial. #dkpol #dkgreen #dkbiz #people's meeting https://t.co/x9jidFQgXy", "11869": "🇩🇰 / in Danish: 4 times more renewable energy is needed on land to reach the climate target, and the municipalities play an important role. The Renewable Energy Alliance is launched today and we... (1/2)\n#dkgreen #dkbiz https://t.co/7ypLG9g9I5", "11870": "...proposes that municipalities that take responsibility for the green transition should be allowed to keep the tax revenue from projects. See more here ☟\nhttps://t.co/fWze5ADpU5 https://t.co/sbxh2KmPnF", "11892": "🇩🇰 / in Danish:\nWe have helped start the Alliance for Sustainable Energy on land, which has launched 6 strong recommendations on how to get more wind turbines up on land. Read more here: https://t.co/IlqdscaRLk https://t.co/kffVYMFsq9", "11893": "🇩🇰/ in Danish: In Denmark, we have decided to double our onshore wind by 2030. But this year, more wind turbines will be taken down than erected. We must increase the pace of the green transition. \nhttps://t.co/3qoItNWfyo", "11919": "🇩🇰 (in Danish): Thank you for visiting our factory in Colorado, @mfMorten. Positive with your continued focus and support for Vestas and Danish green companies in the USA. #dkgreen #dkbiz #dkpol https://t.co/ZpbvZa4vhh", "11928": "🇩🇰: This year, until now, purchase agreements have been concluded on wind turbines for less than a tenth of what is needed to achieve the political goals.  Read more: https://t.co/6j3q7mW6X4\n\n#dkpol #dkgreen https://t.co/qqWLEQZqC8"}